<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>JVM笔记 - 高效并发（Java内存模型与线程） | arthinking | ChinSyun Pang&#39;s blog</title>
  <meta name="author" content="arthinking">
  
  <meta name="description" content="Struggle for HighPay zoom.">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="JVM笔记 - 高效并发（Java内存模型与线程）"/>
  <meta property="og:site_name" content="arthinking"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="arthinking" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/">arthinking</a>
  </h1>
  <p class="site-description">ChinSyun Pang&#39;s blog</p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        <!-- ttoc -->
<article class="post article">

  
  
    <h3 class="article-title"><span>JVM笔记 - 高效并发（Java内存模型与线程）</span></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120701_JVM笔记 - 高效并发（Java内存模型与线程）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;</p>
<p>#2&#x3001;&#x786C;&#x4EF6;&#x7684;&#x6548;&#x7387;&#x4E0E;&#x4E00;&#x81F4;&#x6027;<br>&#x57FA;&#x4E8E;&#x544A;&#x8BC9;&#x7F13;&#x5B58;&#x7684;&#x5B58;&#x50A8;&#x4EA4;&#x4E92;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x5904;&#x7406;&#x5668;&#x4E0E;&#x5185;&#x5B58;&#x7684;&#x901F;&#x5EA6;&#x77DB;&#x76FE;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p>&#x5904;&#x7406;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x8F93;&#x5165;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x5728;&#x8BA1;&#x7B97;&#x4E4B;&#x540E;&#x5C06;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x91CD;&#x7EC4;&#xFF0C;&#x4FDD;&#x8BC1;&#x8BE5;&#x7ED3;&#x679C;&#x4E0E;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;</p>
<p>#3&#x3001;Java&#x5185;&#x5B58;&#x6A21;&#x578B;<br>&#x7EBF;&#x7A0B;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x4E86;&#x88AB;&#x8BE5;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x4E3B;&#x5185;&#x5B58;&#x526F;&#x672C;&#x62F7;&#x8D1D;&#xFF0C;&#x7EBF;&#x7A0B;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF08;&#x8BFB;&#x53D6;&#x3001;&#x8D4B;&#x503C;&#x7B49;&#xFF09;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</p>
<p>##3.1&#x3001;&#x4E3B;&#x5185;&#x5B58;&#x4E0E;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;</p>
<p>##3.2&#x3001;&#x5185;&#x5B58;&#x95F4;&#x4EA4;&#x4E92;&#x64CD;&#x4F5C;</p>
<p>##3.3&#x3001;&#x5BF9;&#x4E8E;volatile&#x578B;&#x53D8;&#x91CF;&#x7684;&#x7279;&#x6B8A;&#x89C4;&#x5219;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x4E3A;volitile&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x5C06;&#x5177;&#x5907;&#x4E24;&#x79CD;&#x7279;&#x6027;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x4FDD;&#x8BC1;&#x6B64;&#x53D8;&#x91CF;&#x5BF9;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<hr>
<p>volitile&#x53D8;&#x91CF;&#x5728;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x5F97;&#x51FA;&#x57FA;&#x4E8E;volitile&#x53D8;&#x91CF;&#x7684;&#x8FD0;&#x7B97;&#x5728;&#x5E76;&#x53D1;&#x4E0B;&#x662F;&#x5B89;&#x5168;&#x7684;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>volatile&#x53D8;&#x91CF;&#x7684;&#x8FD0;&#x7B97;&#x5728;&#x5E76;&#x53D1;&#x4E0B;&#x4E00;&#x6837;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#x5F53;getstatic&#x6307;&#x4EE4;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53D6;&#x5230;&#x64CD;&#x4F5C;&#x6808;&#x9876;&#x65F6;&#xFF0C;volatile&#x5173;&#x952E;&#x5B57;&#x4FDD;&#x8BC1;&#x4E86;race&#x7684;&#x503C;&#x5728;&#x6B64;&#x65F6;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6267;&#x884C;iconst_1&#x3001;iadd&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x52A0;&#x5927;&#x4E86;&#x3002;</p>
<p>&#x7531;&#x4E8E;volatile&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x5728;&#x4E0D;&#x7B26;&#x5408;&#x4EE5;&#x4E0B;&#x4E24;&#x6761;&#x89C4;&#x5219;&#x7684;&#x8FD0;&#x7B97;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x8981;&#x901A;&#x8FC7;&#x52A0;&#x9501;&#xFF08;&#x4F7F;&#x7528;synchronized&#x6216;java.util.concurrent&#x4E2D;&#x7684;&#x539F;&#x5B50;&#x7C7B;&#xFF09;&#x6765;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#xFF1A;</p>
<ul>
<li><p>&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x5E76;&#x4E0D;&#x4F9D;&#x8D56;&#x53D8;&#x91CF;&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x53EA;&#x6709;&#x5355;&#x4E00;&#x7684;&#x7EBF;&#x7A0B;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;</p>
</li>
<li><p>&#x53D8;&#x91CF;&#x4E0D;&#x9700;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x91CF;&#x5171;&#x540C;&#x53C2;&#x4E0E;&#x4E0D;&#x53D8;&#x7EA6;&#x675F;&#x3002;</p>
</li>
</ul>
<p>&#x4F7F;&#x7528;volatile&#x53D8;&#x91CF;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BED;&#x4E49;&#x662F;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x4F18;&#x5316;&#x3002;</p>
<hr>
<p>&#x666E;&#x901A;&#x7684;&#x53D8;&#x91CF;&#x4EC5;&#x4EC5;&#x4F1A;&#x4FDD;&#x8BC1;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x8D4B;&#x503C;&#x7ED3;&#x679C;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x80FD;&#x83B7;&#x53D6;&#x5230;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x800C;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x4E0E;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x662F;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x5BB9;&#x6613;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4EA7;&#x751F;&#x7591;&#x60D1;&#x7684;&#x5730;&#x65B9;&#xFF0C;volitile&#x5173;&#x952E;&#x5B57;&#x53EF;&#x4EE5;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x4F18;&#x5316;&#x3002;</p>
<p>volatile&#x53D8;&#x91CF;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x4E0E;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x5199;&#x64CD;&#x4F5C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x6162;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x518D;&#x7B28;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x63D2;&#x5165;&#x8BB8;&#x591A;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;&#x6765;&#x4FDD;&#x8BC1;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x53D1;&#x751F;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x4E0D;&#x8FC7;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x573A;&#x666F;&#x4E0B;volatile&#x7684;&#x603B;&#x5F00;&#x9500;&#x4ECD;&#x7136;&#x8981;&#x6BD4;&#x9501;&#x7B2C;&#xFF0C;&#x6211;&#x4EEC;&#x5728;volatile&#x4E0E;&#x9501;&#x4E4B;&#x4E2D;&#x9009;&#x62E9;&#x7684;&#x552F;&#x4E00;&#x4F9D;&#x636E;&#x4EC5;&#x4EC5;&#x662F;volatile&#x7684;&#x8BED;&#x4E49;&#x80FD;&#x5426;&#x6EE1;&#x8DB3;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x4FEE;&#x6539;&#x4E0D;&#x4F9D;&#x8D56;&#x4E0E;&#x539F;&#x503C;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;volatile&#x5173;&#x952E;&#x5B57;&#x5B9E;&#x73B0;&#x5148;&#x884C;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#x3002;</p>
</blockquote>
<p>##3.4&#x3001;&#x5BF9;&#x4E8E;long&#x548C;double&#x578B;&#x53D8;&#x91CF;&#x7684;&#x7279;&#x6B8A;&#x89C4;&#x5219;<br>&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x76EE;&#x524D;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x7684;&#x5546;&#x7528;&#x865A;&#x62DF;&#x673A;&#x51E0;&#x4E4E;&#x90FD;&#x9009;&#x62E9;&#x628A;64&#x4F4D;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x4F5C;&#x4E3A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x6765;&#x5BF9;&#x5F85;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5728;&#x7F16;&#x7801;&#x65F6;&#x4E00;&#x822C;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x7528;&#x5230;&#x7684;long&#x548C;double&#x53D8;&#x91CF;&#x4E13;&#x95E8;&#x58F0;&#x660E;&#x4E3A;volatile&#x3002;</p>
<p>##3.5&#x3001;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x4E0E;&#x6709;&#x5E8F;&#x6027;</p>
<p>###&#x539F;&#x5B50;&#x6027;<br>&#x7531;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x6765;&#x76F4;&#x63A5;&#x4FDD;&#x8BC1;&#x7684;&#x539F;&#x5B50;&#x6027;&#x53D8;&#x91CF;&#x64CD;&#x4F5C;&#x5305;&#x62EC;&#xFF1A;read&#x3001;load&#x3001;assign&#x3001;use&#x3001;store&#x548C;write&#x3002;</p>
<p>###&#x53EF;&#x89C1;&#x6027;<br>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x53D8;&#x91CF;&#x4FEE;&#x6539;&#x540E;&#x5C06;&#x65B0;&#x503C;&#x540C;&#x6B65;&#x56DE;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x5728;&#x53D8;&#x91CF;&#x8BFB;&#x53D6;&#x524D;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x5237;&#x65B0;&#x53D8;&#x91CF;&#x503C;&#x8FD9;&#x79CD;&#x4F9D;&#x8D56;&#x4E3B;&#x5185;&#x5B58;&#x4F5C;&#x4E3A;&#x4F20;&#x9012;&#x5A92;&#x4ECB;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x53EF;&#x89C1;&#x6027;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x8FD8;&#x662F;volatile&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x4E0E;volatile&#x53D8;&#x91CF;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;volatile&#x7684;&#x7279;&#x6B8A;&#x89C4;&#x5219;&#x4FDD;&#x8BC1;&#x4E86;&#x65B0;&#x503C;&#x80FD;&#x7ACB;&#x5373;&#x540C;&#x6B65;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x524D;&#x7ACB;&#x5373;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x5237;&#x65B0;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BF4;volatile&#x4FDD;&#x8BC1;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#x65F6;&#x53D8;&#x91CF;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x800C;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x5219;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x9664;&#x4E86;volatile&#x4E4B;&#x5916;&#xFF0C;Java&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x80FD;&#x5B9E;&#x73B0;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x5373;synchronized&#x548C;final&#x3002;</p>
<p>###&#x6709;&#x5E8F;&#x6027;<br>Java&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;volatile&#x548C;synchronized&#x4E24;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x6765;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x64CD;&#x4F5C;&#x7684;&#x6709;&#x5E8F;&#x6027;&#xFF0C;volatile&#x5173;&#x952E;&#x5B57;&#x672C;&#x8EAB;&#x5C31;&#x5305;&#x542B;&#x4E86;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x800C;synchronized&#x5219;&#x662F;&#x7531;&#x201C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;lock&#x64CD;&#x4F5C;&#x201D;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x83B7;&#x5F97;&#x7684;&#xFF0C;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x51B3;&#x5B9A;&#x4E86;&#x6301;&#x6709;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x7684;&#x4E24;&#x4E2A;&#x540C;&#x6B65;&#x5757;&#x53EA;&#x80FD;&#x4E32;&#x884C;&#x5730;&#x8FDB;&#x5165;&#x3002;</p>
<p>&#x5927;&#x90E8;&#x5206;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x90FD;&#x80FD;&#x4F7F;&#x7528;synchronized&#x6765;&#x5B8C;&#x6210;&#x3002;synchronized&#x7684;&#x201C;&#x4E07;&#x80FD;&#x201D;&#x4E5F;&#x95F4;&#x63A5;&#x65E9;&#x5C31;&#x4E86;&#x5B83;&#x88AB;&#x7A0B;&#x5E8F;&#x5458;&#x6EE5;&#x7528;&#x7684;&#x5C40;&#x9762;&#xFF0C;&#x8D8A;&#x201C;&#x4E07;&#x80FD;&#x201D;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x4F34;&#x968F;&#x7740;&#x8D8A;&#x5927;&#x7684;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x3002;</p>
<p>##3.6&#x3001;&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;<br>&#x4F9D;&#x9760;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x51E0;&#x6761;&#x89C4;&#x5219;&#x4E00;&#x63FD;&#x5B50;&#x5730;&#x89E3;&#x51B3;&#x5E76;&#x53D1;&#x73AF;&#x5883;&#x4E0B;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x662F;&#x5426;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x51B2;&#x7A81;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0B;&#x4E00;&#x4E9B;&#x201C;&#x5929;&#x7136;&#x7684;&#x201D;&#x5148;&#x884C;&#x53D1;&#x751F;&#x5173;&#x7CFB;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x89C4;&#x5219;</li>
<li>&#x7BA1;&#x7A0B;&#x9501;&#x5B9A;&#x89C4;&#x5219;</li>
<li>volatile&#x53D8;&#x91CF;&#x89C4;&#x5219;</li>
<li>&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x89C4;&#x5219;</li>
<li>&#x7EBF;&#x7A0B;&#x7EC8;&#x6B62;&#x89C4;&#x5219;</li>
<li>&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#x89C4;&#x5219;</li>
<li>&#x5BF9;&#x8C61;&#x7EC8;&#x7ED3;&#x89C4;&#x5219;</li>
<li>&#x4F20;&#x9012;&#x6027;</li>
</ul>
<p>#4&#x3001;Java&#x4E0E;&#x7EBF;&#x7A0B;</p>
<p>##4.1&#x3001;&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;<br>Thread&#x7C7B;&#x4E0E;&#x5927;&#x90E8;&#x5206;&#x7684;Java API&#x6709;&#x663E;&#x8457;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x5B83;&#x7684;&#x6240;&#x6709;&#x5173;&#x952E;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x58F0;&#x660E;&#x4E3A;Native&#x7684;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x4E3B;&#x8981;&#x6709;3&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;&#x4F7F;&#x7528;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x3001;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x548C;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x52A0;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;&#x6DF7;&#x5408;&#x5B9E;&#x73B0;&#x3002;</p>
<p>###&#x4F7F;&#x7528;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;<br>&#x7531;&#x4E8E;&#x662F;&#x57FA;&#x4E8E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5404;&#x79CD;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x521B;&#x5EFA;&#x3001;&#x6790;&#x6784;&#x53CA;&#x540C;&#x6B65;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;&#x800C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x4EF7;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x518D;&#x7528;&#x6237;&#x6001;&#x548C;&#x5185;&#x6838;&#x6001;&#x4E2D;&#x6765;&#x56DE;&#x5207;&#x6362;&#x3002;</p>
<p>###&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;</p>
<p>###&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x52A0;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;&#x6DF7;&#x5408;&#x5B9E;&#x73B0;</p>
<p>###Java&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;</p>
<p>##4.2&#x3001;Java&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;<br>&#x5206;&#x4E3A;&#x534F;&#x540C;&#x5F0F;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x548C;&#x62A2;&#x5360;&#x5F0F;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x3002;Java&#x4F7F;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x62A2;&#x5360;&#x5F0F;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x4F18;&#x5148;&#x7EA7;&#x5E76;&#x4E0D;&#x662F;&#x592A;&#x9760;&#x8C31;&#xFF0C;&#x539F;&#x56E0;&#x662F;Java&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x901A;&#x8FC7;&#x6620;&#x5C04;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x751F;&#x7EBF;&#x7A0B;&#x4E0A;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>##4.3&#x3001;&#x72B6;&#x6001;&#x8F6C;&#x6362;</p>
<p>###&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x4F1A;&#x8BA9;&#x7EBF;&#x7A0B;&#x9677;&#x5165;&#x65E0;&#x9650;&#x671F;&#x7684;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF1A;</p>
<ul>
<li>&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;Timeout&#x53C2;&#x6570;&#x7684;Object.wait()&#x65B9;&#x6CD5;</li>
<li>&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;Timeout&#x53C2;&#x6570;&#x7684;Thread.join()&#x65B9;&#x6CD5;</li>
<li>LockSupport.park()&#x65B9;&#x6CD5;</li>
</ul>
<p>&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x4F1A;&#x8BA9;&#x7EBF;&#x7A0B;&#x8FDB;&#x5165;&#x9650;&#x671F;&#x7B49;&#x5F85;&#x72B6;&#x4F53;&#xFF1A;</p>
<ul>
<li>Thread.sleep()</li>
<li>&#x8BBE;&#x7F6E;&#x4E86;Timeout&#x53C2;&#x6570;&#x7684;Object.wait()&#x65B9;&#x6CD5;</li>
<li>&#x8BBE;&#x7F6E;&#x4E86;Timeout&#x53C2;&#x6570;&#x7684;Thread.join()&#x65B9;&#x6CD5;</li>
<li>LockSupport.parkNanos()&#x65B9;&#x6CD5;</li>
<li>LockSupport.parkUntil()&#x65B9;&#x6CD5;</li>
</ul>
<p>#5&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>

  



      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 arthinking
  
</p>
</footer>
    
  </div>
</div>
</body>
</html>