<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Page 9 | arthinking | ChinSyun Pang&#39;s blog</title>
  <meta name="author" content="arthinking">
  
  <meta name="description" content="Struggle for HighPay zoom.">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  
  <meta property="og:site_name" content="arthinking"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="arthinking" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/">arthinking</a>
  </h1>
  <p class="site-description">ChinSyun Pang&#39;s blog</p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        
  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120301_JVM笔记 - 虚拟机执行子系统（虚拟机类加载机制）/"><span>JVM笔记 - 虚拟机执行子系统（虚拟机类加载机制）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120301_JVM笔记 - 虚拟机执行子系统（虚拟机类加载机制）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
<p>&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x7B2C;2&#x7248;&#xFF09;&#x300B;&#x7B14;&#x8BB0;</p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>&#x865A;&#x62DF;&#x673A;&#x628A;&#x63CF;&#x8FF0;&#x7C7B;&#x7684;&#x6570;&#x636E;&#x4ECE; Class &#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#x3001;&#x8F6C;&#x6362;&#x89E3;&#x6790;&#x548C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6700;&#x7EC8;&#x5F62;&#x6210;&#x53EF;&#x4EE5;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7684; Java &#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x865A;&#x62DF;&#x673A;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x3002;</p>
<p>Java &#x91CC;&#x5929;&#x751F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x6269;&#x5C55;&#x7684;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x5C31;&#x662F;&#x4F9D;&#x8D56;&#x8FD0;&#x884C;&#x671F;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x548C;&#x52A8;&#x6001;&#x8FDE;&#x63A5;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>#2&#x3001;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x673A;<br>&#x52A0;&#x8F7D;&#xFF08; Loading&#xFF09;&#x3001; &#x9A8C;&#x8BC1;&#xFF08; Verification&#xFF09;&#x3001; &#x51C6;&#x5907;&#xFF08; Preparation&#xFF09;&#x3001; &#x89E3;&#x6790;&#xFF08; Resolution&#xFF09;&#x3001; &#x521D;&#x59CB;&#x5316;&#xFF08; Initialization&#xFF09;&#x3001; &#x4F7F;&#x7528;&#xFF08; Using&#xFF09; &#x548C;&#x5378;&#x8F7D;&#xFF08; Unloading&#xFF09; 7 &#x4E2A;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x3001;&#x89E3;&#x6790; 3 &#x4E2A;&#x90E8;&#x5206;&#x7EDF;&#x79F0;&#x4E3A;&#x8FDE;&#x63A5;&#xFF08; Linking&#xFF09;&#x3002;</p>
<p>&#x52A0;&#x8F7D;&#x3001;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x3001;&#x521D;&#x59CB;&#x5316;&#x548C;&#x5378;&#x8F7D;&#x8FD9; 5 &#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x5FC5;&#x987B;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x987A;&#x5E8F;&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x5730;&#x5F00;&#x59CB;&#xFF0C;&#x800C;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#xFF1A;&#x5B83;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x4E4B;&#x540E;&#x518D;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x652F;&#x6301; Java &#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7ED1;&#x5B9A;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x6216;&#x665A;&#x671F;&#x7ED1;&#x5B9A;&#xFF09;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x5219;&#x662F;&#x4E25;&#x683C;&#x89C4;&#x5B9A;&#x4E86;&#x6709;&#x4E14;&#x53EA;&#x6709; 5 &#x79CD;&#x60C5;&#x51B5;&#x5FC5;&#x987B;&#x7ACB;&#x5373;&#x5BF9;&#x7C7B;&#x8FDB;&#x884C;&#x201C;&#x521D;&#x59CB;&#x5316;&#x201D;&#xFF08;&#x800C;&#x52A0;&#x8F7D;&#x3001;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x81EA;&#x7136;&#x9700;&#x8981;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x5F00;&#x59CB;&#xFF09;&#xFF1A; </p>
<blockquote>
<p>1&#xFF09; &#x9047;&#x5230; new&#x3001; getstatic&#x3001; putstatic &#x6216; invokestatic &#x8FD9; 4 &#x6761;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8FC7;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5148;&#x89E6;&#x53D1;&#x5176;&#x521D;&#x59CB;&#x5316;&#x3002; </p>
<p>2&#xFF09; &#x4F7F;&#x7528; java. lang. reflect &#x5305;&#x7684;&#x65B9;&#x6CD5;&#x5BF9;&#x7C7B;&#x8FDB;&#x884C;&#x53CD;&#x5C04;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8FC7;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5148;&#x89E6;&#x53D1;&#x5176;&#x521D;&#x59CB;&#x5316;&#x3002;    </p>
<p>3&#xFF09; &#x5F53;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x5176;&#x7236;&#x7C7B;&#x8FD8;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8FC7;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5148;&#x89E6;&#x53D1;&#x5176;&#x7236;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3002;    </p>
<p>4&#xFF09; &#x5F53;&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x8981;&#x6267;&#x884C;&#x7684;&#x4E3B;&#x7C7B;&#xFF08;&#x5305;&#x542B; main() &#x65B9;&#x6CD5;&#x7684;&#x90A3;&#x4E2A;&#x7C7B;&#xFF09;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x5148;&#x521D;&#x59CB;&#x5316;&#x8FD9;&#x4E2A;&#x4E3B;&#x7C7B;&#x3002;    </p>
<p>5&#xFF09; &#x5F53;&#x4F7F;&#x7528; JDK   1. 7 &#x7684;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A; java. lang. invoke. MethodHandle &#x5B9E;&#x4F8B;&#x6700;&#x540E;&#x7684;&#x89E3;&#x6790;&#x7ED3;&#x679C; REF<em> getStatic&#x3001; REF</em> putStatic&#x3001; REF_ invokeStatic &#x7684;&#x65B9;&#x6CD5;&#x53E5;&#x67C4;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53E5;&#x67C4;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x8FC7;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5148;&#x89E6;&#x53D1;&#x5176;&#x521D;&#x59CB;&#x5316;&#x3002;    </p>
</blockquote>
<p>&#x901A;&#x8FC7; &#x5B50;&#x7C7B;&#x5F15;&#x7528;&#x7236;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x5B57;&#x6BB5;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x5B50;&#x7C7B;&#x521D;&#x59CB;&#x5316;&#x3002;&#x662F;&#x5426;&#x8981;&#x89E6;&#x53D1;&#x5B50;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x548C;&#x9A8C;&#x8BC1;&#xFF0C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x5E76;&#x672A;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#xFF0C;&#x8FD9;&#x70B9;&#x53D6;&#x51B3;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x901A;&#x8FC7; &#x6570;&#x7EC4;&#x5B9A;&#x4E49;&#x6765;&#x5F15;&#x7528;&#x7C7B;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x6B64;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p>#3&#x3001;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x8FC7;&#x7A0B;</p>
<p>##3.1&#x3001;&#x52A0;&#x8F7D;<br>&#x5728;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4EE5;&#x4E0B; 3 &#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;<br>&gt;<br>1&#xFF09; &#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5168;&#x9650;&#x5B9A;&#x540D;&#x6765;&#x83B7;&#x53D6;&#x5B9A;&#x4E49;&#x6B64;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x3002;<br>&gt;<br>2&#xFF09; &#x5C06;&#x8FD9;&#x4E2A;&#x5B57;&#x8282;&#x6D41;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x9759;&#x6001;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x8F6C;&#x5316;&#x4E3A;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;<br>&gt;<br>3&#xFF09; &#x5728;&#x5185;&#x5B58;&#x4E2D;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684; java. lang. Class &#x5BF9;&#x8C61;&#xFF0C;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x533A;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x5404;&#x79CD;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x5165;&#x53E3;&#x3002;</p>
<p>Class&#x6587;&#x4EF6;&#x7684;&#x83B7;&#x53D6;&#x65B9;&#x5F0F;&#xFF1A;<br>&gt;<br>&#x4ECE; ZIP &#x5305;&#x4E2D;&#x8BFB;&#x53D6;&#xFF0C;&#x8FD9;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x6700;&#x7EC8;&#x6210;&#x4E3A;&#x65E5;&#x540E; JAR&#x3001; EAR&#x3001; WAR &#x683C;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x3002;<br>&gt;<br>&#x4ECE;&#x7F51;&#x7EDC;&#x4E2D;&#x83B7;&#x53D6;&#xFF0C;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x6700;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#x5C31;&#x662F; Applet&#x3002;<br>&gt;<br>&#x8FD0;&#x884C;&#x65F6;&#x8BA1;&#x7B97;&#x751F;&#x6210;&#xFF0C;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4F7F;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x5C31;&#x662F;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x5728; java. lang. reflect. Proxy &#x4E2D;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x4E86; ProxyGenerator. </p>
<blockquote>
<p>generateProxyClass &#x6765;&#x4E3A;&#x7279;&#x5B9A;&#x63A5;&#x53E3;&#x751F;&#x6210;&#x5F62;&#x5F0F;&#x4E3A;&#x201D;*$ Proxy&#x201D; &#x7684;&#x4EE3;&#x7406;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x3002;<br>&#x7531;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x751F;&#x6210;&#xFF0C;&#x5178;&#x578B;&#x573A;&#x666F;&#x662F; JSP &#x5E94;&#x7528;&#xFF0C;&#x5373;&#x7531; JSP &#x6587;&#x4EF6;&#x751F;&#x6210;&#x5BF9;&#x5E94;&#x7684; Class &#x7C7B;&#x3002;</p>
<p>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x975E;&#x6570;&#x7EC4;&#x7C7B;&#x7684;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#xFF08;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x662F;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x4E2D;&#x83B7;&#x53D6;&#x7C7B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x7684;&#x52A8;&#x4F5C;&#xFF09;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x63A7;&#x6027;&#x6700;&#x5F3A;&#x7684;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x7C7B;&#x800C;&#x8A00;&#xFF0C;&#x60C5;&#x51B5;&#x5C31;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x6570;&#x7EC4;&#x7C7B;&#x672C;&#x8EAB;&#x4E0D;&#x901A;&#x8FC7;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x521B;&#x5EFA;&#xFF0C;&#x5B83;&#x662F;&#x7531; Java &#x865A;&#x62DF;&#x673A;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x4F46;&#x6570;&#x7EC4;&#x7C7B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4ECD;&#x7136;&#x6709;&#x5F88;&#x5BC6;&#x5207;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x7C7B;&#x7684;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#xFF08; Element   Type&#xFF0C; &#x6307;&#x7684;&#x662F;&#x6570;&#x7EC4;&#x53BB;&#x6389;&#x6240;&#x6709;&#x7EF4;&#x5EA6;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#x6700;&#x7EC8;&#x662F;&#x8981;&#x9760;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x521B;&#x5EFA;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7C7B;&#xFF08;&#x4E0B;&#x9762;&#x7B80;&#x79F0;&#x4E3A; C&#xFF09; &#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x5C31;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x89C4;&#x5219;&#xFF1A;</p>
<p>&#x5982;&#x679C;&#x6570;&#x7EC4;&#x7684;&#x7EC4;&#x4EF6;&#x7C7B;&#x578B;&#xFF08; Component   Type&#xFF0C; &#x6307;&#x7684;&#x662F;&#x6570;&#x7EC4;&#x53BB;&#x6389;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x5C31;&#x9012;&#x5F52;&#x91C7;&#x7528;&#x672C;&#x8282;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x53BB;&#x52A0;&#x8F7D;&#x8FD9;&#x4E2A;&#x7EC4;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;&#x6570;&#x7EC4; C &#x5C06;&#x5728;&#x52A0;&#x8F7D;&#x8BE5;&#x7EC4;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x7C7B;&#x540D;&#x79F0;&#x7A7A;&#x95F4;&#x4E0A;&#x88AB;&#x6807;&#x8BC6;&#xFF08;&#x8FD9;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x5728; 7. 4 &#x8282;&#x4F1A;&#x4ECB;&#x7ECD;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x5FC5;&#x987B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E00;&#x8D77;&#x786E;&#x5B9A;&#x552F;&#x4E00;&#x6027;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6570;&#x7EC4;&#x7684;&#x7EC4;&#x4EF6;&#x7C7B;&#x578B;&#x4E0D;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982; int[] &#x6570;&#x7EC4;&#xFF09;&#xFF0C; Java &#x865A;&#x62DF;&#x673A;&#x5C06;&#x4F1A;&#x628A;&#x6570;&#x7EC4; C &#x6807;&#x8BB0;&#x4E3A;&#x4E0E;&#x5F15;&#x5BFC;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5173;&#x8054;&#x3002;</p>
<p>&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x5916;&#x90E8;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x8282;&#x6D41;&#x5C31;&#x6309;&#x7167;&#x865A;&#x62DF;&#x673A;&#x6240;&#x9700;&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x65B9;&#x6CD5;&#x533A;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>Class&#x7C7B;&#x5BF9;&#x8C61;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x662F;&#x5728; Java &#x5806;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E; HotSpot &#x865A;&#x62DF;&#x673A;&#x800C;&#x8A00;&#xFF0C; Class &#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x5B83;&#x867D;&#x7136;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x653E;&#x5728;&#x65B9;&#x6CD5;&#x533A;&#x91CC;&#x9762;&#x3002;</p>
<p>##3.2&#x3001;&#x9A8C;&#x8BC1;<br>&#x9A8C;&#x8BC1;&#x662F;&#x8FDE;&#x63A5;&#x9636;&#x6BB5;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x786E;&#x4FDD; Class &#x6587;&#x4EF6;&#x7684;&#x5B57;&#x8282;&#x6D41;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x7B26;&#x5408;&#x5F53;&#x524D;&#x865A;&#x62DF;&#x673A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x5371;&#x5BB3;&#x865A;&#x62DF;&#x673A;&#x81EA;&#x8EAB;&#x7684;&#x5B89;&#x5168;&#x3002;</p>
<p>&#x5728;&#x5B57;&#x8282;&#x7801;&#x8BED;&#x8A00;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x4E0A;&#x8FF0; Java &#x4EE3;&#x7801;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x8BED;&#x4E49;&#x4E0A;&#x662F;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x7684;&#x3002;&#x865A;&#x62DF;&#x673A;&#x5982;&#x679C;&#x4E0D;&#x68C0;&#x67E5;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x8282;&#x6D41;&#xFF0C;&#x5BF9;&#x5176;&#x5B8C;&#x5168;&#x4FE1;&#x4EFB;&#x7684;&#x8BDD;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x8F7D;&#x5165;&#x4E86;&#x6709;&#x5BB3;&#x7684;&#x5B57;&#x8282;&#x6D41;&#x800C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#xFF0C;&#x6240;&#x4EE5;&#x9A8C;&#x8BC1;&#x662F;&#x865A;&#x62DF;&#x673A;&#x5BF9;&#x81EA;&#x8EAB;&#x4FDD;&#x62A4;&#x7684;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x9A8C;&#x8BC1;&#x9636;&#x6BB5;&#x5927;&#x81F4;&#x4E0A;&#x4F1A;&#x5B8C;&#x6210;&#x4E0B;&#x9762; 4 &#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x68C0;&#x9A8C;&#x52A8;&#x4F5C;&#xFF1A;</p>
<p>###&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x9A8C;&#x8BC1;&#xFF1A;<br>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x8981;&#x9A8C;&#x8BC1;&#x5B57;&#x8282;&#x6D41;&#x662F;&#x5426;&#x7B26;&#x5408; Class &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x89C4;&#x8303;&#x3002;</p>
<p>###&#x5143;&#x6570;&#x636E;&#x9A8C;&#x8BC1;&#xFF1A;<br>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#x662F;&#x5BF9;&#x5B57;&#x8282;&#x7801;&#x63CF;&#x8FF0;&#x7684;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x8BED;&#x4E49;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x5176;&#x63CF;&#x8FF0;&#x7684;&#x4FE1;&#x606F;&#x7B26;&#x5408; Java &#x8BED;&#x8A00;&#x89C4;&#x8303;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>###&#x5B57;&#x8282;&#x7801;&#x9A8C;&#x8BC1;&#xFF1A;<br>&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x6D41;&#x548C;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;&#xFF0C;&#x786E;&#x5B9A;&#x7A0B;&#x5E8F;&#x8BED;&#x4E49;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x3001;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#x3002;<br>&#x7531;&#x4E8E;&#x6570;&#x636E;&#x6D41;&#x9A8C;&#x8BC1;&#x7684;&#x9AD8;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FC7;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x6D88;&#x8017;&#x5728;&#x5B57;&#x8282;&#x7801;&#x9A8C;&#x8BC1;&#x9636;&#x6BB5;&#xFF0C;&#x5728; JDK 1. 6 &#x4E4B;&#x540E;&#x7684; Javac &#x7F16;&#x8BD1;&#x5668;&#x548C; Java &#x865A;&#x62DF;&#x673A;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x9879;&#x4F18;&#x5316;&#xFF0C;&#x7ED9;&#x65B9;&#x6CD5;&#x4F53;&#x7684; Code &#x5C5E;&#x6027;&#x7684;&#x5C5E;&#x6027;&#x8868;&#x4E2D;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x9879;&#x540D;&#x4E3A;&#x201D; StackMapTable&#x201D; &#x7684;&#x5C5E;&#x6027;</p>
<p>###&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x9A8C;&#x8BC1;&#xFF1A;<br>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x6821;&#x9A8C;&#x53D1;&#x751F;&#x5728;&#x865A;&#x62DF;&#x673A;&#x5C06;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x8F6C;&#x5316;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F6C;&#x5316;&#x52A8;&#x4F5C;&#x5C06;&#x5728;&#x8FDE;&#x63A5;&#x7684;&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#x2014;&#x2014;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x4E2D;&#x53D1;&#x751F;&#x3002;<br>&#x5982;&#x679C;&#x6240;&#x8FD0;&#x884C;&#x7684;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#xFF08;&#x5305;&#x62EC;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x53CA;&#x7B2C;&#x4E09;&#x65B9;&#x5305;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#x548C;&#x9A8C;&#x8BC1;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x5B9E;&#x65BD;&#x9636;&#x6BB5;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;- Xverify: none &#x53C2;&#x6570;&#x6765;&#x5173;&#x95ED;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7C7B;&#x9A8C;&#x8BC1;&#x63AA;&#x65BD;&#xFF0C;&#x4EE5;&#x7F29;&#x77ED;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>##3.3&#x3001;&#x51C6;&#x5907;<br>&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x4EC5;&#x5305;&#x62EC;&#x7C7B;&#x53D8;&#x91CF;&#xFF08;&#x88AB; static &#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x5305;&#x62EC;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5C06;&#x4F1A;&#x5728;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x5316;&#x65F6;&#x968F;&#x7740;&#x5BF9;&#x8C61;&#x4E00;&#x8D77;&#x5206;&#x914D;&#x5728; Java &#x5806;&#x4E2D;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x521D;&#x59CB;&#x503C;&#x201C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x201D;&#x4E0B;&#x662F;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x96F6;&#x503C;&#x3002;<br><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span>&#xA0;<span class="keyword">static</span>&#xA0;<span class="keyword">int</span>&#xA0;value= <span class="number">123</span>;</span><br></pre></td></tr></table></figure></p>
<p>&#x628A; value &#x8D4B;&#x503C;&#x4E3A; 123 &#x7684;&#x52A8;&#x4F5C;&#x5C06;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x3002;</p>
<p>&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF1A;&#x5982;&#x679C;&#x7C7B;&#x5B57;&#x6BB5;&#x7684;&#x5B57;&#x6BB5;&#x5C5E;&#x6027;&#x8868;&#x4E2D;&#x5B58;&#x5728; ConstantValue &#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x5728;&#x51C6;&#x5907;&#x9636;&#x6BB5;&#x53D8;&#x91CF; value &#x5C31;&#x4F1A;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E3A; ConstantValue &#x5C5E;&#x6027;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x503C;&#xFF0C;&#x5047;&#x8BBE;&#x4E0A;&#x9762;&#x7C7B;&#x53D8;&#x91CF; value &#x7684;&#x5B9A;&#x4E49;&#x53D8;&#x4E3A;&#xFF1A;<br><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">public</span>&#xA0;<span class="keyword">static</span>&#xA0;<span class="keyword">final</span>&#xA0;<span class="keyword">int</span>&#xA0;value= <span class="number">123</span>&#xFF1B;</span><br></pre></td></tr></table></figure></p>
<p>&#x7F16;&#x8BD1;&#x65F6; Javac &#x5C06;&#x4F1A;&#x4E3A; value &#x751F;&#x6210; ConstantValue &#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x51C6;&#x5907;&#x9636;&#x6BB5;&#x865A;&#x62DF;&#x673A;&#x5C31;&#x4F1A;&#x6839;&#x636E; ConstantValue &#x7684;&#x8BBE;&#x7F6E;&#x5C06; value &#x8D4B;&#x503C;&#x4E3A; 123&#x3002;</p>
<p>##3.4&#x3001;&#x89E3;&#x6790;<br>&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x662F;&#x865A;&#x62DF;&#x673A;&#x5C06;&#x5E38;&#x91CF;&#x6C60;&#x5185;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x66FF;&#x6362;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x9664; invokedynamic &#x6307;&#x4EE4;&#x4EE5;&#x5916;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x5BF9;&#x7B2C;&#x4E00;&#x6B21;&#x89E3;&#x6790;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x89E3;&#x6790;&#x52A8;&#x4F5C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x3001;&#x5B57;&#x6BB5;&#x3001;&#x7C7B;&#x65B9;&#x6CD5;&#x3001;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x3001;&#x65B9;&#x6CD5;&#x7C7B;&#x578B;&#x3001;&#x65B9;&#x6CD5;&#x53E5;&#x67C4;&#x548C;&#x8C03;&#x7528;&#x70B9;&#x9650;&#x5B9A;&#x7B26; 7 &#x7C7B;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x8FDB;&#x884C;&#x3002;</p>
<p>##3.5&#x3001;&#x521D;&#x59CB;&#x5316;<br>&#x5728;&#x51C6;&#x5907;&#x9636;&#x6BB5;&#xFF0C;&#x53D8;&#x91CF;&#x5DF2;&#x7ECF;&#x8D4B;&#x8FC7;&#x4E00;&#x6B21;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x800C;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#xFF0C;&#x5219;&#x6839;&#x636E;&#x7A0B;&#x5E8F;&#x5458;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x5236;&#x5B9A;&#x7684;&#x4E3B;&#x89C2;&#x8BA1;&#x5212;&#x53BB;&#x521D;&#x59CB;&#x5316;&#x7C7B;&#x53D8;&#x91CF;&#x548C;&#x5176;&#x4ED6;&#x8D44;&#x6E90;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x4ECE;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8868;&#x8FBE;&#xFF1A;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x662F;&#x6267;&#x884C;&#x7C7B;&#x6784;&#x9020;&#x5668;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E2D;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x5B9A;&#x4E49;&#x5728;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x4E4B;&#x524D;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B9A;&#x4E49;&#x5728;&#x5B83;&#x4E4B;&#x540E;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x524D;&#x9762;&#x7684;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x53EF;&#x4EE5;&#x8D4B;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x4FDD;&#x8BC1;&#x5728;&#x5B50;&#x7C7B;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x4E4B;&#x524D;&#xFF0C;&#x7236;&#x7C7B;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x88AB;&#x6267;&#x884C;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x7684;&#x7C7B;&#x80AF;&#x5B9A;&#x662F; java. lang. Object&#x3002;</p>
<p>&#x7236;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#x8981;&#x4F18;&#x5148;&#x4E8E;&#x5B50;&#x7C7B;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x63A5;&#x53E3;&#x4E2D;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x6709;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x63A5;&#x53E3;&#x4E0E;&#x7C7B;&#x4E00;&#x6837;&#x90FD;&#x4F1A;&#x751F;&#x6210;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x63A5;&#x53E3;&#x4E0E;&#x7C7B;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6267;&#x884C;&#x63A5;&#x53E3;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x5148;&#x6267;&#x884C;&#x7236;&#x63A5;&#x53E3;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x7236;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x7236;&#x63A5;&#x53E3;&#x624D;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x7C7B;&#x5728;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x4E5F;&#x4E00;&#x6837;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x63A5;&#x53E3;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#x88AB;&#x6B63;&#x786E;&#x5730;&#x52A0;&#x9501;&#x3001;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x4E2D;&#x6709;&#x8017;&#x65F6;&#x5F88;&#x957F;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x963B;&#x585E;</p>
<p>#4&#x3001;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x53BB;&#x83B7;&#x53D6;&#x6240;&#x9700;&#x8981;&#x7684;&#x7C7B;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x79F0;&#x4E3A;&#x201C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x201D;&#x3002;</p>
<p>&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5374;&#x5728;&#x7C7B;&#x5C42;&#x6B21;&#x5212;&#x5206;&#x3001; OSGi&#x3001; &#x70ED;&#x90E8;&#x7F72;&#x3001;&#x4EE3;&#x7801;&#x52A0;&#x5BC6;&#x7B49;&#x9886;&#x57DF;&#x5927;&#x653E;&#x5F02;&#x5F69;&#x3002;</p>
<p>##4.1&#x3001;&#x7C7B;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;<br>&#x5373;&#x4F7F;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x6765;&#x6E90;&#x4E8E;&#x540C;&#x4E00;&#x4E2A; Class &#x6587;&#x4EF6;&#xFF0C;&#x88AB;&#x540C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x8F7D;&#xFF0C;&#x53EA;&#x8981;&#x52A0;&#x8F7D;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x5C31;&#x5FC5;&#x5B9A;&#x4E0D;&#x76F8;&#x7B49;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5BF9; instanceof &#x5173;&#x952E;&#x5B57;&#x8FD0;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x5F71;&#x54CD;  link<br>&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5B58;&#x5728;&#x4E86;&#x4E24;&#x4E2A; ClassLoaderTest &#x7C7B;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7531;&#x7CFB;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x7684;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x662F;&#x7531;&#x6211;&#x4EEC;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x7684;</p>
<p>##4.2&#x3001;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;<br>&#x4ECE; Java &#x865A;&#x62DF;&#x673A;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#xFF0C;&#x53EA;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF1A;&#x4E00;&#x79CD;&#x662F;<code>&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</code>&#xFF08; Bootstrap ClassLoader&#xFF09;&#xFF0C; &#x8FD9;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4F7F;&#x7528; C++ &#x8BED;&#x8A00;&#x5B9E;&#x73B0;[ 1]&#xFF0C; &#x662F;&#x865A;&#x62DF;&#x673A;&#x81EA;&#x8EAB;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x5C31;&#x662F;<code>&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</code>&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x90FD;&#x7531; Java &#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x72EC;&#x7ACB;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x5916;&#x90E8;&#xFF0C;&#x5E76;&#x4E14;&#x5168;&#x90FD;&#x7EE7;&#x627F;&#x81EA;&#x62BD;&#x8C61;&#x7C7B; java. lang. ClassLoader&#x3002;</p>
<p>&#x7EDD;&#x5927;&#x90E8;&#x5206; Java &#x7A0B;&#x5E8F;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x4EE5;&#x4E0B; 3 &#x79CD;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF1A;</p>
<p>####&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08; Bootstrap   ClassLoader&#xFF09;&#xFF1A;<br>&#x8FD9;&#x4E2A;&#x7C7B;&#x5C06;&#x5668;&#x8D1F;&#x8D23;&#x5C06;&#x5B58;&#x653E;&#x5728;&#xFF1C; JAVA_ HOME &#xFF1E;\ lib &#x76EE;&#x5F55;&#x4E2D;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x88AB;- Xbootclasspath &#x53C2;&#x6570;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x865A;&#x62DF;&#x673A;&#x8BC6;&#x522B;&#x7684;&#xFF08;&#x4EC5;&#x6309;&#x7167;&#x6587;&#x4EF6;&#x540D;&#x8BC6;&#x522B;&#xFF0C;&#x5982; rt. jar&#xFF0C; &#x540D;&#x5B57;&#x4E0D;&#x7B26;&#x5408;&#x7684;&#x7C7B;&#x5E93;&#x5373;&#x4F7F;&#x653E;&#x5728; lib &#x76EE;&#x5F55;&#x4E2D;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#xFF09;&#x7C7B;&#x5E93;&#x52A0;&#x8F7D;&#x5230;&#x865A;&#x62DF;&#x673A;&#x5185;&#x5B58;&#x4E2D;&#x3002;<br>&#x7528;&#x6237;&#x5728;&#x7F16;&#x5199;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x628A;&#x52A0;&#x8F7D;&#x8BF7;&#x6C42;&#x59D4;&#x6D3E;&#x7ED9;&#x5F15;&#x5BFC;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x90A3;&#x76F4;&#x63A5;&#x4F7F;&#x7528; null &#x4EE3;&#x66FF;&#x5373;&#x53EF;&#x3002;</p>
<p>####&#x6269;&#x5C55;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08; Extension   ClassLoader&#xFF09;&#xFF1A;<br>&#x5B83;&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;&#xFF1C; JAVA_ HOME &#xFF1E;\ lib\ ext &#x76EE;&#x5F55;&#x4E2D;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x88AB; java. ext. dirs &#x7CFB;&#x7EDF;&#x53D8;&#x91CF;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7C7B;&#x5E93;&#x3002;    </p>
<p>####&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08; Application   ClassLoader&#xFF09;&#xFF1A;<br>&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F; ClassLoader &#x4E2D;&#x7684; getSystemClassLoader() &#x65B9;&#x6CD5;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x4E5F;&#x79F0;&#x5B83;&#x4E3A;&#x7CFB;&#x7EDF;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;&#x5B83;&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;&#x7528;&#x6237;&#x7C7B;&#x8DEF;&#x5F84;&#xFF08; ClassPath&#xFF09; &#x4E0A;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x7C7B;&#x5E93;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CA1;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;</p>
<p>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x8981;&#x6C42;&#x9664;&#x4E86;&#x9876;&#x5C42;&#x7684;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5916;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x90FD;&#x5E94;&#x5F53;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x3002;&#x8FD9;&#x91CC;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7236;&#x5B50;&#x5173;&#x7CFB;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x4EE5;&#x7EE7;&#x627F;&#xFF08; Inheritance&#xFF09; &#x7684;&#x5173;&#x7CFB;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x662F;&#x90FD;&#x4F7F;&#x7528;&#x7EC4;&#x5408;&#xFF08; Composition&#xFF09; &#x5173;&#x7CFB;&#x6765;&#x590D;&#x7528;&#x7236;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x6536;&#x5230;&#x4E86;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x53BB;&#x5C1D;&#x8BD5;&#x52A0;&#x8F7D;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x59D4;&#x6D3E;&#x7ED9;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x53BB;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x7C7B; java. lang. Object&#xFF0C; &#x5B83;&#x5B58;&#x653E;&#x5728; rt. jar &#x4E4B;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x54EA;&#x4E00;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8981;&#x52A0;&#x8F7D;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x59D4;&#x6D3E;&#x7ED9;&#x5904;&#x4E8E;&#x6A21;&#x578B;&#x6700;&#x9876;&#x7AEF;&#x7684;&#x542F;&#x52A8;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x56E0;&#x6B64; Object &#x7C7B;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x79CD;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x73AF;&#x5883;&#x4E2D;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;<br>&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53BB;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x4E0E; rt. jar &#x7C7B;&#x5E93;&#x4E2D;&#x5DF2;&#x6709;&#x7C7B;&#x91CD;&#x540D;&#x7684; Java &#x7C7B;&#xFF0C;&#x5C06;&#x4F1A;&#x53D1;&#x73B0;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x7F16;&#x8BD1;&#xFF0C;&#x4F46;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x88AB;&#x52A0;&#x8F7D;&#x8FD0;&#x884C;&#x3002;</p>
<p>##4.3&#x3001;&#x7834;&#x574F;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;<br>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x7684;<code>&#x7B2C;&#x4E00;&#x6B21;</code>&#x201C;&#x88AB;&#x7834;&#x574F;&#x201D;&#x5176;&#x5B9E;&#x53D1;&#x751F;&#x5728;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x51FA;&#x73B0;&#x4E4B;&#x524D;&#x2014;&#x2014;&#x5373; JDK 1.2 &#x53D1;&#x5E03;&#x4E4B;&#x524D;&#x3002;    </p>
<p>JDK 1.2 &#x4E4B;&#x540E;&#x5DF2;&#x4E0D;&#x63D0;&#x5021;&#x7528;&#x6237;&#x518D;&#x53BB;&#x8986;&#x76D6; loadClass() &#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x5E94;&#x5F53;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x903B;&#x8F91;&#x5199;&#x5230; findClass() &#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x5728; loadClass() &#x65B9;&#x6CD5;&#x7684;&#x903B;&#x8F91;&#x91CC;&#x5982;&#x679C;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x4F1A;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x7684; findClass() &#x65B9;&#x6CD5;&#x6765;&#x5B8C;&#x6210;&#x52A0;&#x8F7D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x65B0;&#x5199;&#x51FA;&#x6765;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x662F;&#x7B26;&#x5408;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x89C4;&#x5219;&#x7684;&#x3002;    </p>
<p>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x7684;<code>&#x7B2C;&#x4E8C;&#x6B21;</code>&#x201C;&#x88AB;&#x7834;&#x574F;&#x201D;&#x662F;&#x7531;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x81EA;&#x8EAB;&#x7684;&#x7F3A;&#x9677;&#x6240;&#x5BFC;&#x81F4;&#x7684;&#x3002;&#x5982;&#x679C;&#x57FA;&#x7840;&#x7C7B;&#x53C8;&#x8981;&#x8C03;&#x7528;&#x56DE;&#x7528;&#x6237;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;    </p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C; Java &#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x53EA;&#x597D;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x4F18;&#x96C5;&#x7684;&#x8BBE;&#x8BA1;&#xFF1A;<code>&#x7EBF;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;</code>&#xFF08; Thread Context   ClassLoader&#xFF09;&#x3002;</p>
<p>&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x7684;<code>&#x7B2C;&#x4E09;&#x6B21;</code>&#x201C;&#x88AB;&#x7834;&#x574F;&#x201D;&#x662F;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x5BF9;&#x7A0B;&#x5E8F;&#x52A8;&#x6001;&#x6027;&#x7684;&#x8FFD;&#x6C42;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x3002;<br>OSGi &#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#x70ED;&#x90E8;&#x7F72;&#x7684;&#x5173;&#x952E;&#x5219;&#x662F;&#x5B83;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x673A;&#x5236;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#xFF08; OSGi &#x4E2D;&#x79F0;&#x4E3A; Bundle&#xFF09; &#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x66F4;&#x6362;&#x4E00;&#x4E2A; Bundle &#x65F6;&#xFF0C;&#x5C31;&#x628A; Bundle &#x8FDE;&#x540C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E00;&#x8D77;&#x6362;&#x6389;&#x4EE5;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x7684;&#x70ED;&#x66FF;&#x6362;&#x3002;&#x5728; OSGi &#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E0D;&#x518D;&#x662F;&#x53CC;&#x4EB2;&#x59D4;&#x6D3E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x4E3A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x7F51;&#x72B6;&#x7ED3;&#x6784;&#x3002;    </p>
<p>&#x5728; Java &#x7A0B;&#x5E8F;&#x5458;&#x4E2D;&#x57FA;&#x672C;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x8BC6;&#xFF1A; OSGi &#x4E2D;&#x5BF9;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x4F7F;&#x7528;&#x662F;&#x5F88;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x5F04;&#x61C2;&#x4E86; OSGi &#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7B97;&#x662F;&#x638C;&#x63E1;&#x4E86;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x7CBE;&#x9AD3;&#x3002;</p>
<p>#5&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>
<blockquote>
<p>&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="http://www.itzhai.com/jvm-executive-subsystem-class-loading-mechanism.html" title="JVM&#x7B14;&#x8BB0; - &#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;" target="_blank" rel="external">JVM&#x7B14;&#x8BB0; - &#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;</a></p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120302_JVM笔记 - 虚拟机执行子系统（虚拟机字节码执行引擎）/"><span>JVM笔记 - 虚拟机执行子系统（虚拟机字节码执行引擎）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120302_JVM笔记 - 虚拟机执行子系统（虚拟机字节码执行引擎）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
<p>&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x7B2C;2&#x7248;&#xFF09;&#x300B;&#x7B14;&#x8BB0;</p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>&#x7269;&#x7406;&#x673A;&#x7684;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x662F;&#x76F4;&#x63A5;&#x5EFA;&#x7ACB;&#x5728;&#x5904;&#x7406;&#x5668;&#x3001;&#x786C;&#x4EF6;&#x3001;&#x6307;&#x4EE4;&#x96C6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C42;&#x9762;&#x4E0A;&#x7684;&#xFF0C;&#x800C;&#x865A;&#x62DF;&#x673A;&#x7684;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x5219;&#x662F;&#x7531;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x5236;&#x5B9A;&#x6307;&#x4EE4;&#x96C6;&#x4E0E;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x6267;&#x884C;&#x90A3;&#x4E9B;&#x4E0D;&#x88AB;&#x786C;&#x4EF6;&#x76F4;&#x63A5;&#x652F;&#x6301;&#x7684;&#x6307;&#x4EE4;&#x96C6;&#x683C;&#x5F0F;&#x3002;</p>
<p>#2&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x6808;&#x5E27;&#x7ED3;&#x6784;<br>&#x6808;&#x5E27;&#x5B58;&#x50A8;&#x4E86;&#x65B9;&#x6CD5;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x8FDE;&#x63A5;&#x548C;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4ECE;&#x8C03;&#x7528;&#x5F00;&#x59CB;&#x81F3;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x90FD;&#x5BF9;&#x5E94;&#x7740;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x5728;&#x865A;&#x62DF;&#x673A;&#x6808;&#x91CC;&#x9762;&#x4ECE;&#x5165;&#x6808;&#x5230;&#x51FA;&#x6808;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x90FD;&#x5305;&#x62EC;&#x4E86;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x8FDE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#x548C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x9644;&#x52A0;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x6D3B;&#x52A8;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4F4D;&#x4E8E;&#x6808;&#x9876;&#x7684;&#x6808;&#x5E27;&#x624D;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x79F0;&#x4E3A;&#x5F53;&#x524D;&#x6808;&#x5E27;&#x3002;</p>
<p>##2.1&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;<br>Java &#x8BED;&#x8A00;&#x4E2D;&#x660E;&#x786E;&#x7684;&#xFF08; reference &#x7C7B;&#x578B;&#x5219;&#x53EF;&#x80FD;&#x662F; 32 &#x4F4D;&#x4E5F;&#x53EF;&#x80FD;&#x662F; 64 &#x4F4D;&#xFF09; 64 &#x4F4D;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x53EA;&#x6709; long &#x548C; double &#x4E24;&#x79CD;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C3D;&#x53EF;&#x80FD;&#x8282;&#x7701;&#x6808;&#x5E27;&#x7A7A;&#x95F4;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x4E2D;&#x7684; Slot &#x662F;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x7684;&#xFF0C;&#x65B9;&#x6CD5;&#x4F53;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x57DF;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x8986;&#x76D6;&#x6574;&#x4E2A;&#x65B9;&#x6CD5;&#x4F53;&#x3002;</p>
<p>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x590D;&#x7528;&#x5BF9;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x5F71;&#x54CD; link<br>placeholder &#x539F;&#x672C;&#x6240;&#x5360;&#x7528;&#x7684; Slot &#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x6240;&#x590D;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x4F5C;&#x4E3A; GC Roots &#x4E00;&#x90E8;&#x5206;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x4ECD;&#x7136;&#x4FDD;&#x6301;&#x7740;&#x5BF9;&#x5B83;&#x7684;&#x5173;&#x8054;&#x3002;</p>
<p>&#x4E66;&#x7C4D;&#x300A; Practical Java&#x300B; &#x4E2D;&#x628A;&#x201C;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5E94;&#x624B;&#x52A8;&#x8D4B;&#x503C;&#x4E3A; null&#x201D; &#x4F5C;&#x4E3A;&#x4E00;&#x6761;&#x63A8;&#x8350;&#x7684;&#x7F16;&#x7801;&#x89C4;&#x5219;&#xFF0C;&#xFF0C;&#x8D4B; null &#x503C;&#x7684;&#x64CD;&#x4F5C;&#x5728;&#x7ECF;&#x8FC7; JIT &#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x540E;&#x5C31;&#x4F1A;&#x88AB;&#x6D88;&#x9664;&#x6389;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C06;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A; null &#x5C31;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x6E05;&#x5355; 8- 2 &#x5728;&#x7ECF;&#x8FC7; JIT &#x7F16;&#x8BD1;&#x540E;&#xFF0C; System.gc() &#x6267;&#x884C;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x5730;&#x56DE;&#x6536;&#x6389;&#x5185;&#x5B58;&#xFF0C;&#x65E0;&#x987B;&#x5199;&#x6210;&#x4EE3;&#x7801;&#x6E05;&#x5355; 8- 3 &#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E0D;&#x50CF;&#x524D;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x7C7B;&#x53D8;&#x91CF;&#x90A3;&#x6837;&#x5B58;&#x5728;&#x201C;&#x51C6;&#x5907;&#x9636;&#x6BB5;&#x201D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x4E86;&#x4F46;&#x6CA1;&#x6709;&#x8D4B;&#x521D;&#x59CB;&#x503C;&#x662F;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<p>##2.2&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;</p>
<p>##2.3&#x3001;&#x52A8;&#x6001;&#x8FDE;&#x63A5;<br>Class &#x6587;&#x4EF6;&#x7684;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x5B58;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x4E00;&#x90E8;&#x5206;&#x4F1A;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x6216;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8F6C;&#x5316;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6C;&#x5316;&#x79F0;&#x4E3A;<code>&#x9759;&#x6001;&#x89E3;&#x6790;</code>&#x3002;&#x53E6;&#x5916;&#x4E00;&#x90E8;&#x5206;&#x5C06;&#x5728;&#x6BCF;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x8F6C;&#x5316;&#x4E3A;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x79F0;&#x4E3A;<code>&#x52A8;&#x6001;&#x8FDE;&#x63A5;</code>&#x3002;</p>
<p>##2.4&#x3001;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x5730;&#x5740;<br>&#x65B9;&#x6CD5;&#x9000;&#x51FA;&#x65F6;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x6709;&#xFF1A;&#x6062;&#x590D;&#x4E0A;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x548C;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#xFF0C;&#x628A;&#x8FD4;&#x56DE;&#x503C;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x538B;&#x5165;&#x8C03;&#x7528;&#x8005;&#x6808;&#x5E27;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x4E2D;&#xFF0C;&#x8C03;&#x6574; PC &#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x4EE5;&#x6307;&#x5411;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x6307;&#x4EE4;&#x540E;&#x9762;&#x7684;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7B49;&#x3002;</p>
<p>##2.5&#x3001;&#x9644;&#x52A0;&#x4FE1;&#x606F;</p>
<p>#3&#x3001;&#x65B9;&#x6CD5;&#x8C03;&#x7528;</p>
<p>##3.1&#x3001;&#x89E3;&#x6790;<br>&#x8C03;&#x7528;&#x76EE;&#x6807;&#x5728;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x5199;&#x597D;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x65F6;&#x5C31;&#x5FC5;&#x987B;&#x786E;&#x5B9A;&#x4E0B;&#x6765;&#x3002;&#x8FD9;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x79F0;&#x4E3A;&#x89E3;&#x6790;&#xFF08; Resolution&#xFF09;&#x3002;</p>
<p>&#x5728; Java &#x8BED;&#x8A00;&#x4E2D;&#x7B26;&#x5408;&#x201C;&#x7F16;&#x8BD1;&#x671F;&#x53EF;&#x77E5;&#xFF0C;&#x8FD0;&#x884C;&#x671F;&#x4E0D;&#x53EF;&#x53D8;&#x201D;&#x8FD9;&#x4E2A;&#x8981;&#x6C42;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x548C;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x4E24;&#x5927;&#x7C7B;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x90FD;&#x9002;&#x5408;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;</p>
<p>&#x5728; Java &#x865A;&#x62DF;&#x673A;&#x91CC;&#x9762;&#x63D0;&#x4F9B;&#x4E86; 5 &#x6761;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#xFF0C;&#x5206;&#x522B;&#x5982;&#x4E0B;&#x3002;<br>&gt;</p>
<blockquote>
<p>invokestatic&#xFF1A; &#x8C03;&#x7528;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x3002;</p>
<p>invokespecial&#xFF1A; &#x8C03;&#x7528;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;&#xFF1C; init &#xFF1E;&#x65B9;&#x6CD5;&#x3001;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x548C;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x3002;</p>
<p>invokevirtual&#xFF1A; &#x8C03;&#x7528;&#x6240;&#x6709;&#x7684;&#x865A;&#x65B9;&#x6CD5;&#x3002;</p>
<p>invokeinterface&#xFF1A; &#x8C03;&#x7528;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F1A;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x6B64;&#x63A5;&#x53E3;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x80FD;&#x88AB; invokestatic &#x548C; invokespecial &#x6307;&#x4EE4;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x4E2D;&#x786E;&#x5B9A;&#x552F;&#x4E00;&#x7684;&#x8C03;&#x7528;&#x7248;&#x672C;&#xFF0C;&#x7B26;&#x5408;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x6709;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x3001;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x3001;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;&#x3001;&#x7236;&#x7C7B;&#x65B9;&#x6CD5; 4 &#x7C7B;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x7C7B;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x628A;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x89E3;&#x6790;&#x4E3A;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x3002;    </p>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;<code>&#x975E;&#x865A;&#x65B9;&#x6CD5;</code>&#xFF0C;&#x4E0E;&#x4E4B;&#x76F8;&#x53CD;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;<code>&#x865A;&#x65B9;&#x6CD5;</code>&#xFF08;&#x9664;&#x53BB; final &#x65B9;&#x6CD5;&#xFF09;    </p>
<p>Java &#x4E2D;&#x7684;&#x975E;&#x865A;&#x65B9;&#x6CD5;&#x9664;&#x4E86;&#x4F7F;&#x7528; invokestatic&#x3001; invokespecial &#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#xFF0C;&#x5C31;&#x662F;&#x88AB; <code>final</code> &#x4FEE;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><code>&#x89E3;&#x6790;&#x8C03;&#x7528;</code>&#x4E00;&#x5B9A;&#x662F;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x5C31;&#x5B8C;&#x5168;&#x786E;&#x5B9A;&#xFF0C;&#x5728;&#x7C7B;&#x88C5;&#x8F7D;&#x7684;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x5C31;&#x4F1A;&#x628A;&#x6D89;&#x53CA;&#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x5168;&#x90E8;&#x8F6C;&#x53D8;&#x4E3A;&#x53EF;&#x786E;&#x5B9A;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x5EF6;&#x8FDF;&#x5230;&#x8FD0;&#x884C;&#x671F;&#x518D;&#x53BB;&#x5B8C;&#x6210;&#x3002;&#x800C;<code>&#x5206;&#x6D3E;&#xFF08; Dispatch&#xFF09; &#x8C03;&#x7528;</code>&#x5219;&#x53EF;&#x80FD;&#x662F;&#x9759;&#x6001;&#x7684;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x5206;&#x6D3E;&#x4F9D;&#x636E;&#x7684;&#x5B97;&#x91CF;&#x6570;[ 1] &#x53EF;&#x5206;&#x4E3A;&#x5355;&#x5206;&#x6D3E;&#x548C;&#x591A;&#x5206;&#x6D3E;&#x3002;</p>
<p>##3.2&#x3001;&#x5206;&#x6D3E;</p>
<p>###&#x9759;&#x6001;&#x5206;&#x6D3E;&#xFF1A;    </p>
<p>&#x4F8B;&#x5B50;&#xFF1A;link</p>
<p>&#x201C; Human&#x201D; &#x79F0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF08; Static   Type&#xFF09;&#xFF0C; &#x6216;&#x8005;&#x53EB;&#x505A;&#x7684;&#x5916;&#x89C2;&#x7C7B;&#x578B;&#xFF08; Apparent   Type&#xFF09;&#xFF0C; &#x540E;&#x9762;&#x7684;&#x201D; Man&#x201D; &#x5219;&#x79F0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#xFF08; Actual   Type&#xFF09;&#x3002;    </p>
<p>&#x865A;&#x62DF;&#x673A;&#xFF08;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#xFF09;&#x5728;&#x91CD;&#x8F7D;&#x65F6;&#x662F;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x5224;&#x5B9A;&#x4F9D;&#x636E;&#x7684;&#x3002;    </p>
<p>&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x6765;&#x5B9A;&#x4F4D;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7248;&#x672C;&#x7684;&#x5206;&#x6D3E;&#x52A8;&#x4F5C;&#x79F0;&#x4E3A;<code>&#x9759;&#x6001;&#x5206;&#x6D3E;</code>&#x3002;</p>
<p>&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#x5339;&#x914D;&#x4F18;&#x5148;&#x7EA7; link    </p>
<p>&#x5982;&#x679C;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x5206;&#x522B;&#x4E3A; Serializable &#x548C; Comparable &#xFF1C; Character &#xFF1E;&#x7684;&#x91CD;&#x8F7D;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5B83;&#x4EEC;&#x5728;&#x6B64;&#x65F6;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x8981;&#x81EA;&#x52A8;&#x8F6C;&#x578B;&#x4E3A;&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x4F1A;&#x63D0;&#x793A;&#x7C7B;&#x578B;&#x6A21;&#x7CCA;&#xFF0C;&#x62D2;&#x7EDD;&#x7F16;&#x8BD1;&#x3002;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x5728;&#x8C03;&#x7528;&#x65F6;&#x663E;&#x5F0F;&#x5730;&#x6307;&#x5B9A;&#x5B57;&#x9762;&#x91CF;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#xFF1A; sayHello&#xFF08;&#xFF08; Comparable &#xFF1C; Character &#xFF1E;&#xFF09;&#x2019; a&#x2019;&#xFF09;&#x3002;    </p>
<p>###&#x52A8;&#x6001;&#x5206;&#x6D3E;&#xFF1A;</p>
<p>&#x5B83;&#x548C;&#x591A;&#x6001;&#x6027;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4F53;&#x73B0;[ 3]&#x2014;&#x2014; <code>&#x91CD;&#x5199;</code>&#xFF08; Override&#xFF09; &#x6709;&#x7740;&#x5F88;&#x5BC6;&#x5207;&#x7684;&#x5173;&#x8054;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x52A8;&#x6001;&#x5206;&#x6D3E;&#x6F14;&#x793A; link    </p>
<p>Java &#x865A;&#x62DF;&#x673A;&#x662F;&#x5982;&#x4F55;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x6765;&#x5206;&#x6D3E;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7248;&#x672C;&#x7684;&#x5462;&#xFF1F;    </p>
<p>&#x539F;&#x56E0;&#x5C31;&#x9700;&#x8981;&#x4ECE; invokevirtual &#x6307;&#x4EE4;&#x7684;&#x591A;&#x6001;&#x67E5;&#x627E;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#x8BF4;&#x8D77;&#xFF0C;&#x7531;&#x4E8E; invokevirtual &#x6307;&#x4EE4;&#x6267;&#x884C;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x786E;&#x5B9A;&#x63A5;&#x6536;&#x8005;&#x7684;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x4E24;&#x6B21;&#x8C03;&#x7528;&#x4E2D;&#x7684; invokevirtual &#x6307;&#x4EE4;&#x628A;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x7684;&#x7C7B;&#x65B9;&#x6CD5;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#x89E3;&#x6790;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x662F; Java &#x8BED;&#x8A00;&#x4E2D;&#x65B9;&#x6CD5;&#x91CD;&#x5199;&#x7684;&#x672C;&#x8D28;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x786E;&#x5B9A;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7248;&#x672C;&#x7684;&#x5206;&#x6D3E;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;<code>&#x52A8;&#x6001;&#x5206;&#x6D3E;</code>&#x3002;</p>
<p>###&#x5355;&#x5206;&#x6D3E;&#x4E0E;&#x591A;&#x5206;&#x6D3E;&#xFF1A;</p>
<p>&#x5355;&#x5206;&#x6D3E;&#x4E0E;&#x591A;&#x5206;&#x6D3E; link    </p>
<p>Java &#x8BED;&#x8A00;&#x7684;<code>&#x9759;&#x6001;&#x5206;&#x6D3E;</code>&#x5C5E;&#x4E8E;<code>&#x591A;&#x5206;&#x6D3E;&#x7C7B;&#x578B;</code>&#x3002;    </p>
<p>Java &#x8BED;&#x8A00;&#x7684;<code>&#x52A8;&#x6001;&#x5206;&#x6D3E;</code>&#x5C5E;&#x4E8E;<code>&#x5355;&#x5206;&#x6D3E;&#x7C7B;&#x578B;</code>&#x3002;    </p>
<p>&#x4ECA;&#x5929;&#xFF08;&#x76F4;&#x81F3;&#x8FD8;&#x672A;&#x53D1;&#x5E03;&#x7684; Java   1. 8&#xFF09; &#x7684; Java &#x8BED;&#x8A00;&#x662F;&#x4E00;&#x95E8;&#x9759;&#x6001;&#x591A;&#x5206;&#x6D3E;&#x3001;&#x52A8;&#x6001;&#x5355;&#x5206;&#x6D3E;&#x7684;&#x8BED;&#x8A00;&#x3002;    </p>
<p>###&#x865A;&#x62DF;&#x673A;&#x52A8;&#x6001;&#x5206;&#x6D3E;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;</p>
<p>##3.3&#x3001;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x652F;&#x6301;<br>&#x968F;&#x7740; JDK   7 &#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x96C6;&#x7EC8;&#x4E8E;&#x8FCE;&#x6765;&#x4E86;&#x7B2C;&#x4E00;&#x4F4D;&#x65B0;&#x6210;&#x5458;&#x2014;&#x2014; <code>invokedynamic</code>&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x6761;&#x65B0;&#x589E;&#x52A0;&#x7684;&#x6307;&#x4EE4;&#x662F; JDK   7 &#x5B9E;&#x73B0;&#x201C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x201D;&#xFF08; Dynamically   Typed Language&#xFF09; &#x652F;&#x6301;&#x800C;&#x8FDB;&#x884C;&#x7684;&#x6539;&#x8FDB;&#x4E4B;&#x4E00;&#x3002;</p>
<p>###1. &#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;<br>&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x5173;&#x952E;&#x7279;&#x5F81;&#x662F;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x4E3B;&#x4F53;&#x8FC7;&#x7A0B;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x800C;&#x4E0D;&#x662F;&#x7F16;&#x8BD1;&#x671F;&#x3002;</p>
<p>&#x201C;&#x53D8;&#x91CF;&#x65E0;&#x7C7B;&#x578B;&#x800C;&#x53D8;&#x91CF;&#x503C;&#x624D;&#x6709;&#x7C7B;&#x578B;&#x201D;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x4E5F;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x3002;</p>
<p>###2. JDK   1. 7 &#x4E0E;&#x52A8;&#x6001;&#x7C7B;&#x578B;</p>
<p>###3. java. lang. invoke &#x5305;    </p>
<p>JDK   1. 7 &#x5B9E;&#x73B0;&#x4E86; JSR- 292&#xFF0C; &#x65B0;&#x52A0;&#x5165;&#x7684; java. lang. invoke &#x5305;[ 2] &#x5C31;&#x662F; JSR- 292 &#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;    </p>
<p>MethodHandle&#x6F14;&#x793A; link    </p>
<p>MethodHandle &#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x548C;&#x6548;&#x679C;&#x4E0E; Reflection &#x6709;&#x4F17;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD8;&#x662F;&#x6709;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x533A;&#x522B;&#xFF1A;    </p>
<blockquote>
<p>Reflection &#x662F;&#x5728;&#x6A21;&#x62DF; Java &#x4EE3;&#x7801;&#x5C42;&#x6B21;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF0C;&#x800C; MethodHandle &#x662F;&#x5728;&#x6A21;&#x62DF;&#x5B57;&#x8282;&#x7801;&#x5C42;&#x6B21;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3002;    </p>
<p>Reflection &#x662F;&#x91CD;&#x91CF;&#x7EA7;&#xFF0C;&#x800C; MethodHandle &#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;    </p>
<p>Reflection   API &#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x53EA;&#x4E3A; Java &#x8BED;&#x8A00;&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x800C; MethodHandle &#x5219;&#x8BBE;&#x8BA1;&#x6210;&#x53EF;&#x670D;&#x52A1;&#x4E8E;&#x6240;&#x6709; Java &#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x4E2D;&#x4E5F;&#x5305;&#x62EC; Java &#x8BED;&#x8A00;&#x3002;    </p>
</blockquote>
<p>###4. invokedynamic &#x6307;&#x4EE4;</p>
<p>&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C; invokedynamic &#x6307;&#x4EE4;&#x4E0E; MethodHandle &#x673A;&#x5236;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x539F;&#x6709; 4 &#x6761;&#x201D; invoke*&#x201D; &#x6307;&#x4EE4;&#x65B9;&#x6CD5;&#x5206;&#x6D3E;&#x89C4;&#x5219;&#x56FA;&#x5316;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x5982;&#x4F55;&#x67E5;&#x627E;&#x76EE;&#x6807;&#x65B9;&#x6CD5;&#x7684;&#x51B3;&#x5B9A;&#x6743;&#x4ECE;&#x865A;&#x62DF;&#x673A;&#x8F6C;&#x5AC1;&#x5230;&#x5177;&#x4F53;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>###5. &#x638C;&#x63A7;&#x65B9;&#x6CD5;&#x5206;&#x6D3E;&#x89C4;&#x5219;</p>
<p>invokedynamic &#x6307;&#x4EE4;&#x4E0E;&#x524D;&#x9762; 4 &#x6761;&#x201D; invoke*&#x201D; &#x6307;&#x4EE4;&#x7684;&#x6700;&#x5927;&#x5DEE;&#x522B;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5206;&#x6D3E;&#x903B;&#x8F91;&#x4E0D;&#x662F;&#x7531;&#x865A;&#x62DF;&#x673A;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x201D; super&#x201D; &#x5173;&#x952E;&#x5B57;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x8C03;&#x7528;&#x5230;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8981;&#x8BBF;&#x95EE;&#x7956;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x4F7F;&#x7528; MethodHandle &#x6765;&#x89E3;&#x51B3;&#x76F8;&#x5173;&#x95EE;&#x9898; link</p>
<p>#4&#x3001;&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x5B57;&#x8282;&#x7801;&#x89E3;&#x6790;&#x6267;&#x884C;&#x5F15;&#x64CE;</p>
<p>##4.1&#x3001;&#x89E3;&#x6790;&#x6267;&#x884C;<br>Java &#x8BED;&#x8A00;&#x4E2D;&#xFF0C; Javac &#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x6210;&#x4E86;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7ECF;&#x8FC7;&#x8BCD;&#x6CD5;&#x5206;&#x6790;&#x3001;&#x8BED;&#x6CD5;&#x5206;&#x6790;&#x5230;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#xFF0C;&#x518D;&#x904D;&#x5386;&#x8BED;&#x6CD5;&#x6811;&#x751F;&#x6210;&#x7EBF;&#x6027;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x6D41;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x52A8;&#x4F5C;&#x662F;&#x5728; Java &#x865A;&#x62DF;&#x673A;&#x4E4B;&#x5916;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x89E3;&#x91CA;&#x5668;&#x5728;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x6240;&#x4EE5; Java &#x7A0B;&#x5E8F;&#x7684;&#x7F16;&#x8BD1;&#x5C31;&#x662F;&#x534A;&#x72EC;&#x7ACB;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>##4.2&#x3001;&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x6307;&#x4EE4;&#x96C6;&#x4E0E;&#x57FA;&#x4E8E;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x6307;&#x4EE4;&#x96C6;<br>Java &#x7F16;&#x8BD1;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x6307;&#x4EE4;&#x6D41;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;[ 1] &#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x6307;&#x4EE4;&#x96C6;&#x67B6;&#x6784;&#x3002;    </p>
<p>&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x6307;&#x4EE4;&#x96C6;&#x4E3B;&#x8981;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#x53EF;&#x79FB;&#x690D;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x7531;&#x786C;&#x4EF6;&#x76F4;&#x63A5;&#x63D0;&#x4F9B;[ 2]&#xFF0C; &#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x4F9D;&#x8D56;&#x8FD9;&#x4E9B;&#x786C;&#x4EF6;&#x5BC4;&#x5B58;&#x5668;&#x5219;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x8981;&#x53D7;&#x5230;&#x786C;&#x4EF6;&#x7684;&#x7EA6;&#x675F;&#x3002;    </p>
<p>&#x6808;&#x67B6;&#x6784;&#x6307;&#x4EE4;&#x96C6;&#x7684;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x4F1A;&#x7A0D;&#x6162;&#x4E00;&#x4E9B;&#x3002;    </p>
<p>&#x867D;&#x7136;&#x6808;&#x67B6;&#x6784;&#x6307;&#x4EE4;&#x96C6;&#x7684;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7D27;&#x51D1;&#xFF0C;&#x4F46;&#x662F;&#x5B8C;&#x6210;&#x76F8;&#x540C;&#x529F;&#x80FD;&#x6240;&#x9700;&#x7684;&#x6307;&#x4EE4;&#x6570;&#x91CF;&#x4E00;&#x822C;&#x4F1A;&#x6BD4;&#x5BC4;&#x5B58;&#x5668;&#x67B6;&#x6784;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x51FA;&#x6808;&#x3001;&#x5165;&#x6808;&#x64CD;&#x4F5C;&#x672C;&#x8EAB;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x6307;&#x4EE4;&#x6570;&#x91CF;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6808;&#x5B9E;&#x73B0;&#x5728;&#x5185;&#x5B58;&#x4E4B;&#x4E2D;&#xFF0C;&#x9891;&#x7E41;&#x7684;&#x6808;&#x8BBF;&#x95EE;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x9891;&#x7E41;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x5185;&#x5B58;&#x59CB;&#x7EC8;&#x662F;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x7684;&#x74F6;&#x9888;&#x3002;&#x5C3D;&#x7BA1;&#x865A;&#x62DF;&#x673A;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x6808;&#x9876;&#x7F13;&#x5B58;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x628A;&#x6700;&#x5E38;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x6620;&#x5C04;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x907F;&#x514D;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x53EA;&#x80FD;&#x662F;&#x4F18;&#x5316;&#x63AA;&#x65BD;&#x800C;&#x4E0D;&#x662F;&#x89E3;&#x51B3;&#x672C;&#x8D28;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7531;&#x4E8E;&#x6307;&#x4EE4;&#x6570;&#x91CF;&#x548C;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6240;&#x4EE5;&#x5BFC;&#x81F4;&#x4E86;&#x6808;&#x67B6;&#x6784;&#x6307;&#x4EE4;&#x96C6;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x4F1A;&#x76F8;&#x5BF9;&#x8F83;&#x6162;&#x3002;</p>
<p>##4.3&#x3001;&#x57FA;&#x4E8E;&#x6808;&#x7684;&#x89E3;&#x6790;&#x6267;&#x884C;&#x8FC7;&#x7A0B;<br>&#x4E00;&#x6BB5;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x672F;&#x4EE3;&#x7801;&#x7684;&#x5B57;&#x8282;&#x7801;&#x8868;&#x793A;  link    </p>
<p>&#x5728; HotSpot &#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x4EE5;&#x201D; fast_&#x201D; &#x5F00;&#x5934;&#x7684;&#x975E;&#x6807;&#x51C6;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7528;&#x4E8E;&#x5408;&#x5E76;&#x3001;&#x66FF;&#x6362;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x8282;&#x7801;&#x4EE5;&#x63D0;&#x5347;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x6027;&#x80FD;&#xFF0C;&#x800C;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4F18;&#x5316;&#x624B;&#x6BB5;&#x66F4;&#x52A0;&#x82B1;&#x6837;&#x7E41;&#x591A;[ 1]&#x3002;    </p>
<blockquote>
<p>&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="http://www.itzhai.com/jvm-executive-subsystem-bytecode-interpreter.html" title="&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x5B57;&#x8282;&#x7801;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF09;" target="_blank" rel="external">&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x5B57;&#x8282;&#x7801;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF09;</a></p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120202_更新常量类导致的编译问题/"><span>更新常量类导致的编译问题</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120202_更新常量类导致的编译问题/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
<p>&#x7C7B;&#x4ECE;&#x88AB;&#x52A0;&#x8F7D;&#x5230;JVM&#x5185;&#x5B58;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x5378;&#x8F7D;&#x51FA;&#x5185;&#x5B58;&#xFF0C;&#x6574;&#x4E2A;&#x5468;&#x671F;&#x5305;&#x62EC;&#xFF1A;&#x52A0;&#x8F7D;&#x3001;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x3001;&#x89E3;&#x6790;&#x3001;&#x521D;&#x59CB;&#x5316;&#x3001;&#x4F7F;&#x7528;&#x548C;&#x5378;&#x8F7D;&#x3002;&#x800C;&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E25;&#x683C;&#x89C4;&#x5B9A;&#x4E86;&#x6709;&#x4E14;&#x53EA;&#x6709;&#x4E94;&#x79CD;&#x60C5;&#x51B5;&#x5FC5;&#x987B;&#x5BF9;&#x7C7B;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF08;link&#xFF09;&#xFF0C;&#x8FD9;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#x88AB;&#x79F0;&#x4E3A;&#x5BF9;&#x7C7B;&#x7684;&#x4E3B;&#x52A8;&#x5F15;&#x7528;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x60C5;&#x51B5;&#x88AB;&#x79F0;&#x4E3A;&#x88AB;&#x52A8;&#x5F15;&#x7528;&#xFF08;link&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x5C31;&#x5305;&#x62EC;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5E38;&#x91CF;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x5B9A;&#x4E49;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5E38;&#x91CF;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x6216;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF09;&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x4F1A;&#x5B58;&#x5165;&#x8C03;&#x7528;&#x7C7B;&#x7684;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x3002;</p>
</blockquote>
<p><strong>&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</strong><br>&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x7C7B;class&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x5F15;&#x7528;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#x7684;&#x5730;&#x65B9;&#x5E76;&#x6CA1;&#x6709;&#x505A;&#x51FA;&#x6539;&#x52A8;&#xFF0C;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x7684;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x5BF9;&#x5E38;&#x91CF;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8003;&#xFF1A;<br>&#x4E00;&#x822C;&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x4E8B;&#x60C5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x4E1C;&#x897F;&#x624D;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x5E38;&#x91CF;&#xFF0C;&#x5E38;&#x91CF;&#x53EF;&#x4EE5;&#x786C;&#x7F16;&#x7801;&#x5199;&#x5230;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x53EF;&#x80FD;&#x505A;&#x51FA;&#x8C03;&#x6574;&#x7684;&#x5E38;&#x91CF;&#x9700;&#x8981;&#x8003;&#x8651;&#xFF1A;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7F16;&#x8BD1;&#xFF0C;&#x4E0D;&#x7528;&#x5168;&#x5C40;&#x7F16;&#x8BD1;&#x4E00;&#x6B21;&#xFF0C;&#x54EA;&#x91CC;&#x7528;&#x5230;&#x7684;&#x5E38;&#x91CF;&#x5C31;&#x5B9A;&#x4E49;&#x5728;&#x54EA;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#x66FF;&#x6362;&#x3002;<br>&#x53C2;&#x8003;&#x4EE3;&#x7801;&#xFF1A;<br><a href="https://github.com/arthinking/java-code/blob/master/src/me/arthinking/code4jvmnote/C7_4_RoleEnum.java" title="&#x5E38;&#x91CF;&#x7F16;&#x8BD1;&#x5904;&#x7406;&#x65B9;&#x5F0F;" target="_blank" rel="external">&#x5E38;&#x91CF;&#x7F16;&#x8BD1;&#x5904;&#x7406;&#x65B9;&#x5F0F;</a><br>&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x6570;&#x7EC4;&#x5E38;&#x91CF;&#x4F1A;&#x4ECE;&#x6240;&#x5728;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x6574;&#x578B;&#x7684;&#x5E38;&#x91CF;&#x4F1A;&#x76F4;&#x63A5;&#x5728;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x4FDD;&#x5B58;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x4F1A;&#x9664;&#x975E;&#x5E38;&#x91CF;&#x6240;&#x5728;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<blockquote>
<p>&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="&#x66F4;&#x65B0;&#x5E38;&#x91CF;&#x7C7B;&#x5BFC;&#x81F4;&#x7684;&#x7F16;&#x8BD1;&#x95EE;&#x9898;" title="http://www.itzhai.com/the-compilation-problems-caused-by-constant.html">&#x66F4;&#x65B0;&#x5E38;&#x91CF;&#x7C7B;&#x5BFC;&#x81F4;&#x7684;&#x7F16;&#x8BD1;&#x95EE;&#x9898;</a></p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120201_JVM笔记 - 虚拟机执行子系统（类文件结构）/"><span>JVM笔记 - 虚拟机执行子系统（类文件结构）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120201_JVM笔记 - 虚拟机执行子系统（类文件结构）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
<p>&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x7B2C;2&#x7248;&#xFF09;&#x300B;&#x7B14;&#x8BB0;    </p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;</p>
<p>#2&#x3001;&#x65E0;&#x5173;&#x6027;&#x7684;&#x57FA;&#x77F3;<br>JVM &#x8BBE;&#x8BA1;&#x8005;&#x901A;&#x8FC7; JSR- 292 &#x57FA;&#x672C;&#x5151;&#x73B0;&#x4E86;&#x5BF9; Java &#x865A;&#x62DF;&#x673A;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x4E8E; JVM &#x4E4B;&#x4E0A;&#x8FD9;&#x4E2A;&#x627F;&#x8BFA;&#x3002;</p>
<p>Java &#x865A;&#x62DF;&#x673A;&#x4E0D;&#x548C;&#x5305;&#x62EC; Java &#x5728;&#x5185;&#x7684;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x7ED1;&#x5B9A;&#xFF0C;&#x5B83;&#x53EA;&#x4E0E;&#x201C; Class &#x6587;&#x4EF6;&#x201D;&#x8FD9;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x6240;&#x5173;&#x8054;</p>
<p>#3&#x3001;Class&#x7C7B;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x6784;<br>&#x4EFB;&#x4F55;&#x4E00;&#x4E2A; Class &#x6587;&#x4EF6;&#x90FD;&#x5BF9;&#x5E94;&#x7740;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x7684;&#x5B9A;&#x4E49;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x8BF4;&#xFF0C;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x90FD;&#x5F97;&#x5B9A;&#x4E49;&#x5728;&#x6587;&#x4EF6;&#x91CC;&#xFF08;&#x8B6C;&#x5982;&#x7C7B;&#x6216;&#x63A5;&#x53E3;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x76F4;&#x63A5;&#x751F;&#x6210;&#xFF09;&#x3002;</p>
<p>Class &#x6587;&#x4EF6;&#x662F;&#x4E00;&#x7EC4;&#x4EE5; 8 &#x4F4D;&#x5B57;&#x8282;&#x4E3A;&#x57FA;&#x7840;&#x5355;&#x4F4D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6D41;&#x3002;</p>
<p>&#x6839;&#x636E; Java &#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x7684;&#x89C4;&#x5B9A;&#xFF0C; Class &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x91C7;&#x7528;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x4E8E; C &#x8BED;&#x8A00;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x4F2A;&#x7ED3;&#x6784;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x4F2A;&#x7ED3;&#x6784;&#x4E2D;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x548C;&#x8868;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x89E3;&#x6790;&#x90FD;&#x8981;&#x4EE5;&#x8FD9;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E3A;&#x57FA;&#x7840;&#x3002;</p>
<p>#4&#x3001;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7B80;&#x4ECB;</p>
<p>#5&#x3001;&#x5171;&#x6709;&#x8BBE;&#x8BA1;&#x548C;&#x79C1;&#x6709;&#x8BBE;&#x8BA1;<br>&#x53EA;&#x8981;&#x4F18;&#x5316;&#x540E; Class &#x6587;&#x4EF6;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x88AB;&#x6B63;&#x786E;&#x8BFB;&#x53D6;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x542B;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x8BED;&#x4E49;&#x80FD;&#x5F97;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x4FDD;&#x6301;&#xFF0C;&#x90A3;&#x5B9E;&#x73B0;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x53BB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x8BED;&#x4E49;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x540E;&#x53F0;&#x5982;&#x4F55;&#x5904;&#x7406; Class &#x6587;&#x4EF6;&#x5B8C;&#x5168;&#x662F;&#x5B9E;&#x73B0;&#x8005;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x5728;&#x5916;&#x90E8;&#x63A5;&#x53E3;&#x4E0A;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x89C4;&#x8303;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x81F4;&#x5373;&#x53EF;[ 1]&#x3002;</p>
<p>#6&#x3001;Class&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x7684;&#x53D1;&#x5C55;<br>&#x76F8;&#x5BF9;&#x4E8E;&#x8BED;&#x8A00;&#x3001; API &#x4EE5;&#x53CA; Java &#x6280;&#x672F;&#x4F53;&#x7CFB;&#x4E2D;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x53D8;&#x5316;&#xFF0C; Class &#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#xFF0C; Class &#x6587;&#x4EF6;&#x7684;&#x4E3B;&#x4F53;&#x7ED3;&#x6784;&#x3001;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;&#x7684;&#x8BED;&#x4E49;&#x548C;&#x6570;&#x91CF;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x8FC7;&#x53D8;&#x52A8;[ 1]&#xFF0C; &#x6240;&#x6709;&#x5BF9; Class &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x5411;&#x8BBF;&#x95EE;&#x6807;&#x5FD7;&#x3001;&#x5C5E;&#x6027;&#x8868;&#x8FD9;&#x4E9B;&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x5C31;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x6DFB;&#x52A0;&#x5185;&#x5BB9;&#x3002;</p>
<p>#7&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>
<blockquote>
<p>&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="http://www.itzhai.com/jvm-executive-subsystem-class-structure.html" title="JVM&#x7B14;&#x8BB0; - &#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;" target="_blank" rel="external">JVM&#x7B14;&#x8BB0; - &#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;</a></p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/javascript/angularjs/chapter03_module/README/"><span>module</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/javascript/angularjs/chapter03_module/README/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
<p>AngularJS&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x4F7F;&#x7528;angular.module()&#x65B9;&#x6CD5;&#x6765;&#x58F0;&#x660E;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x6A21;&#x5757;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x4F9D;&#x8D56;&#x5217;&#x8868;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x6CE8;&#x5165;&#x5230;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5217;&#x8868;&#x3002;</p>
</blockquote>
<figure class="highlight javascript"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">// &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x76F8;&#x5F53;&#x4E8E;AngularJS&#x6A21;&#x5757;&#x7684;setter&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x6A21;&#x5757;&#x7684;&#x3002;</span></span><br><span class="line">angular.module(<span class="string">&apos;myApp&apos;</span>, []);</span><br><span class="line"></span><br><span class="line"><span class="comment">// &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x5E94;&#x7528;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;AngularJS&#x6A21;&#x5757;&#x7684;getter&#x65B9;&#x6CD5;</span></span><br><span class="line">angular.module(<span class="string">&apos;myApp&apos;</span>)</span><br></pre></td></tr></table></figure>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/web前端/">web前端</a>, <a href="/categories/web前端/Javascript/">Javascript</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/AngularJS/">AngularJS</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/设计模式/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/设计模式/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>##&#x95EE;&#x9898;</p>
<p>###&#x4E86;&#x89E3;&#x54EA;&#x4E9B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;6&#x4E2A;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x5206;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6BCF;&#x79CD;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4F53;&#x73B0;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x54EA;&#x4E2A;&#xFF1F;</p>
<p>###&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E66;&#x7C4D;&#xFF0C;&#x7B80;&#x8FF0;&#x3002;</p>
<p>###&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7ED3;&#x6784;&#x56FE;&#x548C;&#x4F7F;&#x7528;&#x573A;&#x666F;</p>
<p>###Spring AOP&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x8BBE;&#x8BA1;&#x539F;&#x5219;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/params/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/params/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        {&quot;name&quot;:&quot;Arthinking.GitHub.io&quot;,&quot;tagline&quot;:&quot;&quot;,&quot;body&quot;:&quot;arthinking&#x7684;&#x6280;&#x672F;&#x603B;&#x7ED3;\r\n----------\r\n&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x603B;&#x7ED3;&#x5BF9;&#x6BD4;&#x7684;&#x601D;&#x8003;&#x533A;\r\n\r\n&gt; Author: arthinking  \r\n&gt; E-mail: 1225538383@qq.com\r\n\r\n****\r\n\r\n# [Java](https://github.com/arthinking/arthinking/blob/master/Java.md \&quot;Java\&quot;)\r\n\r\n# Mysql\r\n\r\n\r\n----------\r\n\r\n#GitHub&#x76F8;&#x5173;&#x8D44;&#x6E90;\r\nmarkdown&#x8BED;&#x6CD5;&#xFF1A;https://github.com/guodongxiaren/test  \r\nGitHub&#x4E0A;README&#x5199;&#x6CD5;&#x66A8;GFM&#x8BED;&#x6CD5;&#x89E3;&#x8BFB;&#xFF1A;http://blog.csdn.net/wqvbjhc/article/details/27349209&quot;,&quot;google&quot;:&quot;&quot;,&quot;note&quot;:&quot;Don&apos;t delete this file! It&apos;s used internally to help with page regeneration.&quot;}
      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/library/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/library/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <h1 id="Library"><a href="#Library" class="headerlink" title="Library"></a>Library</h1><h2 id="Github"><a href="#Github" class="headerlink" title="Github"></a>Github</h2><p><a href="http://gitbook.liuhui998.com/index.html" title="Git Community Book &#x4E2D;&#x6587;&#x7248;" target="_blank" rel="external">Git Community Book &#x4E2D;&#x6587;&#x7248;</a></p>
<p><a href="https://github.com/tiimgreen/github-cheat-sheet/blob/master/README.zh-cn.md" title="Git Hub&#x79D8;&#x7C4D;" target="_blank" rel="external">Git Hub&#x79D8;&#x7C4D;</a></p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>#Java&#x57FA;&#x7840;&#x77E5;&#x8BC6;</p>
<p>##HashMap &#x4E0E; ConcurrentHashMap<br>HashMap&#x7684;&#x6269;&#x5BB9;&#x673A;&#x5236;&#xFF0C;ConcurrentHashMap&#x7684;&#x539F;&#x7406;&#xFF1A;</p>
<blockquote>
<p><a href="HashMap&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x5206;&#x6790;" title="http://blog.csdn.net/luanlouis/article/details/41576373">HashMap&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x5206;&#x6790;</a><br>HashMap&#x9020;&#x6210;&#x7684;&#x6B7B;&#x9501;&#x95EE;&#x9898;<br><a href="ConcurrentHashMap&#x539F;&#x7406;&#x5206;&#x6790;" title="http://pengtyao.iteye.com/blog/1074271">ConcurrentHashMap&#x539F;&#x7406;&#x5206;&#x6790;</a></p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x65F6;&#x4F7F;&#x7528;HashMap&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x591A;&#x7EBF;&#x7A0B;&#x65F6;&#x7528;Hashtable&#x6765;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x3002;</p>
<p>HashMap&#x4F5C;&#x4E3A;&#x7F13;&#x5B58;&#x5BFC;&#x81F4;&#x7684;&#x601D;&#x7D22;&#x95EE;&#x9898;&#x5206;&#x6790;</p>
<p>##&#x5E8F;&#x5217;&#x5316;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF0C;&#x5E8F;&#x5217;&#x5316;id&#x4F1A;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x95EE;&#x9898;<br><a href="http://www.itzhai.com/javascript-design-patterns-notes-combined-mode.html#2&#x3001;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#xFF1A;" title="&#x5916;&#x89C2;&#x6A21;&#x5F0F;" target="_blank" rel="external">&#x5916;&#x89C2;&#x6A21;&#x5F0F;</a>&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="http://www.ibm.com/developerworks/cn/java/j-lo-serial/#major3" title="Java&#x5E8F;&#x5217;&#x5316;ID&#x95EE;&#x9898;" target="_blank" rel="external">Java&#x5E8F;&#x5217;&#x5316;ID&#x95EE;&#x9898;</a><br>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x7248;&#x672C;&#x5347;&#x7EA7;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5BF9;&#x8C61;&#x6539;&#x52A8;&#xFF0C;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x4E86;id&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5BA2;&#x6237;&#x7AEF;&#x89E3;&#x6790;&#x65E7;&#x7684;&#x5BF9;&#x8C61;&#x5C31;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x83B7;&#x53D6;&#x6700;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x5316;&#x6587;&#x4EF6;&#x3002;</p>
<p>##JDK&#x5E38;&#x7528;&#x5E93;&#xFF0C;JDK&#x6E90;&#x4EE3;&#x7801;</p>
<p>###Java IO&#x7C7B;&#x5E93;&#x7ED3;&#x6784;&#x56FE;&#xFF0C;&#x548C;&#x6240;&#x7528;&#x5230;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</p>
<p>##NIO</p>
<p>###&#x963B;&#x585E;&#x540E;&#x7684;&#x901A;&#x77E5;&#x673A;&#x5236;</p>
<p>##RuntimeException&#x4E0E;CheckedException<br><strong>checked exception</strong><br>checked exception&#x662F;&#x4ECE;java.lang.Exception&#x7C7B;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#xFF1B;<br>runtime exception&#x662F;&#x4ECE;java.lang.RuntimeException &#x6216;java.lang.Error&#x7C7B;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#xFF0C;RuntimeException&#x53C8;&#x7EE7;&#x627F;&#x81EA;Exception&#xFF1B;<br>checked exception&#x7528;&#x6765;&#x6307;&#x793A;&#x4E00;&#x79CD;&#x8C03;&#x7528;&#x65B9;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF1B;    </p>
<p><strong>Runtime Exception</strong><br>&#x5728;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x58F0;&#x660E;&#x4F1A;&#x629B;&#x51FA;runtime exception&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x6355;&#x83B7;runtime exception&#xFF1B;<br>&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x662F;&#x5FC5;&#x987B;&#x58F0;&#x660E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x629B;&#x51FA;&#x7684;checked exception&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x6355;&#x83B7;&#x5B83;&#x7684;checked exception,&#x6216;&#x8005;throws&#x51FA;&#x53BB;&#xFF1B;<br>runtime exception&#x6307;&#x793A;&#x4E00;&#x79CD;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8D27;&#x6062;&#x590D;&#x7684;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#xFF1B;    </p>
<p>#&#x53CD;&#x5C04; &#x52A8;&#x6001;&#x4EE3;&#x7406;<br><a href="http://yajie.iteye.com/blog/1186522" title="&#x770B;&#x770B;java&#x7684;&#x53CD;&#x5C04;&#x6548;&#x7387;" target="_blank" rel="external">&#x770B;&#x770B;java&#x7684;&#x53CD;&#x5C04;&#x6548;&#x7387;</a></p>
<hr>
<p>#Java&#x914D;&#x7F6E;&#x6587;&#x4EF6;</p>
<hr>
<h1 id="JVM&#x865A;&#x62DF;&#x673A;"><a href="#JVM&#x865A;&#x62DF;&#x673A;" class="headerlink" title="JVM&#x865A;&#x62DF;&#x673A;"></a>JVM&#x865A;&#x62DF;&#x673A;</h1><h2 id="&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;"><a href="#&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;" class="headerlink" title="&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;"></a>&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;</h2><ul>
<li><a href="http://www.itzhai.com/jvm-note-introduce-java.html" title="&#x8D70;&#x8FD1;Java" target="_blank" rel="external">&#x8D70;&#x8FD1;Java</a></li>
<li><p><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;Java&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5F02;&#x5E38;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;Java&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5F02;&#x5E38;&#xFF09;</a><br>  <a href="https://github.com/arthinking/java-code/blob/master/src/me/arthinking/memoryleaktest/HeapOOM.java" title="Java&#x5806;&#x6EA2;&#x51FA;" target="_blank" rel="external">Java&#x5806;&#x6EA2;&#x51FA;</a><br>  <a href="https://github.com/arthinking/java-code/tree/master/src/me/arthinking/memoryleaktest" title="more" target="_blank" rel="external">more</a><br>  &#x65B0;&#x751F;&#x4EE3;Minor GC&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="https://github.com/arthinking/java-code/blob/master/src/me/arthinking/code4jvmnote/C_3_5_Minor_GC.java" title="&#x70B9;&#x6211;" target="_blank" rel="external">&#x70B9;&#x6211;</a></p>
<blockquote>
<ol>
<li>&#x5206;&#x914D;allocation4&#x65F6;&#xFF0C;Eden&#x5DF2;&#x7ECF;&#x88AB;&#x5360;&#x7528;6MB&#xFF0C;&#x4E0D;&#x591F;&#x4E86;&#xFF08;&#x603B;&#x5171;8MB&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x6B21;Minor GC&#xFF1B;  </li>
<li>GC&#x671F;&#x95F4;&#x53D1;&#x73B0;&#x5DF2;&#x6709;&#x7684;3X2MB&#x5927;&#x5C0F;&#x5BF9;&#x8C61;&#x65E0;&#x6CD5;&#x5168;&#x90E8;&#x653E;&#x5165;Survivor&#x7A7A;&#x95F4;,&#x6240;&#x4EE5;&#x53EA;&#x597D;&#x901A;&#x8FC7;<a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-2-html.html#6.5&#x3001;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x62C5;&#x4FDD;" title="&#x5206;&#x914D;&#x62C5;&#x4FDD;&#x673A;&#x5236;" target="_blank" rel="external">&#x5206;&#x914D;&#x62C5;&#x4FDD;&#x673A;&#x5236;</a>&#x63D0;&#x524D;&#x8F6C;&#x79FB;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x53BB;&#x4E86;&#xFF1B;  </li>
<li>GC&#x7ED3;&#x675F;&#x540E;&#xFF0C;4MB&#x7684;allocation4&#x5BF9;&#x8C61;&#x88AB;&#x5206;&#x914D;&#x5230;Eden&#x4E2D;&#xFF0C;Survivor&#x7A7A;&#x95F2;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x5360;&#x7528;6MB    </li>
</ol>
</blockquote>
</li>
<li><p><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-2-html.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF09;</a>    </p>
</li>
<li><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-3.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4E0E;&#x6545;&#x969C;&#x5904;&#x7406;&#x5DE5;&#x5177;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4E0E;&#x6545;&#x969C;&#x5904;&#x7406;&#x5DE5;&#x5177;&#xFF09;</a>     </li>
</ul>
<p>&#x4E0B;&#x9762;&#x662F;Java&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x5206;&#x6790;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="http://www.itzhai.com/java-memory-leak-analyze.html" title="Java&#x4E2D;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x5206;&#x6790;" target="_blank" rel="external">Java&#x4E2D;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x5206;&#x6790;</a> </p>
<ul>
<li><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-4.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x8C03;&#x4F18;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x4E0E;&#x5B9E;&#x6218;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x8C03;&#x4F18;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x4E0E;&#x5B9E;&#x6218;&#xFF09;</a> </li>
<li><a href="http://www.itzhai.com/the-class-file-structure.html" title="&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;" target="_blank" rel="external">&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;</a>     </li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x540C;&#x6B65;&#x6307;&#x4EE4;monitorenter&#x548C;monitorexit&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#x58F0;&#x660E;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x7528;&#x6765;&#x6267;&#x884C;monitorexit&#x6307;&#x4EE4;&#x3002;</p>
<ul>
<li><a href="http://www.itzhai.com/the-class-file-structure.html" title="&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;" target="_blank" rel="external">&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;</a>     </li>
</ul>
<p>&#x52A0;&#x8F7D; -&gt; (&#x9A8C;&#x8BC1; -&gt; &#x51C6;&#x5907; -&gt; <code>&#x89E3;&#x6790;</code>) -&gt; &#x521D;&#x59CB;&#x5316; -&gt; &#x4F7F;&#x7528; -&gt; &#x5378;&#x8F7D;<br>&#x5176;&#x4E2D;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x4E4B;&#x540E;&#x518D;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x4FBF;&#x652F;&#x6301;&#x8FD0;&#x884C;&#x65F6;&#x7ED1;&#x5B9A;&#xFF08;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x6216;&#x665A;&#x671F;&#x7ED1;&#x5B9A;&#xFF09;&#x3002;</p>
<p>JVM&#x4E2D;&#x4E25;&#x683C;&#x89C4;&#x5B9A;&#x6709;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E0B;&#x4E94;&#x4E2D;&#x60C5;&#x51B5;&#x5FC5;&#x987B;&#x5BF9;&#x7C7B;&#x8FDB;&#x884C;&#x201C;&#x521D;&#x59CB;&#x5316;&#x201D;&#xFF1A;<a href="http://" target="_blank" rel="external">detail</a>(&#x52A0;&#x8F7D;&#x3001;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x81EA;&#x7136;&#x9700;&#x8981;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x5F00;&#x59CB;)    </p>
<p>&#x8FD9;5&#x79CD;&#x573A;&#x666F;&#x79F0;&#x4E3A;&#x5BF9;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x4E3B;&#x52A8;&#x5F15;&#x7528;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x79F0;&#x4E3A;&#x88AB;&#x52A8;&#x5F15;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<blockquote>
<p>&#x901A;&#x8FC7;&#x5B50;&#x7C7B;&#x5F15;&#x7528;&#x7236;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x5B57;&#x6BB5;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x5B50;&#x7C7B;&#x521D;&#x59CB;&#x5316;</p>
<p>&#x901A;&#x8FC7;&#x6570;&#x7EC4;&#x5B9A;&#x4E49;&#x6765;&#x5F15;&#x7528;&#x7C7B;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x6B64;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;    </p>
<p>&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;    </p>
</blockquote>
<p>###JVM&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0E;GC&#x56DE;&#x6536;&#x673A;&#x5236;</p>
<p>###JVM&#x8C03;&#x4F18;&#x548C;&#x5E38;&#x7528;&#x5DE5;&#x5177;</p>
<p><strong>&#x5982;&#x4F55;dump&#x51FA;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x72B6;&#x6001;</strong><br>&#x4F7F;&#x7528;<a href="http://www.blogjava.net/jzone/articles/303979.html" title="jstack pid" target="_blank" rel="external">jstack pid</a>&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;<a href="http://segmentfault.com/blog/yexiaobai/1190000000615690" title="Thread Dumps&#x7684;&#x5206;&#x6790;" target="_blank" rel="external">Thread Dumps&#x7684;&#x5206;&#x6790;</a>    </p>
<p><strong><em>&#x7EBF;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF1A;</em></strong><br><code>Runnable</code>&#xFF1A;<br><code>Wait oncondition</code>&#xFF1A;<br><code>Waiting for monitor entry</code>&#xFF1A;<br><code>in Object.wait()</code>&#xFF1A;        </p>
<p><strong><em>&#x6848;&#x4F8B;</em></strong>&#xFF1A;<code>&#x6B7B;&#x9501;</code> &amp; <code>&#x70ED;&#x9501;</code><br>Java5&#x4E2D;&#x52A0;&#x5F3A;&#x4E86;&#x5806;&#x601D;&#x7D22;&#x7684;&#x76D1;&#x6D4B;&#x7EBF;&#x7A0B;Dump&#x4E2D;&#x79D1;&#x9662;&#x76F4;&#x63A5;&#x62A5;&#x544A;&#x51FA;Java&#x7EA7;&#x522B;&#x7684;&#x601D;&#x7D22;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5927;&#x91CF;&#x4F7F;&#x7528; synchronized&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x9002;&#x5F53;&#x7684;&#x4F7F;&#x7528;&#x4E86;&#x5B83;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#x5728;&#x4E34;&#x754C;&#x533A;&#x7684;&#x5165;&#x53E3;&#x7B49;&#x5F85;&#xFF0C;&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x5927;&#x5E45;&#x4E0B;&#x964D;&#x3002;&#x5982;&#x679C;&#x5728;&#x7EBF;&#x7A0B; DUMP&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#xFF0C;&#x5E94;&#x8BE5;&#x5BA1;&#x67E5;&#x6E90;&#x7801;&#xFF0C;&#x6539;&#x8FDB;&#x7A0B;&#x5E8F;&#x3002;(&#x5F15;&#x7528;)</p>
</blockquote>
<p><strong>JVM&#x8C03;&#x4F18;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;</strong></p>
<p>##ClassLoader&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;String&#x7C7B;<br>&#x8BF4;&#x8BF4;ClassLoader&#x7684;&#x53CC;&#x4EB2;&#x4EE3;&#x7406;&#x673A;&#x5236;</p>
<p>##&#x4FEE;&#x6539;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5B9E;&#x73B0;&#x70ED;&#x90E8;&#x7F72;<br><a href="http://www.ibm.com/developerworks/cn/java/j-lo-hotdeploy/index.html" title="ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;" target="_blank" rel="external">ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;</a>&#x7684;&#x6D41;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x804C;&#x8D23;&#x94FE;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x6BCF;&#x6B21;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x7528;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;Class&#x6587;&#x4EF6;&#x751F;&#x6210;&#x5B9E;&#x4F8B;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x70ED;&#x90E8;&#x7F72;&#xFF0C;&#x4F46;&#x662F;PermGen space&#x8FD8;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4EC5;&#x4EC5;&#x662F;&#x8BA9;&#x65B0;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x7528;&#x65B0;&#x7684;&#x903B;&#x8F91;&#xFF1B;<br><a href="http://my.oschina.net/heroShane/blog/198492" title="Tomcat" target="_blank" rel="external">Tomcat</a>&#x4E2D;&#x7684;&#x70ED;&#x90E8;&#x7F72;&#x5B9E;&#x73B0;&#x3002;</p>
<hr>
<p>#&#x6846;&#x67B6;&#x6E90;&#x7801;&#x76F8;&#x5173;</p>
<p>##&#x5E76;&#x53D1;&#x6846;&#x67B6;<br>&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x7528;&#x8FC7;&#x54EA;&#x4E9B;</p>
<p>##Spring</p>
<p>##OSGi&#x6846;&#x67B6;</p>
<p>###&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;bundle&#x4E2D;&#x52A0;&#x8F7D;&#x53E6;&#x4E00;&#x4E2A;bundle&#x7684;Class&#x5BF9;&#x8C61;</p>
<hr>
<p>#Java Web</p>
<p>##Servlet&#x4E0E;Filter&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x539F;&#x7406;&#xFF0C;&#x914D;&#x7F6E;</p>
<p>##Session&#x5171;&#x4EAB;&#x673A;&#x5236;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/HTTP协议/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/HTTP协议/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>##HTTP&#x534F;&#x8BAE;&#x8FD4;&#x56DE;&#x7801;&#xFF0C;301,302</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>




<nav class="pagination">
  
  <a href="/page/8/" class="pagination-prev">Prev</a>
  
  
</nav>
      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 arthinking
  
</p>
</footer>
    
  </div>
</div>
</body>
</html>