<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>JVM笔记 - 程序编译与代码优化（早期（编译器）优化） | arthinking | ChinSyun Pang&#39;s blog</title>
  <meta name="author" content="arthinking">
  
  <meta name="description" content="Struggle for HighPay zoom.">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="JVM笔记 - 程序编译与代码优化（早期（编译器）优化）"/>
  <meta property="og:site_name" content="arthinking"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="arthinking" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/">arthinking</a>
  </h1>
  <p class="site-description">ChinSyun Pang&#39;s blog</p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        
<article class="post article">

  
  
    <h3 class="article-title"><span>JVM笔记 - 程序编译与代码优化（早期（编译器）优化）</span></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120501_JVM笔记 - 程序编译与代码优化（早期（编译器）优化）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>Java&#x8BED;&#x8A00;&#x7684;&#x201C;&#x7F16;&#x8BD1;&#x671F;&#x201D;&#x662F;&#x4E00;&#x6BB5;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#xFF1A;    </p>
<ul>
<li>&#x524D;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF08;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x524D;&#x7AEF;&#xFF09;&#x628A;Java&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x4E3A;class&#x6587;&#x4EF6;&#xFF1B;Sun &#x7684; Javac&#x3001; Eclipse   JDT &#x4E2D;&#x7684;&#x589E;&#x91CF;&#x5F0F;&#x7F16;&#x8BD1;&#x5668;&#xFF08; ECJ&#xFF09;[ 1]&#x3002;</li>
<li>&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF08;JIT&#x7F16;&#x8BD1;&#x671F; Just in time compiler&#xFF09;&#x628A;&#x5B57;&#x8282;&#x7801;&#x53D8;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF1B;JIT &#x7F16;&#x8BD1;&#x5668;&#xFF1A; HotSpot   VM &#x7684; C1&#x3001; C2 &#x7F16;&#x8BD1;&#x5668;&#x3002;</li>
<li>&#x9759;&#x6001;&#x7F16;&#x8BD1;&#x5668;&#xFF08;AOT&#x7F16;&#x8BD1;&#x5668; ahead of time compiler&#xFF09;&#x76F4;&#x63A5;&#x628A;Java&#x7F16;&#x8BD1;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x4EE3;&#x7801;&#xFF1B;</li>
<li>AOT &#x7F16;&#x8BD1;&#x5668;&#xFF1A; GNU   Compiler   for   the   Java&#xFF08; GCJ&#xFF09;[ 2]&#x3001; Excelsior JET[ 3]&#x3002;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7B2C;&#x4E00;&#x7C7B;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>Javac &#x8FD9;&#x7C7B;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F18;&#x5316;&#x63AA;&#x65BD;&#xFF08;&#x5728; JDK   1. 3 &#x4E4B;&#x540E;&#xFF0C; Javac &#x7684;- O &#x4F18;&#x5316;&#x53C2;&#x6570;&#x5C31;&#x4E0D;&#x518D;&#x6709;&#x610F;&#x4E49;&#xFF09;&#x3002;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x628A;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x4F18;&#x5316;&#x96C6;&#x4E2D;&#x5230;&#x4E86;&#x540E;&#x7AEF;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4E2D;&#x3002;</p>
<p>#2&#x3001;Javac&#x7F16;&#x8BD1;&#x5668;<br>&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7531; Java &#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E3A;&#x7EAF; Java &#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x4FBF;&#x5229;&#x3002;</p>
<p>##2.1&#x3001;Javac&#x7684;&#x6E90;&#x7801;&#x4E0E;&#x8C03;&#x8BD5;</p>
<p>##2.2&#x3001;&#x89E3;&#x6790;&#x4E0E;&#x586B;&#x5145;&#x7B26;&#x53F7;&#x8868;</p>
<p>##2.3&#x3001;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;<br>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x7684;&#x6807;&#x51C6; API &#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x5BF9;&#x6CE8;&#x89E3;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x7F16;&#x8BD1;&#x5668;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x7684;&#x6807;&#x51C6; API &#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x5E72;&#x6D89;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x7531;&#x4E8E;&#x8BED;&#x6CD5;&#x6811;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x5143;&#x7D20;&#xFF0C;&#x751A;&#x81F3;&#x5305;&#x62EC;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x63D2;&#x4EF6;&#x4E4B;&#x4E2D;&#x8BBF;&#x95EE;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x63D2;&#x4EF6;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x53D1;&#x6325;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728; Javac &#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x7684;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x662F;&#x5728; initPorcessAnnotations() &#x65B9;&#x6CD5;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x5B83;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5219;&#x662F;&#x5728;processAnnotations() &#x65B9;&#x6CD5;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<p>##2.4&#x3001;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x4E0E;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;<br>&#x7F16;&#x8BD1;&#x5668;&#x83B7;&#x5F97;&#x4E86;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x8868;&#x793A;&#xFF0C;&#x8BED;&#x6CD5;&#x6811;&#x80FD;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x6B63;&#x786E;&#x7684;&#x6E90;&#x7A0B;&#x5E8F;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x6E90;&#x7A0B;&#x5E8F;&#x662F;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#x3002;&#x800C;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x5BF9;&#x7ED3;&#x6784;&#x4E0A;&#x6B63;&#x786E;&#x7684;&#x6E90;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6709;&#x5173;&#x6027;&#x8D28;&#x7684;&#x5BA1;&#x67E5;&#xFF0C;&#x5982;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x5BA1;&#x67E5;&#x3002;</p>
<p>&#x662F;&#x5426;&#x5408;&#x4E4E;&#x8BED;&#x4E49;&#x903B;&#x8F91;&#x5FC5;&#x987B;&#x9650;&#x5B9A;&#x5728;&#x5177;&#x4F53;&#x7684;&#x8BED;&#x8A00;&#x4E0E;&#x5177;&#x4F53;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4E4B;&#x4E2D;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;</p>
<blockquote>
<p>&#x6807;&#x6CE8;&#x68C0;&#x67E5; Javac &#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
</blockquote>
<p>&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x6B65;&#x9AA4;&#x68C0;&#x67E5;&#x7684;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x8BF8;&#x5982;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x524D;&#x662F;&#x5426;&#x5DF2;&#x88AB;&#x58F0;&#x660E;&#x3001;&#x53D8;&#x91CF;&#x4E0E;&#x8D4B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x80FD;&#x591F;&#x5339;&#x914D;&#x7B49;&#x3002;&#x5728;&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x6B65;&#x9AA4;&#x4E2D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x52A8;&#x4F5C;&#x79F0;&#x4E3A;&#x5E38;&#x91CF;&#x6298;&#x53E0;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x8FDB;&#x884C;&#x4E86;&#x5E38;&#x91CF;&#x6298;&#x53E0;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x5B9A;&#x4E49;&#x201D; a= 1+ 2&#x201D; &#x6BD4;&#x8D77;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x201D; a= 3&#x201D;&#xFF0C; &#x5E76;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x54EA;&#x6015;&#x4EC5;&#x4EC5;&#x4E00;&#x4E2A; CPU &#x6307;&#x4EE4;&#x7684;&#x8FD0;&#x7B97;&#x91CF;&#x3002;</p>
<blockquote>
<p>&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;</p>
</blockquote>
<p>&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;&#x662F;&#x5BF9;&#x7A0B;&#x5E8F;&#x4E0A;&#x4E0B;&#x6587;&#x903B;&#x8F91;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x51FA;&#x8BF8;&#x5982;&#x7A0B;&#x5E8F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x524D;&#x662F;&#x5426;&#x6709;&#x8D4B;&#x503C;&#x3001;&#x65B9;&#x6CD5;&#x7684;&#x6BCF;&#x6761;&#x8DEF;&#x5F84;&#x662F;&#x5426;&#x90FD;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x3001;&#x662F;&#x5426;&#x6240;&#x6709;&#x7684;&#x53D7;&#x67E5;&#x5F02;&#x5E38;&#x90FD;&#x88AB;&#x6B63;&#x786E;&#x5904;&#x7406;&#x4E86;&#x7B49;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C06;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A; final&#xFF0C; &#x5BF9;&#x8FD0;&#x884C;&#x671F;&#x662F;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x4EC5;&#x4EC5;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x4FDD;&#x969C;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E0E;&#x5B57;&#x6BB5;&#xFF08;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3001;&#x7C7B;&#x53D8;&#x91CF;&#xFF09;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x5B83;&#x5728;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x6CA1;&#x6709; CONSTANT<em> Fieldref</em> info &#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x6CA1;&#x6709;&#x8BBF;&#x95EE;&#x6807;&#x5FD7;&#xFF08; Access_ Flags&#xFF09; &#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<p>&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;</p>
</blockquote>
<p>&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x8FD8;&#x539F;&#x56DE;&#x7B80;&#x5355;&#x7684;&#x57FA;&#x7840;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;&#x3002;</p>
<p>&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x8FC7;&#x7A0B;&#x7531; desugar() &#x65B9;&#x6CD5;&#x89E6;&#x53D1;&#x3002;</p>
<blockquote>
<p>&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;</p>
</blockquote>
<p>&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x662F; Javac &#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;</p>
<p>&#x628A;&#x524D;&#x9762;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x6240;&#x751F;&#x6210;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x8BED;&#x6CD5;&#x6811;&#x3001;&#x7B26;&#x53F7;&#x8868;&#xFF09;&#x8F6C;&#x5316;&#x6210;&#x5B57;&#x8282;&#x7801;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x4E2D;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x8FDB;&#x884C;&#x4E86;&#x5C11;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x548C;&#x8F6C;&#x6362;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x7684;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;&#xFF1C; init &#xFF1E;()&#x65B9;&#x6CD5;&#x548C;&#x7C7B;&#x6784;&#x9020;&#x5668;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6DFB;&#x52A0;&#x5230;&#x8BED;&#x6CD5;&#x6811;&#x4E4B;&#x4E2D;&#x7684;</p>
<p>&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x66FF;&#x6362;&#x5DE5;&#x4F5C;&#x7528;&#x4E8E;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x7684;&#x5B9E;&#x73B0;&#x903B;&#x8F91;&#xFF0C;&#x5982;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x52A0;&#x64CD;&#x4F5C;&#x66FF;&#x6362;&#x4E3A; StringBuffer &#x6216; StringBuilder&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x4E86;&#x5BF9;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x904D;&#x5386;&#x548C;&#x8C03;&#x6574;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x586B;&#x5145;&#x4E86;&#x6240;&#x6709;&#x6240;&#x9700;&#x4FE1;&#x606F;&#x7684;&#x7B26;&#x53F7;&#x8868;&#x4EA4;&#x7ED9; com. sun. tools. javac. jvm. ClassWriter &#x7C7B;&#xFF0C;&#x7531;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684; writeClass() &#x65B9;&#x6CD5;&#x8F93;&#x51FA;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x751F;&#x6210;&#x6700;&#x7EC8;&#x7684; Class &#x6587;&#x4EF6;&#xFF0C;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x6574;&#x4E2A;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x5BA3;&#x544A;&#x7ED3;&#x675F;&#x3002;</p>
<p>#3&#x3001;Java&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x5473;&#x9053;</p>
<p>##3.1&#x3001;&#x6CDB;&#x578B;&#x4E0E;&#x7C7B;&#x578B;&#x64E6;&#x9664;<br>Java &#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x5219;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x53EA;&#x5728;&#x7A0B;&#x5E8F;&#x6E90;&#x7801;&#x4E2D;&#x5B58;&#x5728;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x66FF;&#x6362;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x539F;&#x751F;&#x7C7B;&#x578B;&#xFF08; Raw   Type&#xFF0C; &#x4E5F;&#x79F0;&#x4E3A;&#x88F8;&#x7C7B;&#x578B;&#xFF09;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x76F8;&#x5E94;&#x7684;&#x5730;&#x65B9;&#x63D2;&#x5165;&#x4E86;&#x5F3A;&#x5236;&#x8F6C;&#x578B;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x64E6;&#x9664;&#x6210;&#x76F8;&#x540C;&#x7684;&#x539F;&#x751F;&#x7C7B;&#x578B;&#x53EA;&#x662F;&#x65E0;&#x6CD5;&#x91CD;&#x8F7D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x8981;&#x6C42;&#x65B9;&#x6CD5;&#x5177;&#x5907;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#x4E4B;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x53C2;&#x4E0E;&#x91CD;&#x8F7D;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x662F;&#x5728; Class &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x4E4B;&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x63CF;&#x8FF0;&#x7B26;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x5171;&#x5B58;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5982;&#x679C;&#x6709;&#x76F8;&#x540C;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x5B83;&#x4EEC;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5408;&#x6CD5;&#x5730;&#x5171;&#x5B58;&#x4E8E;&#x4E00;&#x4E2A; Class &#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x3002;</p>
<p>link</p>
<p>Signature&#x3001; LocalVariableTypeTable &#x7B49;&#x65B0;&#x7684;&#x5C5E;&#x6027;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x4F34;&#x968F;&#x6CDB;&#x578B;&#x800C;&#x6765;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x8BC6;&#x522B;&#x95EE;&#x9898;&#xFF0C; Signature &#x662F;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x9879;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x5B57;&#x8282;&#x7801;&#x5C42;&#x9762;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;[ 3]&#xFF0C; &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5E76;&#x4E0D;&#x662F;&#x539F;&#x751F;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x662F;&#x5305;&#x62EC;&#x4E86;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x7531;&#x4E8E; List &#xFF1C; String &#xFF1E;&#x548C; List &#xFF1C; Integer &#xFF1E;&#x64E6;&#x9664;&#x540E;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x6DFB;&#x52A0;&#x4E24;&#x4E2A;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x91CD;&#x8F7D;&#x3002;</p>
<p>&#x64E6;&#x9664;&#x6CD5;&#x6240;&#x8C13;&#x7684;&#x64E6;&#x9664;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x65B9;&#x6CD5;&#x7684; Code &#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x7801;&#x8FDB;&#x884C;&#x64E6;&#x9664;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x8FD8;&#x662F;&#x4FDD;&#x7559;&#x4E86;&#x6CDB;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x624B;&#x6BB5;&#x53D6;&#x5F97;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#x7684;&#x6839;&#x672C;&#x4F9D;&#x636E;&#x3002;</p>
<p>##3.2&#x3001;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x3001;&#x62C6;&#x7BB1;&#x4E0E;&#x904D;&#x5386;&#x5FAA;&#x73AF;<br>&#x904D;&#x5386;&#x5FAA;&#x73AF;&#x5219;&#x628A;&#x4EE3;&#x7801;&#x8FD8;&#x539F;&#x6210;&#x4E86;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4F55;&#x904D;&#x5386;&#x5FAA;&#x73AF;&#x9700;&#x8981;&#x88AB;&#x904D;&#x5386;&#x7684;&#x7C7B;&#x5B9E;&#x73B0; Iterable &#x63A5;&#x53E3;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5305;&#x88C5;&#x7C7B;&#x7684;&#x201C;==&#x201D;&#x8FD0;&#x7B97;&#x5728;&#x4E0D;&#x9047;&#x5230;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x62C6;&#x7BB1;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC; equals() &#x65B9;&#x6CD5;&#x4E0D;&#x5904;&#x7406;&#x6570;&#x636E;&#x8F6C;&#x578B;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7B14;&#x8005;&#x5EFA;&#x8BAE;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7801;&#x4E2D;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x4E0E;&#x62C6;&#x7BB1;&#x3002;</p>
<p>##3.3&#x3001;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;<br>Java &#x8BED;&#x8A00;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;&#xFF0C;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x4E3A;&#x5E38;&#x91CF;&#x7684; if &#x8BED;&#x53E5;&#x3002;</p>
<p>#4&#x3001;&#x5B9E;&#x6218;&#xFF1A;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;</p>
<p>##4.1&#x3001;&#x5B9E;&#x6218;&#x76EE;&#x6807;</p>
<p>##4.2&#x3001;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;<br>&#x8981;&#x901A;&#x8FC7;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668; API &#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x63D2;&#x4EF6;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x7EC4; API &#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x5728; JDK   1. 6 &#x65B0;&#x589E;&#x7684; javax. lang. model &#x5305;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86; 16 &#x7C7B; Element&#xFF0C; &#x5305;&#x62EC;&#x4E86; Java &#x4EE3;&#x7801;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#xFF1A;&#x201C;&#x5305;&#xFF08; PACKAGE&#xFF09;&#x3001; &#x679A;&#x4E3E;&#xFF08; ENUM&#xFF09;&#x3001; &#x7C7B;&#xFF08; CLASS&#xFF09;&#x3001; &#x6CE8;&#x89E3;&#xFF08; ANNOTATION<em> TYPE&#xFF09;&#x3001; &#x63A5;&#x53E3;&#xFF08; INTERFACE&#xFF09;&#x3001; &#x679A;&#x4E3E;&#x503C;&#xFF08; ENUM</em> CONSTANT&#xFF09;&#x3001; &#x5B57;&#x6BB5;&#xFF08; FIELD&#xFF09;&#x3001; &#x53C2;&#x6570;&#xFF08; PARAMETER&#xFF09;&#x3001; &#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF08; LOCAL<em> VARIABLE&#xFF09;&#x3001; &#x5F02;&#x5E38;&#xFF08; EXCEPTION</em> PARAMETER&#xFF09;&#x3001; &#x65B9;&#x6CD5;&#xFF08; METHOD&#xFF09;&#x3001; &#x6784;&#x9020;&#x51FD;&#x6570;&#xFF08; CONSTRUCTOR&#xFF09;&#x3001; &#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#xFF08; STATIC<em> INIT&#xFF0C; &#x5373; static{} &#x5757;&#xFF09;&#x3001;&#x5B9E;&#x4F8B;&#x8BED;&#x53E5;&#x5757;&#xFF08; INSTANCE</em> INIT&#xFF0C; &#x5373;{}&#x5757;&#xFF09;&#x3001;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#xFF08; TYPE_ PARAMETER&#xFF0C; &#x65E2;&#x6CDB;&#x578B;&#x5C16;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#x548C;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x5176;&#x4ED6;&#x8BED;&#x6CD5;&#x6811;&#x8282;&#x70B9;&#xFF08; OTHER&#xFF09;&#x201D;&#x3002;</p>
<p>##4.3&#x3001;&#x8FD0;&#x884C;&#x4E0E;&#x6D4B;&#x8BD5;</p>
<p>##4.4&#x3001;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x6848;&#x4F8B;<br>NameCheckProcessor &#x7684;&#x5B9E;&#x6218;&#x4F8B;&#x5B50;&#x53EA;&#x6F14;&#x793A;&#x4E86; JSR- 269 &#x5D4C;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668; API &#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529F;&#x80FD;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x7EC4; API &#x652F;&#x6301;&#x7684;&#x9879;&#x76EE;&#x8FD8;&#x6709;&#x7528;&#x4E8E;&#x6821;&#x9A8C; Hibernate &#x6807;&#x7B7E;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x6027;&#x7684; Hibernate   Validator   Annotation Processor[ 1]&#xFF08; &#x672C;&#x8D28;&#x4E0A;&#x4E0E; NameCheckProcessor &#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5DEE;&#x4E0D;&#x591A;&#xFF09;&#x3001;&#x81EA;&#x52A8;&#x4E3A;&#x5B57;&#x6BB5;&#x751F;&#x6210; getter &#x548C; setter &#x65B9;&#x6CD5;&#x7684; Project   Lombok[ 2]&#xFF08; &#x6839;&#x636E;&#x5DF2;&#x6709;&#x5143;&#x7D20;&#x751F;&#x6210;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x6811;&#x5143;&#x7D20;&#xFF09;&#x7B49;&#x3002;</p>
<p>#5&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;<br>&#x4E4B;&#x6240;&#x4EE5;&#x628A; Javac &#x8FD9;&#x7C7B;&#x5C06; Java &#x4EE3;&#x7801;&#x8F6C;&#x53D8;&#x4E3A;&#x5B57;&#x8282;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x79F0;&#x505A;&#x201C;&#x524D;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x5B8C;&#x6210;&#x4E86;&#x4ECE;&#x7A0B;&#x5E8F;&#x5230;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x6216;&#x4E2D;&#x95F4;&#x5B57;&#x8282;&#x7801;&#x7684;&#x751F;&#x6210;&#xFF0C;&#x800C;&#x5728;&#x6B64;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x7EC4;&#x5185;&#x7F6E;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x7684;&#x201C;&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#x5B8C;&#x6210;&#x4E86;&#x4ECE;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5373;&#x524D;&#x9762;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x6216; JIT &#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x53CA;&#x7F16;&#x8BD1;&#x7ED3;&#x679C;&#x7684;&#x4F18;&#x52A3;&#xFF0C;&#x662F;&#x8861;&#x91CF;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6307;&#x6807;&#x3002;</p>
<blockquote>
<p>Javac(Java&#x5728;&#x7F16;&#x8BD1;&#x65F6;)&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;</p>
<pre><code>1&#x3001;&#x89E3;&#x6790;&#x4E0E;&#x586B;&#x5145;&#x7B26;&#x53F7;&#x8868;&#xFF1B;    
2&#x3001;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#xFF1B;    
3&#x3001;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x4E0E;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#xFF1A;    
    3.1&#x3001;&#x6807;&#x6CE8;&#x68C0;&#x67E5;    
    3.2&#x3001;&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;    
    3.3&#x3001;&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;    
        3.3.1&#x3001;&#x6CDB;&#x578B;&#x4E0E;&#x7C7B;&#x578B;&#x64E6;&#x9664;    
        3.3.2&#x3001;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x3001;&#x62C6;&#x7BB1;&#x4E0E;&#x904D;&#x5386;&#x5FAA;&#x73AF;    
        3.3.3&#x3001;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;    
    3.4&#x3001;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;
</code></pre><p>&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x628A;&#x5B57;&#x8282;&#x7801;&#x8F6C;&#x6362;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x7801;</p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>

  



      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 arthinking
  
</p>
</footer>
    
  </div>
</div>
</body>
</html>