<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>Page 8 | arthinking | ChinSyun Pang&#39;s blog</title>
  <meta name="author" content="arthinking">
  
  <meta name="description" content="Struggle for HighPay zoom.">
  
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  
  <meta property="og:site_name" content="arthinking"/>

  
    <meta property="og:image" content="undefined"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="arthinking" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div id="page" class="site">
  <div id="primary" class="content-area">

    <header id="header" class="inner"><div class="site-branding">
  <h1 class="site-title">
    <a href="/">arthinking</a>
  </h1>
  <p class="site-description">ChinSyun Pang&#39;s blog</p>
</div>
<nav id="site-navigation" class="main-navigation" role="navigation">
  <ul>
    
      <li><a href="/">Home</a></li>
    
      <li><a href="/archives">Archives</a></li>
    
  </ul>
</nav></header>

    <article id="content" class="site-content">
      <main id="main" class="site-main posts-loop" role="main">
        
  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120801_JVM笔记 - 高效并发（线程安全与锁优化）/"><span>JVM笔记 - 高效并发（线程安全与锁优化）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120801_JVM笔记 - 高效并发（线程安全与锁优化）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;</p>
<p>#2&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;</p>
<p>##2.1&#x3001;Java&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;<br>&#x6309;&#x7167;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x201C;&#x5B89;&#x5168;&#x7A0B;&#x5EA6;&#x201D;&#x7531;&#x5F3A;&#x81F3;&#x5F31;&#x6765;&#x6392;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;Java&#x8BED;&#x8A00;&#x4E2D;&#x5404;&#x79CD;&#x64CD;&#x4F5C;&#x5171;&#x4EAB;&#x7684;&#x6570;&#x636E;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;5&#x7C7B;&#xFF1A;&#x4E0D;&#x53EF;&#x53D8;&#x3001;&#x7EDD;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3001;&#x76F8;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3001;&#x7EBF;&#x7A0B;&#x5EFA;&#x8363;&#x548C;&#x7EBF;&#x7A0B;&#x5BF9;&#x7ACB;&#x3002;</p>
<p>###&#x4E0D;&#x53EF;&#x53D8;</p>
<p>&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x5BF9;&#x8C61;&#x4E00;&#x5B9A;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#x4FDD;&#x8BC1;&#x5BF9;&#x8C61;&#x884C;&#x4E3A;&#x4E0D;&#x5F71;&#x54CD;&#x81EA;&#x5DF1;&#x72B6;&#x6001;&#x7684;&#x9014;&#x5F84;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5C31;&#x662F;&#x628A;&#x5BF9;&#x8C61;&#x4E2D;&#x5E26;&#x6709;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x58F0;&#x660E;&#x4E3A;final&#x3002;</p>
<p>Java API&#x4E2D;&#x7B26;&#x5408;&#x4E0D;&#x53EF;&#x53D8;&#x8981;&#x6C42;&#x7684;&#x7C7B;&#x578B;&#xFF1A;String&#xFF0C;java.lang.Number&#x7684;&#x90E8;&#x5206;&#x5B50;&#x7C7B;&#xFF08;&#x5982;Long&#x548C;Double&#x7684;&#x6570;&#x503C;&#x5305;&#x88C5;&#x7C7B;&#xFF0C;BigInteger&#x548C;BigDecimal&#x7B49;&#x5927;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4F46;<code>AtomicInteger</code>&#x548C;<code>AtomicLong</code>&#x5219;&#x5E76;&#x975E;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF09;&#x3002;</p>
<p>###&#x7EDD;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;<br>Java API&#x4E2D;&#x6807;&#x6CE8;&#x81EA;&#x5DF1;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x90FD;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>###&#x76F8;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;<br>Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x90FD;&#x5C5E;&#x4E8E;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;Vector&#xFF0C;HashTable&#xFF0C;Collections&#x7684;synchronizedCollection()&#x65B9;&#x6CD5;&#x5305;&#x88C5;&#x7684;&#x96C6;&#x5408;&#x7B49;&#x3002;</p>
<p>###&#x7EBF;&#x7A0B;&#x517C;&#x5BB9;<br>&#x6307;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x624B;&#x6BB5;&#x6765;&#x4FDD;&#x8BC1;&#x5BF9;&#x8C61;&#x5728;&#x5E76;&#x53D1;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7684;&#x4F7F;&#x7528;&#x3002;Java API&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x7684;&#x7C7B;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x7EBF;&#x7A0B;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x5982;ArrayList&#x548C;HashMap&#x3002;</p>
<p>###&#x7EBF;&#x7A0B;&#x5BF9;&#x7ACB;<br>&#x6307;&#x65E0;&#x8BBA;&#x8C03;&#x7528;&#x7AEF;&#x662F;&#x5426;&#x91C7;&#x53D6;&#x4E86;&#x540C;&#x6B65;&#x63AA;&#x65BD;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#x5E76;&#x53D1;&#x4F7F;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x7ACB;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;Thread&#x7C7B;&#x7684;suspend()&#x548C;resumn()&#x65B9;&#x6CD5;&#xFF08;&#x5DF2;&#x88AB;JDK&#x58F0;&#x660E;&#x5E9F;&#x5F03;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x5E38;&#x89C1;&#x7684;&#x7EBF;&#x7A0B;&#x5BF9;&#x7ACB;&#x64CD;&#x4F5C;&#x8FD8;&#x6709;System.setIn(), System.setOut(), System.runFinalizersOnExit()&#x2026;</p>
<p>##2.2&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;</p>
<p>###&#x4E92;&#x65A5;&#x540C;&#x6B65;<br>Java&#x4E2D;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4E92;&#x65A5;&#x540C;&#x6B65;&#x624B;&#x6BB5;&#x5C31;&#x662F;synchronized&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<p>synchronized&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#xFF1A;Java&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x6620;&#x5C04;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x751F;&#x7EBF;&#x7A0B;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x963B;&#x585E;&#x6216;&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6765;&#x5E2E;&#x5FD9;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4ECE;&#x7528;&#x6237;&#x6001;&#x8F6C;&#x6362;&#x5230;&#x6838;&#x5FC3;&#x6001;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x9700;&#x8981;&#x6D88;&#x8017;&#x5F88;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x7684;&#x540C;&#x6B65;&#x5757;&#xFF08;&#x5982;synchronized&#x4FEE;&#x9970;&#x7684;getter()&#x548C;setter&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x53EF;&#x80FD;&#x6BD4;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x8FD8;&#x8981;&#x957F;&#x3002;</p>
<p>&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;java.util.concurrent&#x5305;&#x4E2D;&#x7684;<code>ReentrantLock(&#x91CD;&#x5165;&#x9501;)</code>&#x6765;&#x5B9E;&#x73B0;&#x540C;&#x6B65;&#xFF1A;JDK1.5&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;synchronized&#x7684;&#x541E;&#x5410;&#x91CF;&#x4E0B;&#x964D;&#x7684;&#x5F88;&#x4E25;&#x91CD;&#xFF0C;&#x800C;ReentrantLock&#x5219;&#x57FA;&#x672C;&#x4FDD;&#x6301;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#x3002;JDK 1.6&#x4E4B;&#x540E;&#x4E24;&#x8005;&#x6027;&#x80FD;&#x57FA;&#x672C;&#x6301;&#x5E73;&#x3002;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x5728;&#x672A;&#x6765;&#x7684;&#x6027;&#x80FD;&#x6539;&#x8FDB;&#x4E2D;&#x8FD8;&#x4F1A;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x539F;&#x751F;&#x7684;synchronize&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;<br>&#x63D0;&#x5021;&#x5728;synchronized&#x80FD;&#x5B9E;&#x73B0;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F18;&#x5148;&#x8003;&#x8651;&#x4F7F;&#x7528;synchronized&#x6765;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;</p>
<p>###&#x975E;&#x963B;&#x585E;&#x540C;&#x6B65;<br>&#x975E;&#x963B;&#x585E;&#x540C;&#x6B65;&#xFF1A;&#x4ECE;&#x5904;&#x7406;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E92;&#x65A5;&#x540C;&#x6B65;&#x5C5E;&#x4E8E;&#x4E00;&#x79CD;&#x60B2;&#x89C2;&#x7684;&#x5E76;&#x53D1;&#x7B56;&#x7565;&#x3002;&#x968F;&#x7740;&#x786C;&#x4EF6;&#x6307;&#x4EE4;&#x96C6;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x57FA;&#x4E8E;&#x51B2;&#x7A81;&#x68C0;&#x67E5;&#x7684;&#x4E50;&#x89C2;&#x5E76;&#x53D1;&#x7B56;&#x7565;&#xFF0C;&#x901A;&#x4FD7;&#x5730;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5148;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E89;&#x7528;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x64CD;&#x4F5C;&#x5C31;&#x6210;&#x529F;&#x4E86;&#xFF1B;&#x5982;&#x679C;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x6709;&#x4E89;&#x7528;&#xFF0C;&#x4EA7;&#x751F;&#x4E86;&#x51B2;&#x7A81;&#xFF0C;&#x90A3;&#x5C31;&#x518D;&#x91C7;&#x53D6;&#x5176;&#x4ED6;&#x7684;&#x8865;&#x507F;&#x63AA;&#x65BD;&#xFF08;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8865;&#x507F;&#x63AA;&#x65BD;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x5730;&#x91CD;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x6210;&#x529F;&#x4E3A;&#x6B62;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x4E50;&#x89C2;&#x7684;&#x5E76;&#x53D1;&#x7B56;&#x7565;&#x7684;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#x5076;&#x8BFB;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x7EBF;&#x7A0B;&#x6302;&#x8D77;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x8BDD;&#x603B;&#x540C;&#x6B65;&#x64CD;&#x4F5C;&#x79F0;&#x4E3A;&#x975E;&#x963B;&#x585E;&#x540C;&#x6B65;&#x3002;</p>
<p>###&#x65E0;&#x540C;&#x6B65;&#x65B9;&#x6848;<br>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x8BBE;&#x8BA1;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x5B83;&#x81EA;&#x7136;&#x5C31;&#x65E0;&#x987B;&#x4EFB;&#x4F55;&#x540C;&#x6B65;&#x63AA;&#x65BD;&#x53BB;&#x4FDD;&#x8BC1;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x5929;&#x751F;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;&#x8FD9;&#x7C7B;&#x4EE3;&#x7801;&#x5305;&#x62EC;&#xFF1A;&#x53EF;&#x91CD;&#x5165;&#x4EE3;&#x7801;&#x548C;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x3002;</p>
<p>#3&#x3001;&#x9501;&#x4F18;&#x5316;<br>&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x6539;&#x8FDB;&#x9AD8;&#x6548;&#x5E76;&#x53D1;&#xFF0C;HotSpot&#x865A;&#x62DF;&#x673A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5728;JDK1.6&#x7248;&#x672C;&#x4E0A;&#x82B1;&#x8D39;&#x4E86;&#x5927;&#x91CF;&#x7CBE;&#x529B;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x9501;&#x4F18;&#x5316;&#x3002;</p>
<p>##3.1&#x3001;&#x81EA;&#x65CB;&#x9501;&#x4E0E;&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;<br>&#x4E3A;&#x4E86;&#x8BA9;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x8BA9;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x5FD9;&#x5FAA;&#x73AF;&#xFF08;&#x81EA;&#x65CB;&#xFF09;&#xFF0C;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x81EA;&#x65CB;&#x9501;&#x3002;&#x5F15;&#x5165;&#x81EA;&#x65CB;&#x9501;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4E92;&#x65A5;&#x540C;&#x6B65;&#x5BF9;&#x6027;&#x80FD;&#x6700;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x662F;&#x963B;&#x585E;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x7BA1;&#x94B1;&#x7EBF;&#x7A0B;&#x548C;&#x6062;&#x590D;&#x7EBF;&#x7A0B;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x8F6C;&#x5165;&#x5185;&#x6838;&#x6001;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x7ED9;&#x5E76;&#x53D1;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x538B;&#x529B;&#x3002;&#x81EA;&#x65CB;&#x9501;&#x8BA9;&#x7269;&#x7406;&#x673A;&#x5668;&#x6709;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5904;&#x7406;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x8BA9;&#x4E24;&#x4E2A;&#x6216;&#x4EE5;&#x4E0A;&#x7684;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x5E76;&#x884C;&#x6267;&#x884C;&#x3002;</p>
<p>##3.2&#x3001;&#x9501;&#x6D88;&#x9664;<br>&#x6D88;&#x9664;&#x9501;&#x662F;&#x6307;&#x865A;&#x62DF;&#x673A;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x4E0A;&#x8981;&#x6C42;&#x540C;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x88AB;&#x68C0;&#x6D4B;&#x5230;&#x4E0D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7ADE;&#x4E89;&#x7684;&#x9501;&#x8FDB;&#x884C;&#x6D88;&#x9664;&#x3002;</p>
<p>##3.3&#x3001;&#x9501;&#x7C97;&#x5316;<br>&#x5982;&#x679C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8FDE;&#x7EED;&#x64CD;&#x4F5C;&#x90FD;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53CD;&#x590D;&#x52A0;&#x9501;&#x548C;&#x89E3;&#x9501;&#xFF0C;&#x751A;&#x81F3;&#x52A0;&#x9501;&#x64CD;&#x4F5C;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x5FAA;&#x73AF;&#x4F53;&#x4E2D;&#x7684;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x9501;&#x7C97;&#x5316;&#x7684;&#x4F18;&#x5316;&#x3002;</p>
<p>##3.4&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;<br>&#x5B83;&#x7684;&#x672C;&#x610F;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x591A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x51CF;&#x5C11;&#x4F20;&#x7EDF;&#x7684;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E92;&#x65A5;&#x91CF;&#x4EA7;&#x751F;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x5B58;&#x5728;&#x9501;&#x7ADE;&#x4E89;&#xFF0C;&#x9664;&#x4E86;&#x4E92;&#x65A5;&#x91CF;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x8FD8;&#x53D1;&#x751F;&#x4E86;CAS&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6709;&#x7ADE;&#x4E89;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x4F1A;&#x6BD4;&#x4F20;&#x7EDF;&#x7684;&#x91CD;&#x91CF;&#x7EA7;&#x9501;&#x66F4;&#x6162;&#x3002;</p>
<p>##3.5&#x3001;&#x504F;&#x5411;&#x9501;<br>&#x5982;&#x679C;&#x8BF4;&#x8F7B;&#x91CF;&#x7EA7;&#x9501;&#x662F;&#x5728;&#x65E0;&#x7ADE;&#x4E89;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x4E86;CAS&#x64CD;&#x4F5C;&#x53BB;&#x6D88;&#x9664;&#x540C;&#x6B65;&#x4F7F;&#x7528;&#x7684;&#x4E92;&#x65A5;&#x91CF;&#xFF0C;&#x90A3;&#x504F;&#x5411;&#x9501;&#x5C31;&#x662F;&#x5728;&#x65E0;&#x7ADE;&#x4E89;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x628A;&#x6574;&#x4E2A;&#x540C;&#x6B65;&#x90FD;&#x6D88;&#x9664;&#x6389;&#x4E86;&#xFF0C;&#x8FDE;CAS&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x505A;&#x4E86;&#x3002;</p>
<p>#4&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/"><span></span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <p>#Java&#x57FA;&#x7840;&#x77E5;&#x8BC6;</p>
<p>##HashMap &#x4E0E; ConcurrentHashMap<br>HashMap&#x7684;&#x6269;&#x5BB9;&#x673A;&#x5236;&#xFF0C;ConcurrentHashMap&#x7684;&#x539F;&#x7406;&#xFF1A;</p>
<blockquote>
<p><a href="HashMap&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x5206;&#x6790;" title="http://blog.csdn.net/luanlouis/article/details/41576373">HashMap&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x5206;&#x6790;</a><br>HashMap&#x9020;&#x6210;&#x7684;&#x6B7B;&#x9501;&#x95EE;&#x9898;<br><a href="ConcurrentHashMap&#x539F;&#x7406;&#x5206;&#x6790;" title="http://pengtyao.iteye.com/blog/1074271">ConcurrentHashMap&#x539F;&#x7406;&#x5206;&#x6790;</a></p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x65F6;&#x4F7F;&#x7528;HashMap&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x591A;&#x7EBF;&#x7A0B;&#x65F6;&#x7528;Hashtable&#x6765;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x3002;</p>
<p>HashMap&#x4F5C;&#x4E3A;&#x7F13;&#x5B58;&#x5BFC;&#x81F4;&#x7684;&#x601D;&#x7D22;&#x95EE;&#x9898;&#x5206;&#x6790;</p>
<p>##&#x5E8F;&#x5217;&#x5316;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF0C;&#x5E8F;&#x5217;&#x5316;id&#x4F1A;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x95EE;&#x9898;<br><a href="http://www.itzhai.com/javascript-design-patterns-notes-combined-mode.html#2&#x3001;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#xFF1A;" title="&#x5916;&#x89C2;&#x6A21;&#x5F0F;" target="_blank" rel="external">&#x5916;&#x89C2;&#x6A21;&#x5F0F;</a>&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="http://www.ibm.com/developerworks/cn/java/j-lo-serial/#major3" title="Java&#x5E8F;&#x5217;&#x5316;ID&#x95EE;&#x9898;" target="_blank" rel="external">Java&#x5E8F;&#x5217;&#x5316;ID&#x95EE;&#x9898;</a><br>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x7248;&#x672C;&#x5347;&#x7EA7;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5BF9;&#x8C61;&#x6539;&#x52A8;&#xFF0C;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x4E86;id&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5BA2;&#x6237;&#x7AEF;&#x89E3;&#x6790;&#x65E7;&#x7684;&#x5BF9;&#x8C61;&#x5C31;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x83B7;&#x53D6;&#x6700;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x5316;&#x6587;&#x4EF6;&#x3002;</p>
<p>##JDK&#x5E38;&#x7528;&#x5E93;&#xFF0C;JDK&#x6E90;&#x4EE3;&#x7801;</p>
<p>###Java IO&#x7C7B;&#x5E93;&#x7ED3;&#x6784;&#x56FE;&#xFF0C;&#x548C;&#x6240;&#x7528;&#x5230;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</p>
<p>##NIO</p>
<p>###&#x963B;&#x585E;&#x540E;&#x7684;&#x901A;&#x77E5;&#x673A;&#x5236;</p>
<p>##RuntimeException&#x4E0E;CheckedException<br><strong>checked exception</strong><br>checked exception&#x662F;&#x4ECE;java.lang.Exception&#x7C7B;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#xFF1B;<br>runtime exception&#x662F;&#x4ECE;java.lang.RuntimeException &#x6216;java.lang.Error&#x7C7B;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#xFF0C;RuntimeException&#x53C8;&#x7EE7;&#x627F;&#x81EA;Exception&#xFF1B;<br>checked exception&#x7528;&#x6765;&#x6307;&#x793A;&#x4E00;&#x79CD;&#x8C03;&#x7528;&#x65B9;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x7684;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF1B;    </p>
<p><strong>Runtime Exception</strong><br>&#x5728;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x58F0;&#x660E;&#x4F1A;&#x629B;&#x51FA;runtime exception&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x6355;&#x83B7;runtime exception&#xFF1B;<br>&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x662F;&#x5FC5;&#x987B;&#x58F0;&#x660E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x629B;&#x51FA;&#x7684;checked exception&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x6355;&#x83B7;&#x5B83;&#x7684;checked exception,&#x6216;&#x8005;throws&#x51FA;&#x53BB;&#xFF1B;<br>runtime exception&#x6307;&#x793A;&#x4E00;&#x79CD;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x8D27;&#x6062;&#x590D;&#x7684;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#xFF1B;    </p>
<p>#&#x53CD;&#x5C04; &#x52A8;&#x6001;&#x4EE3;&#x7406;<br><a href="http://yajie.iteye.com/blog/1186522" title="&#x770B;&#x770B;java&#x7684;&#x53CD;&#x5C04;&#x6548;&#x7387;" target="_blank" rel="external">&#x770B;&#x770B;java&#x7684;&#x53CD;&#x5C04;&#x6548;&#x7387;</a></p>
<hr>
<p>#Java&#x914D;&#x7F6E;&#x6587;&#x4EF6;</p>
<hr>
<h1 id="JVM&#x865A;&#x62DF;&#x673A;"><a href="#JVM&#x865A;&#x62DF;&#x673A;" class="headerlink" title="JVM&#x865A;&#x62DF;&#x673A;"></a>JVM&#x865A;&#x62DF;&#x673A;</h1><h2 id="&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;"><a href="#&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;" class="headerlink" title="&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;"></a>&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x7B14;&#x8BB0;</h2><ul>
<li><a href="http://www.itzhai.com/jvm-note-introduce-java.html" title="&#x8D70;&#x8FD1;Java" target="_blank" rel="external">&#x8D70;&#x8FD1;Java</a></li>
<li><p><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;Java&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5F02;&#x5E38;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;Java&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5F02;&#x5E38;&#xFF09;</a><br>  <a href="https://github.com/arthinking/java-code/blob/master/src/me/arthinking/memoryleaktest/HeapOOM.java" title="Java&#x5806;&#x6EA2;&#x51FA;" target="_blank" rel="external">Java&#x5806;&#x6EA2;&#x51FA;</a><br>  <a href="https://github.com/arthinking/java-code/tree/master/src/me/arthinking/memoryleaktest" title="more" target="_blank" rel="external">more</a><br>  &#x65B0;&#x751F;&#x4EE3;Minor GC&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="https://github.com/arthinking/java-code/blob/master/src/me/arthinking/code4jvmnote/C_3_5_Minor_GC.java" title="&#x70B9;&#x6211;" target="_blank" rel="external">&#x70B9;&#x6211;</a></p>
<blockquote>
<ol>
<li>&#x5206;&#x914D;allocation4&#x65F6;&#xFF0C;Eden&#x5DF2;&#x7ECF;&#x88AB;&#x5360;&#x7528;6MB&#xFF0C;&#x4E0D;&#x591F;&#x4E86;&#xFF08;&#x603B;&#x5171;8MB&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x6B21;Minor GC&#xFF1B;  </li>
<li>GC&#x671F;&#x95F4;&#x53D1;&#x73B0;&#x5DF2;&#x6709;&#x7684;3X2MB&#x5927;&#x5C0F;&#x5BF9;&#x8C61;&#x65E0;&#x6CD5;&#x5168;&#x90E8;&#x653E;&#x5165;Survivor&#x7A7A;&#x95F4;,&#x6240;&#x4EE5;&#x53EA;&#x597D;&#x901A;&#x8FC7;<a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-2-html.html#6.5&#x3001;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x62C5;&#x4FDD;" title="&#x5206;&#x914D;&#x62C5;&#x4FDD;&#x673A;&#x5236;" target="_blank" rel="external">&#x5206;&#x914D;&#x62C5;&#x4FDD;&#x673A;&#x5236;</a>&#x63D0;&#x524D;&#x8F6C;&#x79FB;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x53BB;&#x4E86;&#xFF1B;  </li>
<li>GC&#x7ED3;&#x675F;&#x540E;&#xFF0C;4MB&#x7684;allocation4&#x5BF9;&#x8C61;&#x88AB;&#x5206;&#x914D;&#x5230;Eden&#x4E2D;&#xFF0C;Survivor&#x7A7A;&#x95F2;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x5360;&#x7528;6MB    </li>
</ol>
</blockquote>
</li>
<li><p><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-2-html.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0E;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7B56;&#x7565;&#xFF09;</a>    </p>
</li>
<li><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-3.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4E0E;&#x6545;&#x969C;&#x5904;&#x7406;&#x5DE5;&#x5177;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4E0E;&#x6545;&#x969C;&#x5904;&#x7406;&#x5DE5;&#x5177;&#xFF09;</a>     </li>
</ul>
<p>&#x4E0B;&#x9762;&#x662F;Java&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x5206;&#x6790;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;<a href="http://www.itzhai.com/java-memory-leak-analyze.html" title="Java&#x4E2D;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x5206;&#x6790;" target="_blank" rel="external">Java&#x4E2D;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x5206;&#x6790;</a> </p>
<ul>
<li><a href="http://www.itzhai.com/jvm-note-automatic-memory-management-mechanism-4.html" title="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x8C03;&#x4F18;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x4E0E;&#x5B9E;&#x6218;&#xFF09;" target="_blank" rel="external">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF08;&#x8C03;&#x4F18;&#x6848;&#x4F8B;&#x5206;&#x6790;&#x4E0E;&#x5B9E;&#x6218;&#xFF09;</a> </li>
<li><a href="http://www.itzhai.com/the-class-file-structure.html" title="&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;" target="_blank" rel="external">&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x7C7B;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#xFF09;</a>     </li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x540C;&#x6B65;&#x6307;&#x4EE4;monitorenter&#x548C;monitorexit&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#x58F0;&#x660E;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x7528;&#x6765;&#x6267;&#x884C;monitorexit&#x6307;&#x4EE4;&#x3002;</p>
<ul>
<li><a href="http://www.itzhai.com/the-class-file-structure.html" title="&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;" target="_blank" rel="external">&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B50;&#x7CFB;&#x7EDF;&#xFF08;&#x865A;&#x62DF;&#x673A;&#x7C7B;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF09;</a>     </li>
</ul>
<p>&#x52A0;&#x8F7D; -&gt; (&#x9A8C;&#x8BC1; -&gt; &#x51C6;&#x5907; -&gt; <code>&#x89E3;&#x6790;</code>) -&gt; &#x521D;&#x59CB;&#x5316; -&gt; &#x4F7F;&#x7528; -&gt; &#x5378;&#x8F7D;<br>&#x5176;&#x4E2D;&#x89E3;&#x6790;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x5728;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x4E4B;&#x540E;&#x518D;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x4FBF;&#x652F;&#x6301;&#x8FD0;&#x884C;&#x65F6;&#x7ED1;&#x5B9A;&#xFF08;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x6216;&#x665A;&#x671F;&#x7ED1;&#x5B9A;&#xFF09;&#x3002;</p>
<p>JVM&#x4E2D;&#x4E25;&#x683C;&#x89C4;&#x5B9A;&#x6709;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E0B;&#x4E94;&#x4E2D;&#x60C5;&#x51B5;&#x5FC5;&#x987B;&#x5BF9;&#x7C7B;&#x8FDB;&#x884C;&#x201C;&#x521D;&#x59CB;&#x5316;&#x201D;&#xFF1A;<a href="http://" target="_blank" rel="external">detail</a>(&#x52A0;&#x8F7D;&#x3001;&#x9A8C;&#x8BC1;&#x3001;&#x51C6;&#x5907;&#x81EA;&#x7136;&#x9700;&#x8981;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x5F00;&#x59CB;)    </p>
<p>&#x8FD9;5&#x79CD;&#x573A;&#x666F;&#x79F0;&#x4E3A;&#x5BF9;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x4E3B;&#x52A8;&#x5F15;&#x7528;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x79F0;&#x4E3A;&#x88AB;&#x52A8;&#x5F15;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<blockquote>
<p>&#x901A;&#x8FC7;&#x5B50;&#x7C7B;&#x5F15;&#x7528;&#x7236;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x5B57;&#x6BB5;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x5B50;&#x7C7B;&#x521D;&#x59CB;&#x5316;</p>
<p>&#x901A;&#x8FC7;&#x6570;&#x7EC4;&#x5B9A;&#x4E49;&#x6765;&#x5F15;&#x7528;&#x7C7B;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x6B64;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;    </p>
<p>&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;    </p>
</blockquote>
<p>###JVM&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0E;GC&#x56DE;&#x6536;&#x673A;&#x5236;</p>
<p>###JVM&#x8C03;&#x4F18;&#x548C;&#x5E38;&#x7528;&#x5DE5;&#x5177;</p>
<p><strong>&#x5982;&#x4F55;dump&#x51FA;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x72B6;&#x6001;</strong><br>&#x4F7F;&#x7528;<a href="http://www.blogjava.net/jzone/articles/303979.html" title="jstack pid" target="_blank" rel="external">jstack pid</a>&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;<a href="http://segmentfault.com/blog/yexiaobai/1190000000615690" title="Thread Dumps&#x7684;&#x5206;&#x6790;" target="_blank" rel="external">Thread Dumps&#x7684;&#x5206;&#x6790;</a>    </p>
<p><strong><em>&#x7EBF;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF1A;</em></strong><br><code>Runnable</code>&#xFF1A;<br><code>Wait oncondition</code>&#xFF1A;<br><code>Waiting for monitor entry</code>&#xFF1A;<br><code>in Object.wait()</code>&#xFF1A;        </p>
<p><strong><em>&#x6848;&#x4F8B;</em></strong>&#xFF1A;<code>&#x6B7B;&#x9501;</code> &amp; <code>&#x70ED;&#x9501;</code><br>Java5&#x4E2D;&#x52A0;&#x5F3A;&#x4E86;&#x5806;&#x601D;&#x7D22;&#x7684;&#x76D1;&#x6D4B;&#x7EBF;&#x7A0B;Dump&#x4E2D;&#x79D1;&#x9662;&#x76F4;&#x63A5;&#x62A5;&#x544A;&#x51FA;Java&#x7EA7;&#x522B;&#x7684;&#x601D;&#x7D22;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5927;&#x91CF;&#x4F7F;&#x7528; synchronized&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x9002;&#x5F53;&#x7684;&#x4F7F;&#x7528;&#x4E86;&#x5B83;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#x5728;&#x4E34;&#x754C;&#x533A;&#x7684;&#x5165;&#x53E3;&#x7B49;&#x5F85;&#xFF0C;&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x5927;&#x5E45;&#x4E0B;&#x964D;&#x3002;&#x5982;&#x679C;&#x5728;&#x7EBF;&#x7A0B; DUMP&#x4E2D;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#xFF0C;&#x5E94;&#x8BE5;&#x5BA1;&#x67E5;&#x6E90;&#x7801;&#xFF0C;&#x6539;&#x8FDB;&#x7A0B;&#x5E8F;&#x3002;(&#x5F15;&#x7528;)</p>
</blockquote>
<p><strong>JVM&#x8C03;&#x4F18;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;</strong></p>
<p>##ClassLoader&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;String&#x7C7B;<br>&#x8BF4;&#x8BF4;ClassLoader&#x7684;&#x53CC;&#x4EB2;&#x4EE3;&#x7406;&#x673A;&#x5236;</p>
<p>##&#x4FEE;&#x6539;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5B9E;&#x73B0;&#x70ED;&#x90E8;&#x7F72;<br><a href="http://www.ibm.com/developerworks/cn/java/j-lo-hotdeploy/index.html" title="ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;" target="_blank" rel="external">ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;</a>&#x7684;&#x6D41;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x804C;&#x8D23;&#x94FE;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;ASM&#x4FEE;&#x6539;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x6BCF;&#x6B21;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x7528;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;Class&#x6587;&#x4EF6;&#x751F;&#x6210;&#x5B9E;&#x4F8B;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x70ED;&#x90E8;&#x7F72;&#xFF0C;&#x4F46;&#x662F;PermGen space&#x8FD8;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4EC5;&#x4EC5;&#x662F;&#x8BA9;&#x65B0;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x7528;&#x65B0;&#x7684;&#x903B;&#x8F91;&#xFF1B;<br><a href="http://my.oschina.net/heroShane/blog/198492" title="Tomcat" target="_blank" rel="external">Tomcat</a>&#x4E2D;&#x7684;&#x70ED;&#x90E8;&#x7F72;&#x5B9E;&#x73B0;&#x3002;</p>
<hr>
<p>#&#x6846;&#x67B6;&#x6E90;&#x7801;&#x76F8;&#x5173;</p>
<p>##&#x5E76;&#x53D1;&#x6846;&#x67B6;<br>&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x7528;&#x8FC7;&#x54EA;&#x4E9B;</p>
<p>##Spring</p>
<p>##OSGi&#x6846;&#x67B6;</p>
<p>###&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;bundle&#x4E2D;&#x52A0;&#x8F7D;&#x53E6;&#x4E00;&#x4E2A;bundle&#x7684;Class&#x5BF9;&#x8C61;</p>
<hr>
<p>#Java Web</p>
<p>##Servlet&#x4E0E;Filter&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x539F;&#x7406;&#xFF0C;&#x914D;&#x7F6E;</p>
<p>##Session&#x5171;&#x4EAB;&#x673A;&#x5236;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/cache/memcached/20141128_Memcached使用getMulti造成的性能问题/"><span>Memcached使用getMulti造成的性能问题</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/cache/memcached/20141128_Memcached使用getMulti造成的性能问题/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#xFF1A;&#x4F7F;&#x7528;<code>getMulti</code>&#x4E00;&#x6B21;&#x6027;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x6240;&#x6709;&#x624B;&#x673A;100&#x4E2A;key&#xFF0C;&#x8BF7;&#x6C42;&#x4E86;100&#x4E07;&#x6B21;&#xFF0C;&#x7CFB;&#x7EDF;&#x6700;&#x521D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;MC&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x968F;&#x7740;&#x8BBF;&#x95EE;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x8D1F;&#x8F7D;&#x52A0;&#x5927;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x51E0;&#x4E2A;MC&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x8D1F;&#x8F7D;&#x53CD;&#x800C;&#x66F4;&#x52A0;&#x5927;&#x4E86;&#x3002;</p>
<p>&#x539F;&#x56E0;&#x662F;&#x5F00;&#x59CB;&#x90A3;100&#x4E2A;key&#x5728;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x83B7;&#x53D6;&#xFF0C;&#x73B0;&#x5728;&#x5206;&#x4E0D;&#x5230;&#x4E86;&#x51E0;MC&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x670D;&#x52A1;&#x5668;&#x589E;&#x591A;&#x4E86;&#xFF0C;&#x800C;&#x5173;&#x952E;&#x6027;&#x7684;&#x56E0;&#x7D20;&#x662F;&#x6211;&#x4EEC;&#x7528;&#x5230;&#x7684;MC&#x5BA2;&#x6237;&#x7AEF;memcached-client&#xFF0C;&#x5176;&#x4E2D;&#x7684;AscIIClient&#x5982;&#x4E0B;&#xFF1A;    </p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">public</span> Map&lt;String, Object&gt; <span class="title">getMulti</span><span class="params">(String[] keys, Integer[] hashCodes, <span class="keyword">boolean</span> asString)</span></span><br><span class="line">  </span>{</span><br><span class="line">    <span class="keyword">if</span> ((keys == <span class="keyword">null</span>) || (keys.length == <span class="number">0</span>)) {</span><br><span class="line">      <span class="keyword">if</span> (log.isErrorEnabled())</span><br><span class="line">        log.error(<span class="string">&quot;missing keys for getMulti()&quot;</span>);</span><br><span class="line">      <span class="keyword">return</span> <span class="keyword">null</span>;</span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    Map cmdMap = <span class="keyword">new</span> HashMap();</span><br><span class="line">    String[] cleanKeys = <span class="keyword">new</span> String[keys.length];</span><br><span class="line">    <span class="keyword">for</span> (<span class="keyword">int</span> i = <span class="number">0</span>; i &lt; keys.length; i++) {</span><br><span class="line">      String key = keys[i];</span><br><span class="line">      <span class="keyword">if</span> (key == <span class="keyword">null</span>) {</span><br><span class="line">        <span class="keyword">if</span> (log.isErrorEnabled())</span><br><span class="line">          log.error(<span class="string">&quot;null key, so skipping&quot;</span>);</span><br><span class="line">      }</span><br><span class="line">      <span class="keyword">else</span></span><br><span class="line">      {</span><br><span class="line">        Integer hash = <span class="keyword">null</span>;</span><br><span class="line">        <span class="keyword">if</span> ((hashCodes != <span class="keyword">null</span>) &amp;&amp; (hashCodes.length &gt; i)) {</span><br><span class="line">          hash = hashCodes[i];</span><br><span class="line">        }</span><br><span class="line">        cleanKeys[i] = key;</span><br><span class="line">        <span class="keyword">try</span> {</span><br><span class="line">          cleanKeys[i] = sanitizeKey(key);</span><br><span class="line">        }</span><br><span class="line">        <span class="keyword">catch</span> (UnsupportedEncodingException e) {</span><br><span class="line">          <span class="keyword">if</span> (<span class="keyword">this</span>.errorHandler != <span class="keyword">null</span>)</span><br><span class="line">            <span class="keyword">this</span>.errorHandler.handleErrorOnGet(<span class="keyword">this</span>, e, key);</span><br><span class="line">          <span class="keyword">if</span> (log.isErrorEnabled())</span><br><span class="line">            log.error(<span class="string">&quot;failed to sanitize your key!&quot;</span>, e);</span><br><span class="line">          <span class="keyword">continue</span>;</span><br><span class="line">        }</span><br><span class="line"></span><br><span class="line">        SchoonerSockIO sock = <span class="keyword">this</span>.pool.getSock(cleanKeys[i], hash);</span><br><span class="line"></span><br><span class="line">        <span class="keyword">if</span> (sock == <span class="keyword">null</span>) {</span><br><span class="line">          <span class="keyword">if</span> (<span class="keyword">this</span>.errorHandler != <span class="keyword">null</span>) {</span><br><span class="line">            <span class="keyword">this</span>.errorHandler.handleErrorOnGet(<span class="keyword">this</span>, <span class="keyword">new</span> IOException(<span class="string">&quot;no socket to server available&quot;</span>), key);</span><br><span class="line">          }</span><br><span class="line">        }</span><br><span class="line">        <span class="keyword">else</span></span><br><span class="line">        {</span><br><span class="line">          <span class="keyword">if</span> (!cmdMap.containsKey(sock.getHost())) {</span><br><span class="line">            cmdMap.put(sock.getHost(), <span class="keyword">new</span> StringBuilder(<span class="string">&quot;get&quot;</span>));</span><br><span class="line">          }</span><br><span class="line">          ((StringBuilder)cmdMap.get(sock.getHost())).append(<span class="keyword">new</span> StringBuilder().append(<span class="string">&quot; &quot;</span>).append(cleanKeys[i]).toString());</span><br><span class="line"></span><br><span class="line">          sock.close();</span><br><span class="line">        }</span><br><span class="line">      }</span><br><span class="line">    }</span><br><span class="line">    <span class="keyword">if</span> (log.isDebugEnabled()) {</span><br><span class="line">      log.debug(<span class="keyword">new</span> StringBuilder().append(<span class="string">&quot;multi get socket count : &quot;</span>).append(cmdMap.size()).toString());</span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    Map ret = <span class="keyword">new</span> HashMap(keys.length);</span><br><span class="line"></span><br><span class="line">    <span class="keyword">new</span> NIOLoader(<span class="keyword">this</span>).doMulti(asString, cmdMap, keys, ret);</span><br><span class="line"></span><br><span class="line">    <span class="keyword">for</span> (<span class="keyword">int</span> i = <span class="number">0</span>; i &lt; keys.length; i++)</span><br><span class="line">    {</span><br><span class="line">      <span class="keyword">if</span> ((!keys[i].equals(cleanKeys[i])) &amp;&amp; (ret.containsKey(cleanKeys[i]))) {</span><br><span class="line">        ret.put(keys[i], ret.get(cleanKeys[i]));</span><br><span class="line">        ret.remove(cleanKeys[i]);</span><br><span class="line">      }</span><br><span class="line"></span><br><span class="line">    }</span><br><span class="line"></span><br><span class="line">    <span class="keyword">if</span> (log.isDebugEnabled())</span><br><span class="line">      log.debug(<span class="keyword">new</span> StringBuilder().append(<span class="string">&quot;++++ memcache: got back &quot;</span>).append(ret.size()).append(<span class="string">&quot; results&quot;</span>).toString());</span><br><span class="line">    <span class="keyword">return</span> ret;</span><br><span class="line">  }</span><br></pre></td></tr></table></figure>
<p>&#x8BF7;&#x6C42;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x662F;&#x4E32;&#x884C;&#x7684;&#xFF0C;&#x7ED3;&#x679C;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x7AEF;&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#x7D2F;&#x52A0;&#xFF0C;&#x8BF7;&#x6C42;&#x5806;&#x79EF;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#x3002;</p>
<h2 id="&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;"><a href="#&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;" class="headerlink" title="&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;"></a>&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;</h2><p>&#x4E00;&#x662F;&#x628A;&#x4E32;&#x884C;&#x8BF7;&#x6C42;&#x6539;&#x4E3A;&#x5E76;&#x884C;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;spymemcached&#x7684;&#x5E76;&#x884C;&#x5B9E;&#x73B0;&#xFF1A;    </p>
<ul>
<li>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x5C06;&#x672C;&#x6B21;&#x64CD;&#x4F5C;&#x6784;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A; node &#x7684; Operation &#x5BF9;&#x8C61;&#xFF0C;&#x52A0;&#x5165;&#x8FDE;&#x63A5;&#x5BF9;&#x8C61;&#x4E2D;&#xFF1B;    </li>
<li>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x5728;&#x8FDE;&#x63A5;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x7684; node &#x64CD;&#x4F5C;&#x653E;&#x5165; addedQueue &#x961F;&#x5217;&#xFF0C;&#x7136;&#x540E;&#x89E6;&#x53D1; Selector &#x65B9;&#x5F0F;&#x5F02;&#x6B65;&#x975E;&#x963B;&#x585E;&#x7684;&#x6267;&#x884C;&#xFF1B;</li>
</ul>
<p>&#x4E00;&#x662F;&#x628A;key&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x7684;&#x624B;&#x673A;&#x6563;&#x5217;&#x4E0D;&#x540C;&#x7684;MC&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8FBE;&#x5230;&#x8BF7;&#x6C42;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x7684;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6839;&#x636E;&#x5C31;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x573A;&#x666F;&#x6563;&#x5217;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x8F83;&#x4E0D;&#x597D;&#x5904;&#x7406;&#x3002;</p>
<p>&#x6216;&#x8005;&#x4E0D;&#x4F7F;&#x7528;getMulti&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E86;</p>
<p>&#x5FC5;&#x987B;&#x4F7F;&#x7528;getMulti&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x628A;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;memcache&#x96C6;&#x7FA4;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x8D1F;&#x8D23;&#x8BFB;&#x53D6;&#x4E00;&#x534A;&#x7684;keys&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4F1A;&#x5F15;&#x53D1;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;CPU&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><a href="http://www.cnblogs.com/zhengyun_ustc/p/multigethole.html" title="&#x65C1;&#x89C2;&#x8005;&#x7684;&#x535A;&#x5BA2;" target="_blank" rel="external">&#x65C1;&#x89C2;&#x8005;&#x7684;&#x535A;&#x5BA2;</a>&#x4E5F;&#x5206;&#x6790;&#x4E86;&#x8FD9;&#x7C7B;&#x5206;&#x6790;&#xFF0C;&#x5F88;&#x900F;&#x5F7B;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#x4E0B;</p>
<p>&#x8BE5;&#x535A;&#x6587;&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="http://www.itzhai.com/mc-use-getmulti-problem.html" target="_blank" rel="external">http://www.itzhai.com/mc-use-getmulti-problem.html</a></p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/Cache/">Cache</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/Memcached/">Memcached</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/server/resin/resin配置/"><span>Resin配置</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/server/resin/resin配置/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x5B89;&#x88C5;</p>
<p>##1.1&#x3001;&#x4E0A;&#x4F20;resin&#x7A0B;&#x5E8F;&#x5305;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">mkdir /home/mmt/soft</span><br><span class="line">#&#x5C06;resin-pro-3.1.12.tar.gz&#x7A0B;&#x5E8F;&#x4E0A;&#x4F20;&#x81F3;soft&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x89E3;&#x5305;&#xFF1A;</span><br><span class="line">tar zxvf resin-pro-3.1.12.tar.gz</span><br><span class="line">#&#x5C06;&#x89E3;&#x5305;&#x540E;&#x7684;&#x7A0B;&#x5E8F;copy&#x81F3;/usr/local&#x76EE;&#x5F55;&#x4E0B;&#xFF1A;</span><br><span class="line">cp -rf resin-pro-3.1.12 /usr/local</span><br><span class="line">#&#x5C06; resin-pro-3.1.12 &#x6539;&#x540D;&#x4E3A; resin</span><br><span class="line">mv /usr/local/resin-pro-3.1.12/ /usr/local/resin</span><br><span class="line">#&#x8FDB;&#x5165;/usr/local/resin/&#x76EE;&#x5F55;</span><br><span class="line">cd /usr/local/resin</span><br></pre></td></tr></table></figure></p>
<blockquote>
<p>&#x76F8;&#x5173;&#x8D44;&#x6E90;&#xFF1A;    </p>
<p><a href="http://blog.csdn.net/tegwy/article/details/8870873" title="ubuntu &#x7F16;&#x8BD1;&#x5E76;&#x5B89;&#x88C5;resin3.1.12+nginx1.2.6" target="_blank" rel="external">ubuntu &#x7F16;&#x8BD1;&#x5E76;&#x5B89;&#x88C5;resin3.1.12+nginx1.2.6</a></p>
</blockquote>
<p>##1.2&#x3001;&#x5B89;&#x88C5;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">./configure --with-java-home=/usr/lib/jvm/java/jdk1.6.0_26</span><br><span class="line">#&#x542F;&#x52A8;resin&#xFF0C;&#x770B;&#x662F;&#x5426;&#x5B89;&#x88C5;&#x6210;&#x529F;</span><br><span class="line">/usr/local/resin/bin/httpd.sh start</span><br><span class="line">#&#x5982;&#x679C;&#x80FD;&#x6B63;&#x5E38;&#x663E;&#x793A;&#x9875;&#x9762;&#x5219;&#x8868;&#x793A;&#x5B89;&#x88C5;&#x6210;&#x529F;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x5E76;&#x8BBE;&#x7F6E;&#x76F8;&#x5173;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E86;&#x3002;</span><br><span class="line">/usr/local/resin/bin/httpd.sh stop</span><br></pre></td></tr></table></figure></p>
<p>#2&#x3001;&#x914D;&#x7F6E;</p>
<p>##JVM&#x53C2;&#x6570;&#x8BBE;&#x7F6E;</p>
<p>&#x5728;resin/conf/resin.conf&#x4E2D;&#x7684;<jvm-arg>&#x6807;&#x7B7E;&#x4E2D;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x8FD9;&#x5C06;&#x662F;&#x542F;&#x52A8;JVM&#x7684;&#x521D;&#x59CB;&#x5316;&#x53C2;&#x6570;&#x3002;</jvm-arg></p>
<p>&#x5177;&#x4F53;&#x7684;&#x53C2;&#x6570;&#x673A;&#x5668;&#x4F5C;&#x7528;&#xFF1A;<br><figure class="highlight xml"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">&lt;!-- - JVM &#x53C2;&#x6570;&#x8BBE;&#x7F6E; --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Xms512 m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span></span><br><span class="line"><span class="comment">&lt;!--jvm &#x6700;&#x5C0F;&#x5185;&#x5B58;&#xFF0C;&#x4E5F;&#x662F;&#x542F;&#x52A8; resin&#x540E;&#x7684;&#x9ED8;&#x8BA4;&#x5185;&#x5B58;&#x5206;&#x914D;&#x503C;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Xmx512 m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span> <span class="comment">&lt;!-- make ms=mx to reduce GC times --&gt;</span></span><br><span class="line"><span class="comment">&lt;!--jvm&#x6700;&#x5927;&#x5185;&#x5B58;&#xFF0C;&#x5F53;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x8D85;&#x8FC7; Xms&#x5206;&#x914D;&#x7684;&#x503C;&#x4E4B;&#x540E;&#x4F1A;&#x81EA;&#x52A8;&#x5411;&#x8FD9;&#x4E2A;&#x6700;&#x5927;&#x503C;&#x63D0;&#x5347;&#xFF0C;&#x4E00;&#x822C;&#x914D;&#x7F6E;&#x6210;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#x76F8;&#x7B49;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x80FD;&#x591F;&#x964D;&#x4F4E; GC &#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x6309;&#x5B9E;&#x9645;&#x8FDB;&#x884C;&#x914D;&#x7F6E;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Xmn86m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span></span><br><span class="line"><span class="comment">&lt;!--&#x5185;&#x5B58;&#x5206;&#x914D;&#x589E;&#x91CF;&#xFF0C;&#x5F53;&#x5185;&#x5B58;&#x9700;&#x6C42;&#x8D85;&#x8FC7; Xms&#x503C;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x7B2C;&#x4E00;&#x6B21;&#x5206;&#x914D;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5B58;&#x503C;&#xFF0C;&#x4E00;&#x822C;&#x4E3A; Xmx&#x7684; 1/3-1/4 &#xFF1B;&#x5F00;&#x59CB;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5148;&#x5C4F;&#x853D;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x51FA;&#x73B0;OutOfMemory&#x7684;&#x65F6;&#x5019;&#x518D;&#x6253;&#x5F00;&#x4E5F;&#x53EF;&#x4EE5;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-XX:MaxNewSize=256m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-XX:PermSize=128m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-XX:MaxPermSize=256m<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span></span><br><span class="line"><span class="comment">&lt;!--&#x4EE5;&#x4E0A;&#x4E09;&#x9879;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x5C11; OutOfMemory &#x800C;&#x914D;&#x7F6E;&#x7684;&#xFF0C;</span><br><span class="line">&#x662F;&#x6BCF;&#x4E2A;java&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x6700;&#x591A;&#x80FD;&#x4E00;&#x6B21;&#x7533;&#x8BF7; jvm &#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x503C;&#xFF0C;</span><br><span class="line">&#x4EE5;&#x4E0A;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x57FA;&#x672C;&#x591F;&#x7528;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x51FA;OutOfMemory &#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x9002;&#x5F53;&#x8C03;&#x5927;&#xFF0C;</span><br><span class="line">&#x4F46;&#x4E0D;&#x80FD;&#x8D85;&#x8D8A; Xmx&#x7684;&#x503C;&#xFF1B;</span><br><span class="line">&#x5F00;&#x59CB;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5148;&#x5C4F;&#x853D;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x51FA;&#x73B0; OutOfMemory&#x7684;&#x65F6;&#x5019;&#x518D;&#x6253;&#x5F00;&#x4E5F;&#x53EF;&#x4EE5;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Xss256k<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span> <span class="comment">&lt;!-- jvm Stack config --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Djava.awt.headless=true<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span> <span class="comment">&lt;!--&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x9A8C;&#x8BC1;&#x7801;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Djava.net.preferIPv4Stack=true<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span> <span class="comment">&lt;!-- disable IPv6 --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">jvm-arg</span>&gt;</span>-Doracle.jdbc.V8Compatible=true<span class="tag">&lt;/<span class="name">jvm-arg</span>&gt;</span><span class="comment">&lt;!--&#x9488;&#x5BF9; oracle10&#x7684;&#x517C;&#x5BB9;&#x914D;&#x7F6E;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">watchdog-arg</span>&gt;</span>-Dcom.sun.management.jmxremote<span class="tag">&lt;/<span class="name">watchdog-arg</span>&gt;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">&lt;!-- &#x5F3A;&#x5236; resin &#x5F3A;&#x5236;&#x91CD;&#x542F;&#x65F6;&#x7684;&#x6700;&#x5C0F;&#x7A7A;&#x95F2;&#x5185;&#x5B58; --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">memory-free-min</span>&gt;</span>2M<span class="tag">&lt;/<span class="name">memory-free-min</span>&gt;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">&lt;!-- &#x6700;&#x5927;&#x7EBF;&#x7A0B;&#x6570;&#x91CF; --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">thread-max</span>&gt;</span>256<span class="tag">&lt;/<span class="name">thread-max</span>&gt;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">&lt;!-- &#x5957;&#x63A5;&#x5B57;&#x7B49;&#x5F85;&#x65F6;&#x95F4; --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">socket-timeout</span>&gt;</span>65s<span class="tag">&lt;/<span class="name">socket-timeout</span>&gt;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">&lt;!-- &#x914D;&#x7F6E; keepalive --&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">keepalive-max</span>&gt;</span>128<span class="tag">&lt;/<span class="name">keepalive-max</span>&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">keepalive-timeout</span>&gt;</span>15s<span class="tag">&lt;/<span class="name">keepalive-timeout</span>&gt;</span></span><br><span class="line">```   </span><br><span class="line"></span><br><span class="line">**&#x65E5;&#x5E38;&#x9047;&#x5230;&#x7684;OOM&#x548C;&#x9891;&#x7E41;&#x53D1;&#x751F;GC &#x60C5;&#x51B5;&#x5206;&#x6790;**</span><br><span class="line"></span><br><span class="line">* java.lang.OutOfMemoryError: Java heap space</span><br><span class="line">heap &#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#xFF0C;&#x53EF;&#x80FD;&#x662F; -Xmx &#x914D;&#x5F97;&#x8FC7;&#x5927;&#xFF0C;&#x6216;&#x8005;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x6216;&#x6CC4;&#x6F0F;</span><br><span class="line"></span><br><span class="line">* java.lang.OutOfMemoryError: PermGen space</span><br><span class="line">&#x6301;&#x4E45;&#x4EE3;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#xFF0C;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7CFB;&#x7EDF;&#x7C7B;&#x88AB;&#x52A0;&#x8F7D;&#x6216; jpa &#x7B49;&#x67B6;&#x6784;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#xFF0C;&#x9700;&#x8981;&#x589E;&#x52A0; Perm&#x7684;&#x5185;&#x5B58;&#x914D;&#x7F6E;</span><br><span class="line"></span><br><span class="line">* java.lang.OutOfMemoryError:unable to create native thread</span><br><span class="line"></span><br><span class="line">* &#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x4EE5;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x51CF;&#x5C11; max-threads &#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x589E;&#x52A0;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x6570;&#x91CF;</span><br><span class="line"></span><br><span class="line">&#x5728;&#x5B9E;&#x9645;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x4E1C;&#x897F;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x63D0;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4F18;&#x5316;&#x3002;</span><br><span class="line"></span><br><span class="line">```xml</span><br><span class="line"><span class="tag">&lt;<span class="name">thread-max</span>&gt;</span>512<span class="tag">&lt;/<span class="name">thread-max</span>&gt;</span></span><br><span class="line"><span class="comment">&lt;!--&#x6700;&#x5927;&#x7EBF;&#x7A0B;&#x6570;&#x5F71;&#x54CD; resin &#x7684;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x80FD;&#x529B;&#x4EE5;&#x53CA; java &#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x5360;&#x7528;--&gt;</span></span><br><span class="line"><span class="tag">&lt;<span class="name">keepalive-max</span>&gt;</span>128<span class="tag">&lt;/<span class="name">keepalive-max</span>&gt;</span></span><br><span class="line"><span class="comment">&lt;!--keepalive &#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#xFF0C;&#x5BF9;&#x7F51;&#x7EDC;&#x6027;&#x80FD;&#x6709;&#x5F71;&#x54CD;--&gt;</span></span><br></pre></td></tr></table></figure></p>
<p>###JVM&#x8C03;&#x4F18;&#x76F8;&#x5173;&#xFF1A;    </p>
<ul>
<li><a href="http://blog.csdn.net/tyrone1979/article/details/1274458" title="JVM&#x8C03;&#x4F18;" target="_blank" rel="external">JVM&#x8C03;&#x4F18;</a>    </li>
<li><a href="http://www.opendigest.org/article.php/450" title="resin&#x4F18;&#x5316;&#x7ECF;&#x9A8C;" target="_blank" rel="external">resin&#x4F18;&#x5316;&#x7ECF;&#x9A8C;</a>    </li>
<li><a href="http://www.caucho.com/resin-3.0/performance/jvm-tuning.xtp#garbage-collection" title="resin" target="_blank" rel="external">resin</a>    </li>
<li>js/html/css/jpg/gif &#x7B49;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x7531; nginx &#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x7531;nginx&#x4EE5;upstream&#x65B9;&#x5F0F;&#x4EE3;&#x7406;&#x5230;&#x540E;&#x7AEF;resin&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;resin &#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<p>Resin &#x53CA; jvm &#x4F18;&#x5316;&#xFF0C;&#x662F;&#x4E00;&#x9879;&#x57FA;&#x4E8E;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x4E0A;&#x8FDB;&#x884C;&#x4E00;&#x6BB5;&#x76F8;&#x5BF9;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x6D4B;&#x8BD5;&#x8FDB;&#x884C;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x6709;&#x5176;&#x81EA;&#x8EAB;&#x7279;&#x70B9;&#xFF0C;&#x53EA;&#x6709;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#x6765;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x624D;&#x80FD;&#x628A;&#x8BE5;&#x9879;&#x76EE;&#x914D;&#x7F6E;&#x5F97;&#x66F4;&#x597D; &#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x786C;&#x5957;&#x5230;&#x5176;&#x5B83;&#x9879;&#x76EE;&#x4E0A; &#x3002;</p>
<p><strong>&#x6D4B;&#x8BD5;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x91CF;</strong>    </p>
<p>&#x5148;&#x5C06;resin.conf&#x6587;&#x4EF6;&#x4E2D;&#x7684;thread-min&#xFF0C;thread-max&#xFF0C;thread-keepalive&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x7684;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x5206;&#x522B;&#x5199;&#x4E0A;&#xFF0C;1000&#xFF0C;3000&#xFF0C;1000&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x6839;&#x636E;&#x4F60;&#x7684;&#x673A;&#x5668;&#x60C5;&#x51B5;&#x548C;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x91CF;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x91CF;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x518D;&#x9002;&#x5F53;&#x653E;&#x5927;&#x3002;</p>
<p>&#x7136;&#x540E;&#x89C2;&#x5BDF;&#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x4E2D;&#x7684;java&#x7EBF;&#x7A0B;&#x53D8;&#x5316;&#x60C5;&#x51B5;&#xFF0C;&#x770B;&#x770B;&#x5230;&#x5E95;&#x662F;&#x7EBF;&#x7A0B;&#x8FBE;&#x5230;&#x591A;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;java&#x8FDB;&#x7A0B;&#x5F53;&#x6389;&#x7684;&#x3002;&#x6211;&#x7684;&#x662F;&#x5728;379&#x5DE6;&#x53F3;&#x5F53;&#x6389;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5C06;thread-min&#xFF0C;thread-max&#xFF0C;thread-keepalive&#x5206;&#x522B;&#x5199;&#x4E3A;150&#xFF0C;400&#xFF0C;300&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x5C06;&#x5F53;&#x6389;&#x7684;&#x65F6;&#x5019;&#x7684;&#x6700;&#x5927;&#x503C;&#x7A0D;&#x5FAE;&#x653E;&#x5927;&#x70B9;&#xFF0C;&#x4F5C;&#x4E3A;thread-max&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x7CFB;&#x7EDF;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x503C;&#x3002;&#x7136;&#x540E;&#x5176;&#x4ED6;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x6839;&#x636E;&#x60C5;&#x51B5;&#x8BBE;&#x7F6E;&#x4E00;&#x4E0B;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/应用服务器/">应用服务器</a>, <a href="/categories/应用服务器/Resin/">Resin</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/Resin/">Resin</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120601_JVM笔记 - 程序编译与代码优化（晚期（运行期）优化）/"><span>JVM笔记 - 程序编译与代码优化（晚期（运行期）优化）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120601_JVM笔记 - 程序编译与代码优化（晚期（运行期）优化）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x5E76;&#x4E0D;&#x662F;&#x865A;&#x62DF;&#x673A;&#x5FC5;&#x9700;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x63D0;&#x53CA;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x90FD;&#x662F;&#x6307; HotSpot &#x865A;&#x62DF;&#x673A;&#x5185;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4E5F;&#x662F;&#x7279;&#x6307; HotSpot &#x865A;&#x62DF;&#x673A;&#x3002;</p>
<p>#2&#x3001;HotSpot&#x865A;&#x62DF;&#x673A;&#x5185;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;</p>
<p>##2.1&#x3001;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7F16;&#x8BD1;&#x5668;<br>HotSpot &#x865A;&#x62DF;&#x673A;&#x4E2D;&#x5185;&#x7F6E;&#x4E86;&#x4E24;&#x4E2A;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5206;&#x522B;&#x79F0;&#x4E3A; Client Compiler &#x548C; Server   Compiler&#x3002;</p>
<p>HotSpot &#x865A;&#x62DF;&#x673A;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7248;&#x672C;&#x4E0E;&#x5BBF;&#x4E3B;&#x673A;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x6027;&#x80FD;&#x81EA;&#x52A8;&#x9009;&#x62E9;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201D;- client&#x201D; &#x6216;&#x201D;- server&#x201D; &#x53C2;&#x6570;&#x53BB;&#x5F3A;&#x5236;&#x6307;&#x5B9A;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x5728; Client &#x6A21;&#x5F0F;&#x6216; Server &#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x53C2;&#x6570;&#x201D;- Xint&#x201D; &#x5F3A;&#x5236;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x4E8E;&#x201C;&#x89E3;&#x91CA;&#x6A21;&#x5F0F;&#x201D;&#xFF08; Interpreted   Mode&#xFF09;&#x3002;</p>
<p>&#x53C2;&#x6570;&#x201D;- Xcomp&#x201D; &#x5F3A;&#x5236;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x4E8E;&#x201C;&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#x201D;&#xFF08; Compiled   Mode&#xFF09;&#xFF0C;&#x8FD9;&#x65F6;&#x5C06;&#x4F18;&#x5148;&#x91C7;&#x7528;&#x7F16;&#x8BD1;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x89E3;&#x91CA;&#x5668;&#x4ECD;&#x7136;&#x8981;&#x5728;&#x7F16;&#x8BD1;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4ECB;&#x5165;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x4E0E;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x4E4B;&#x95F4;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x5E73;&#x8861;&#xFF0C; HotSpot &#x865A;&#x62DF;&#x673A;&#x8FD8;&#x4F1A;&#x9010;&#x6E10;&#x542F;&#x7528;&#x5206;&#x5C42;&#x7F16;&#x8BD1;&#xFF08; Tiered Compilation&#xFF09;[ 4] &#x7684;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x5B9E;&#x65BD;&#x5206;&#x5C42;&#x7F16;&#x8BD1;&#x540E;&#xFF0C; Client   Compiler &#x548C; Server   Compiler &#x5C06;&#x4F1A;&#x540C;&#x65F6;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BB8;&#x591A;&#x4EE3;&#x7801;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x591A;&#x6B21;&#x7F16;&#x8BD1;&#xFF0C;&#x7528; Client   Compiler &#x83B7;&#x53D6;&#x66F4;&#x9AD8;&#x7684;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#xFF0C;&#x7528; Server   Compiler &#x6765;&#x83B7;&#x53D6;&#x66F4;&#x597D;&#x7684;&#x7F16;&#x8BD1;&#x8D28;&#x91CF;&#xFF0C;&#x5728;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x65E0;&#x987B;&#x518D;&#x627F;&#x62C5;&#x6536;&#x96C6;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x4FE1;&#x606F;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p>##2.2&#x3001;&#x7F16;&#x8BD1;&#x5BF9;&#x8C61;&#x4E0E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;<br>&#x201C;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x201D;&#x6709;&#x4E24;&#x7C7B;&#xFF0C;&#x5373;&#xFF1A;&#x88AB;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x88AB;&#x591A;&#x6B21;&#x6267;&#x884C;&#x7684;&#x5FAA;&#x73AF;&#x4F53;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x7F16;&#x8BD1;&#x65B9;&#x5F0F;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x53D1;&#x751F;&#x5728;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E4B;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5F62;&#x8C61;&#x5730;&#x79F0;&#x4E4B;&#x4E3A;&#x6808;&#x4E0A;&#x66FF;&#x6362;&#xFF08; On   Stack   Replacement&#xFF0C; &#x7B80;&#x79F0;&#x4E3A; OSR &#x7F16;&#x8BD1;&#xFF0C;&#x5373;&#x65B9;&#x6CD5;&#x6808;&#x5E27;&#x8FD8;&#x5728;&#x6808;&#x4E0A;&#xFF0C;&#x65B9;&#x6CD5;&#x5C31;&#x88AB;&#x66FF;&#x6362;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x5224;&#x65AD;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x662F;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x9700;&#x8981;&#x89E6;&#x53D1;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x884C;&#x4E3A;&#x79F0;&#x4E3A;&#x70ED;&#x70B9;&#x63A2;&#x6D4B;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x7684;&#x70ED;&#x70B9;&#x63A2;&#x6D4B;&#x5224;&#x5B9A;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF1A;&#x57FA;&#x4E8E;&#x91C7;&#x6837;&#x7684;&#x70ED;&#x70B9;&#x63A2;&#x6D4B;&#xFF0C;&#x57FA;&#x4E8E;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x70ED;&#x70B9;&#x63A2;&#x6D4B;&#x3002;</p>
<p>&#x5728; HotSpot &#x865A;&#x62DF;&#x673A;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7B2C;&#x4E8C;&#x79CD;&#x2014;&#x2014;&#x57FA;&#x4E8E;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x70ED;&#x70B9;&#x63A2;&#x6D4B;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x51C6;&#x5907;&#x4E86;&#x4E24;&#x7C7B;&#x8BA1;&#x6570;&#x5668;&#xFF1A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x8BA1;&#x6570;&#x5668;&#xFF08; Invocation   Counter&#xFF09; &#x548C;&#x56DE;&#x8FB9;&#x8BA1;&#x6570;&#x5668;&#xFF08; Back   Edge   Counter&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x8BA1;&#x6570;&#x5668;&#x8D85;&#x8FC7;&#x9608;&#x503C;&#x6EA2;&#x51FA;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x89E6;&#x53D1; JIT &#x7F16;&#x8BD1;&#x3002;</p>
<p>&#x5F53;&#x7F16;&#x8BD1;&#x5DE5;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x5165;&#x53E3;&#x5730;&#x5740;&#x5C31;&#x4F1A;&#x88AB;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x6539;&#x5199;&#x6210;&#x65B0;&#x7684;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x673A;&#x53C2;&#x6570;- XX:- UseCounterDecay &#x6765;&#x5173;&#x95ED;&#x70ED;&#x5EA6;&#x8870;&#x51CF;&#xFF0C;&#x8BA9;&#x65B9;&#x6CD5;&#x8BA1;&#x6570;&#x5668;&#x7EDF;&#x8BA1;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x7EDD;&#x5BF9;&#x6B21;&#x6570;&#x3002;</p>
<p>&#x4F7F;&#x7528;- XX: CounterHalfLifeTime &#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x534A;&#x8870;&#x5468;&#x671F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5355;&#x4F4D;&#x662F;&#x79D2;&#x3002;</p>
<p>&#x56DE;&#x8FB9;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x7EDF;&#x8BA1;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x5FAA;&#x73AF;&#x4F53;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x6B21;&#x6570;&#x3002;<br>&#x5EFA;&#x7ACB;&#x56DE;&#x8FB9;&#x8BA1;&#x6570;&#x5668;&#x7EDF;&#x8BA1;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E6;&#x53D1; OSR &#x7F16;&#x8BD1;&#x3002;<br>&#x53C2;&#x6570;- XX: OnStackReplacePercentage &#x6765;&#x95F4;&#x63A5;&#x8C03;&#x6574;&#x56DE;&#x8FB9;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x9608;&#x503C;&#x3002;</p>
<p>##2.3&#x3001;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;<br>&#x5728;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E0B;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4EA7;&#x751F;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD8;&#x662F; OSR &#x7F16;&#x8BD1;&#x8BF7;&#x6C42;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x5728;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x672A;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x90FD;&#x4ECD;&#x7136;&#x5C06;&#x6309;&#x7167;&#x89E3;&#x91CA;&#x65B9;&#x5F0F;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x7F16;&#x8BD1;&#x52A8;&#x4F5C;&#x5219;&#x5728;&#x540E;&#x53F0;&#x7684;&#x7F16;&#x8BD1;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570;- XX:- BackgroundCompilation &#x6765;&#x7981;&#x6B62;&#x540E;&#x53F0;&#x7F16;&#x8BD1;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; Client   Compiler &#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5FEB;&#x901F;&#x7684;&#x4E09;&#x6BB5;&#x5F0F;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x5728;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x800C;&#x653E;&#x5F03;&#x4E86;&#x8BB8;&#x591A;&#x8017;&#x65F6;&#x8F83;&#x957F;&#x7684;&#x5168;&#x5C40;&#x4F18;&#x5316;&#x624B;&#x6BB5;&#x3002;</p>
<p>&#x800C; Server Compiler &#x5219;&#x662F;&#x4E13;&#x95E8;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x5178;&#x578B;&#x5E94;&#x7528;&#x5E76;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x6027;&#x80FD;&#x914D;&#x7F6E;&#x7279;&#x522B;&#x8C03;&#x6574;&#x8FC7;&#x7684;&#x7F16;&#x8BD1;&#x5668;,&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x5206;&#x4F18;&#x5316;&#x8FC7;&#x7684;&#x9AD8;&#x7EA7;&#x7F16;&#x8BD1;&#x5668;,&#x51E0;&#x4E4E;&#x80FD;&#x8FBE;&#x5230; GNU C++&#x7F16;&#x8BD1;&#x5668;&#x4F7F;&#x7528;-O2&#x53C2;&#x6570;&#x65F6;&#x7684;&#x4F18;&#x5316;&#x5F3A;&#x5EA6;&#x3002;</p>
<p>##2.4&#x3001;&#x67E5;&#x770B;&#x53CA;&#x5206;&#x6790;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x7ED3;&#x679C;</p>
<p>#3&#x3001;&#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x6280;&#x672F;</p>
<p>##3.1&#x3001;&#x4F18;&#x5316;&#x6280;&#x672F;&#x6982;&#x89C8;<br>&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x4F18;&#x5316;&#x53D8;&#x6362;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4EE3;&#x7801;&#x7684;&#x67D0;&#x79CD;&#x4E2D;&#x95F4;&#x8868;&#x793A;&#x6216;&#x673A;&#x5668;&#x7801;&#x4E4B;&#x4E0A;&#xFF0C;&#x7EDD;&#x4E0D;&#x662F;&#x5EFA;&#x7ACB;&#x5728;Java&#x6E90;&#x7801;&#x4E4B;&#x4E0A;&#x7684;&#x3002;</p>
<p>##3.2&#x3001;&#x516C;&#x5171;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x6D88;&#x9664;</p>
<p>##3.3&#x3001;&#x6570;&#x7EC4;&#x8FB9;&#x754C;&#x68C0;&#x67E5;&#x6D88;&#x9664;<br>&#x9664;&#x4E86;&#x5982;&#x6570;&#x7EC4;&#x8FB9;&#x754C;&#x68C0;&#x67E5;&#x4F18;&#x5316;&#x8FD9;&#x79CD;&#x5C3D;&#x53EF;&#x80FD;&#x628A;&#x8FD0;&#x884C;&#x671F;&#x68C0;&#x67E5;&#x63D0;&#x5230;&#x7F16;&#x8BD1;&#x5668;&#x5B8C;&#x6210;&#x7684;&#x601D;&#x8DEF;&#x4E4B;&#x5916;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x907F;&#x514D;&#x601D;&#x8DEF;&#xFF1A;&#x9690;&#x5F0F;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5F53; foo &#x4E0D;&#x4E3A;&#x7A7A;&#x7684;&#x65F6;&#x5019;,&#x5BF9; value &#x7684;&#x8BBF;&#x95EE;&#x662F;&#x4E0D;&#x4F1A;&#x989D;&#x5916;&#x6D88;&#x8017;&#x4E00;&#x6B21;&#x5BF9; foo &#x5224;&#x7A7A;&#x7684;&#x5F00;&#x9500;&#x7684;&#x3002;&#x4EE3;&#x4EF7;&#x5C31;&#x662F;&#x5F53; foo &#x771F;&#x7684;&#x4E3A;&#x7A7A;&#x65F6;,&#x5FC5;&#x987B;&#x8F6C;&#x5165;&#x5230;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x6062;&#x590D;&#x5E76;&#x629B;&#x51FA; NullPointException&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5FC5;&#x987B;&#x4ECE;&#x7528;&#x6237;&#x6001;&#x8F6C;&#x52A8;&#x5185;&#x6838;&#x6001;&#x4E2D;&#x5904;&#x7406;&#xFF0C;&#x7ED3;&#x675F;&#x540E;&#x518D;&#x56DE;&#x5230;&#x7528;&#x6237;&#x6001;&#xFF0C;&#x901F;&#x5EA6;&#x8FDC;&#x6BD4;&#x4E00;&#x6B21;&#x5224;&#x7A7A;&#x68C0;&#x67E5;&#x6162;&#x3002;</p>
<p>##3.4&#x3001;&#x65B9;&#x6CD5;&#x5185;&#x8054;<br>&#x53EA;&#x6709;&#x4F7F;&#x7528;invokespecial&#x6307;&#x4EE4;&#x8C03;&#x7528;&#x7684;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x3001;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;&#x3001;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;invokestatic&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x7684;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x624D;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x7684;&#x3002;</p>
<p>##3.5&#x3001;&#x9003;&#x9038;&#x5206;&#x6790;<br>&#x9003;&#x9038;&#x5206;&#x6790;&#x7684;&#x57FA;&#x672C;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x5206;&#x6790;&#x5BF9;&#x8C61;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x9003;&#x9038;&#x51FA;&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#xFF0C;&#x90A3;&#x8BA9;&#x6574;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x5185;&#x5B58;&#x5C06;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x4E3B;&#x610F;&#xFF0C;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x5C31;&#x53EF;&#x4EE5;&#x968F;&#x6808;&#x5E27;&#x800C;&#x9500;&#x6BC1;&#x3002;&#x5728;&#x4E00;&#x822C;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4E0D;&#x4F1A;&#x9003;&#x9038;&#x7684;&#x5C40;&#x90E8;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x6BD4;&#x4F8B;&#x5F88;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x4F7F;&#x7528;&#x6808;&#x4E0A;&#x5206;&#x914D;&#xFF0C;&#x90A3;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#x5C31;&#x4F1A;&#x968F;&#x7740;&#x65B9;&#x6CD5;&#x7ED3;&#x675F;&#x800C;&#x81EA;&#x52A8;&#x9500;&#x6BC1;&#x4E86;&#xFF0C;&#x5783;&#x573E;&#x624B;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x538B;&#x529B;&#x5C06;&#x4F1A;&#x5C0F;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x540C;&#x6B65;&#x6D88;&#x9664;</p>
<p>&#x6807;&#x91CF;&#x66FF;&#x6362;</p>
<p>#4&#x3001;Java&#x4E0E;C/C++&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x6BD4;<br>&#x9664;&#x4E86;&#x5B83;&#x4EEC;&#x81EA;&#x8EAB;&#x7684;API&#x5E93;&#x5B9E;&#x73B0;&#x5F97;&#x597D;&#x574F;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x6BD4;&#x8F83;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x573A;&#x201C;&#x62FC;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#x548C;&#x201C;&#x62FC;&#x8F93;&#x51FA;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x201D;&#x7684;&#x6E38;&#x620F;&#x3002;</p>
<p>Java&#x865A;&#x62DF;&#x673A;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4E0E;C/C++&#x7684;&#x9759;&#x6001;&#x4F18;&#x5316;&#x7F16;&#x8BD1;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x7531;&#x4E8E;&#x4E0B;&#x5217;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x8F93;&#x51FA;&#x7684;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x6709;&#x4E00;&#x4E9B;&#x52A3;&#x52BF;&#xFF1A;<br>&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x8FD0;&#x884C;&#x5360;&#x7528;&#x7684;&#x662F;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;<br>Java&#x8BED;&#x8A00;&#x662F;&#x52A8;&#x6001;&#x7684;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x8BED;&#x8A00;<br>Java&#x8BED;&#x8A00;&#x4E2D;&#x867D;&#x7136;&#x6CA1;&#x6709;virtual&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x865A;&#x65B9;&#x6CD5;&#x7684;&#x9891;&#x7387;&#x5374;&#x8FDC;&#x8FDC;&#x5927;&#x4E8E;C/C++&#x8BED;&#x8A00;<br>Java&#x8BED;&#x8A00;&#x662F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x6269;&#x5C55;&#x7684;&#x8BED;&#x8A00;<br>Java&#x8BED;&#x8A00;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x90FD;&#x662F;&#x5728;&#x5806;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x624D;&#x80FD;&#x5728;&#x5806;&#x4E0A;&#x5206;&#x914D;</p>
<p>#5&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120501_JVM笔记 - 程序编译与代码优化（早期（编译器）优化）/"><span>JVM笔记 - 程序编译与代码优化（早期（编译器）优化）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120501_JVM笔记 - 程序编译与代码优化（早期（编译器）优化）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>Java&#x8BED;&#x8A00;&#x7684;&#x201C;&#x7F16;&#x8BD1;&#x671F;&#x201D;&#x662F;&#x4E00;&#x6BB5;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#xFF1A;    </p>
<ul>
<li>&#x524D;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF08;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x524D;&#x7AEF;&#xFF09;&#x628A;Java&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x4E3A;class&#x6587;&#x4EF6;&#xFF1B;Sun &#x7684; Javac&#x3001; Eclipse   JDT &#x4E2D;&#x7684;&#x589E;&#x91CF;&#x5F0F;&#x7F16;&#x8BD1;&#x5668;&#xFF08; ECJ&#xFF09;[ 1]&#x3002;</li>
<li>&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#xFF08;JIT&#x7F16;&#x8BD1;&#x671F; Just in time compiler&#xFF09;&#x628A;&#x5B57;&#x8282;&#x7801;&#x53D8;&#x6210;&#x673A;&#x5668;&#x7801;&#xFF1B;JIT &#x7F16;&#x8BD1;&#x5668;&#xFF1A; HotSpot   VM &#x7684; C1&#x3001; C2 &#x7F16;&#x8BD1;&#x5668;&#x3002;</li>
<li>&#x9759;&#x6001;&#x7F16;&#x8BD1;&#x5668;&#xFF08;AOT&#x7F16;&#x8BD1;&#x5668; ahead of time compiler&#xFF09;&#x76F4;&#x63A5;&#x628A;Java&#x7F16;&#x8BD1;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x4EE3;&#x7801;&#xFF1B;</li>
<li>AOT &#x7F16;&#x8BD1;&#x5668;&#xFF1A; GNU   Compiler   for   the   Java&#xFF08; GCJ&#xFF09;[ 2]&#x3001; Excelsior JET[ 3]&#x3002;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7B2C;&#x4E00;&#x7C7B;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>Javac &#x8FD9;&#x7C7B;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F18;&#x5316;&#x63AA;&#x65BD;&#xFF08;&#x5728; JDK   1. 3 &#x4E4B;&#x540E;&#xFF0C; Javac &#x7684;- O &#x4F18;&#x5316;&#x53C2;&#x6570;&#x5C31;&#x4E0D;&#x518D;&#x6709;&#x610F;&#x4E49;&#xFF09;&#x3002;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x8BA1;&#x56E2;&#x961F;&#x628A;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x4F18;&#x5316;&#x96C6;&#x4E2D;&#x5230;&#x4E86;&#x540E;&#x7AEF;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x4E2D;&#x3002;</p>
<p>#2&#x3001;Javac&#x7F16;&#x8BD1;&#x5668;<br>&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7531; Java &#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E3A;&#x7EAF; Java &#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x4FBF;&#x5229;&#x3002;</p>
<p>##2.1&#x3001;Javac&#x7684;&#x6E90;&#x7801;&#x4E0E;&#x8C03;&#x8BD5;</p>
<p>##2.2&#x3001;&#x89E3;&#x6790;&#x4E0E;&#x586B;&#x5145;&#x7B26;&#x53F7;&#x8868;</p>
<p>##2.3&#x3001;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;<br>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7EC4;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x7684;&#x6807;&#x51C6; API &#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x5BF9;&#x6CE8;&#x89E3;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x7F16;&#x8BD1;&#x5668;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x7684;&#x6807;&#x51C6; API &#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x5E72;&#x6D89;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x7531;&#x4E8E;&#x8BED;&#x6CD5;&#x6811;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x5143;&#x7D20;&#xFF0C;&#x751A;&#x81F3;&#x5305;&#x62EC;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x63D2;&#x4EF6;&#x4E4B;&#x4E2D;&#x8BBF;&#x95EE;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x63D2;&#x4EF6;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x53D1;&#x6325;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728; Javac &#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#x7684;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x7A0B;&#x662F;&#x5728; initPorcessAnnotations() &#x65B9;&#x6CD5;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x5B83;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5219;&#x662F;&#x5728;processAnnotations() &#x65B9;&#x6CD5;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<p>##2.4&#x3001;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x4E0E;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;<br>&#x7F16;&#x8BD1;&#x5668;&#x83B7;&#x5F97;&#x4E86;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x8868;&#x793A;&#xFF0C;&#x8BED;&#x6CD5;&#x6811;&#x80FD;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x6B63;&#x786E;&#x7684;&#x6E90;&#x7A0B;&#x5E8F;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x6E90;&#x7A0B;&#x5E8F;&#x662F;&#x7B26;&#x5408;&#x903B;&#x8F91;&#x7684;&#x3002;&#x800C;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x5BF9;&#x7ED3;&#x6784;&#x4E0A;&#x6B63;&#x786E;&#x7684;&#x6E90;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x6709;&#x5173;&#x6027;&#x8D28;&#x7684;&#x5BA1;&#x67E5;&#xFF0C;&#x5982;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x5BA1;&#x67E5;&#x3002;</p>
<p>&#x662F;&#x5426;&#x5408;&#x4E4E;&#x8BED;&#x4E49;&#x903B;&#x8F91;&#x5FC5;&#x987B;&#x9650;&#x5B9A;&#x5728;&#x5177;&#x4F53;&#x7684;&#x8BED;&#x8A00;&#x4E0E;&#x5177;&#x4F53;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4E4B;&#x4E2D;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;</p>
<blockquote>
<p>&#x6807;&#x6CE8;&#x68C0;&#x67E5; Javac &#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
</blockquote>
<p>&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x6B65;&#x9AA4;&#x68C0;&#x67E5;&#x7684;&#x5185;&#x5BB9;&#x5305;&#x62EC;&#x8BF8;&#x5982;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x524D;&#x662F;&#x5426;&#x5DF2;&#x88AB;&#x58F0;&#x660E;&#x3001;&#x53D8;&#x91CF;&#x4E0E;&#x8D4B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x80FD;&#x591F;&#x5339;&#x914D;&#x7B49;&#x3002;&#x5728;&#x6807;&#x6CE8;&#x68C0;&#x67E5;&#x6B65;&#x9AA4;&#x4E2D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x52A8;&#x4F5C;&#x79F0;&#x4E3A;&#x5E38;&#x91CF;&#x6298;&#x53E0;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x8FDB;&#x884C;&#x4E86;&#x5E38;&#x91CF;&#x6298;&#x53E0;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x5B9A;&#x4E49;&#x201D; a= 1+ 2&#x201D; &#x6BD4;&#x8D77;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x201D; a= 3&#x201D;&#xFF0C; &#x5E76;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x54EA;&#x6015;&#x4EC5;&#x4EC5;&#x4E00;&#x4E2A; CPU &#x6307;&#x4EE4;&#x7684;&#x8FD0;&#x7B97;&#x91CF;&#x3002;</p>
<blockquote>
<p>&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;</p>
</blockquote>
<p>&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;&#x662F;&#x5BF9;&#x7A0B;&#x5E8F;&#x4E0A;&#x4E0B;&#x6587;&#x903B;&#x8F91;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x51FA;&#x8BF8;&#x5982;&#x7A0B;&#x5E8F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x524D;&#x662F;&#x5426;&#x6709;&#x8D4B;&#x503C;&#x3001;&#x65B9;&#x6CD5;&#x7684;&#x6BCF;&#x6761;&#x8DEF;&#x5F84;&#x662F;&#x5426;&#x90FD;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x3001;&#x662F;&#x5426;&#x6240;&#x6709;&#x7684;&#x53D7;&#x67E5;&#x5F02;&#x5E38;&#x90FD;&#x88AB;&#x6B63;&#x786E;&#x5904;&#x7406;&#x4E86;&#x7B49;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C06;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A; final&#xFF0C; &#x5BF9;&#x8FD0;&#x884C;&#x671F;&#x662F;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x4EC5;&#x4EC5;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x95F4;&#x4FDD;&#x969C;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E0E;&#x5B57;&#x6BB5;&#xFF08;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3001;&#x7C7B;&#x53D8;&#x91CF;&#xFF09;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x5B83;&#x5728;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x6CA1;&#x6709; CONSTANT<em> Fieldref</em> info &#x7684;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x6CA1;&#x6709;&#x8BBF;&#x95EE;&#x6807;&#x5FD7;&#xFF08; Access_ Flags&#xFF09; &#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<p>&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;</p>
</blockquote>
<p>&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x8FD8;&#x539F;&#x56DE;&#x7B80;&#x5355;&#x7684;&#x57FA;&#x7840;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;&#x3002;</p>
<p>&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x8FC7;&#x7A0B;&#x7531; desugar() &#x65B9;&#x6CD5;&#x89E6;&#x53D1;&#x3002;</p>
<blockquote>
<p>&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;</p>
</blockquote>
<p>&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x662F; Javac &#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;</p>
<p>&#x628A;&#x524D;&#x9762;&#x5404;&#x4E2A;&#x6B65;&#x9AA4;&#x6240;&#x751F;&#x6210;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x8BED;&#x6CD5;&#x6811;&#x3001;&#x7B26;&#x53F7;&#x8868;&#xFF09;&#x8F6C;&#x5316;&#x6210;&#x5B57;&#x8282;&#x7801;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x4E2D;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x8FDB;&#x884C;&#x4E86;&#x5C11;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x548C;&#x8F6C;&#x6362;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x4E2D;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x7684;&#x5B9E;&#x4F8B;&#x6784;&#x9020;&#x5668;&#xFF1C; init &#xFF1E;()&#x65B9;&#x6CD5;&#x548C;&#x7C7B;&#x6784;&#x9020;&#x5668;&#xFF1C; clinit &#xFF1E;()&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6DFB;&#x52A0;&#x5230;&#x8BED;&#x6CD5;&#x6811;&#x4E4B;&#x4E2D;&#x7684;</p>
<p>&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x66FF;&#x6362;&#x5DE5;&#x4F5C;&#x7528;&#x4E8E;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x7684;&#x5B9E;&#x73B0;&#x903B;&#x8F91;&#xFF0C;&#x5982;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x52A0;&#x64CD;&#x4F5C;&#x66FF;&#x6362;&#x4E3A; StringBuffer &#x6216; StringBuilder&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x4E86;&#x5BF9;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x904D;&#x5386;&#x548C;&#x8C03;&#x6574;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x628A;&#x586B;&#x5145;&#x4E86;&#x6240;&#x6709;&#x6240;&#x9700;&#x4FE1;&#x606F;&#x7684;&#x7B26;&#x53F7;&#x8868;&#x4EA4;&#x7ED9; com. sun. tools. javac. jvm. ClassWriter &#x7C7B;&#xFF0C;&#x7531;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684; writeClass() &#x65B9;&#x6CD5;&#x8F93;&#x51FA;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x751F;&#x6210;&#x6700;&#x7EC8;&#x7684; Class &#x6587;&#x4EF6;&#xFF0C;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x6574;&#x4E2A;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x5BA3;&#x544A;&#x7ED3;&#x675F;&#x3002;</p>
<p>#3&#x3001;Java&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x5473;&#x9053;</p>
<p>##3.1&#x3001;&#x6CDB;&#x578B;&#x4E0E;&#x7C7B;&#x578B;&#x64E6;&#x9664;<br>Java &#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x5219;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x53EA;&#x5728;&#x7A0B;&#x5E8F;&#x6E90;&#x7801;&#x4E2D;&#x5B58;&#x5728;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x5B57;&#x8282;&#x7801;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x66FF;&#x6362;&#x4E3A;&#x539F;&#x6765;&#x7684;&#x539F;&#x751F;&#x7C7B;&#x578B;&#xFF08; Raw   Type&#xFF0C; &#x4E5F;&#x79F0;&#x4E3A;&#x88F8;&#x7C7B;&#x578B;&#xFF09;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x76F8;&#x5E94;&#x7684;&#x5730;&#x65B9;&#x63D2;&#x5165;&#x4E86;&#x5F3A;&#x5236;&#x8F6C;&#x578B;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x64E6;&#x9664;&#x6210;&#x76F8;&#x540C;&#x7684;&#x539F;&#x751F;&#x7C7B;&#x578B;&#x53EA;&#x662F;&#x65E0;&#x6CD5;&#x91CD;&#x8F7D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x91CD;&#x8F7D;&#x8981;&#x6C42;&#x65B9;&#x6CD5;&#x5177;&#x5907;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#x4E4B;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x53C2;&#x4E0E;&#x91CD;&#x8F7D;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x662F;&#x5728; Class &#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x4E4B;&#x4E2D;&#xFF0C;&#x53EA;&#x8981;&#x63CF;&#x8FF0;&#x7B26;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x5171;&#x5B58;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5982;&#x679C;&#x6709;&#x76F8;&#x540C;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7279;&#x5F81;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x5B83;&#x4EEC;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5408;&#x6CD5;&#x5730;&#x5171;&#x5B58;&#x4E8E;&#x4E00;&#x4E2A; Class &#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x3002;</p>
<p>link</p>
<p>Signature&#x3001; LocalVariableTypeTable &#x7B49;&#x65B0;&#x7684;&#x5C5E;&#x6027;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x4F34;&#x968F;&#x6CDB;&#x578B;&#x800C;&#x6765;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x8BC6;&#x522B;&#x95EE;&#x9898;&#xFF0C; Signature &#x662F;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x9879;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x5B57;&#x8282;&#x7801;&#x5C42;&#x9762;&#x7684;&#x7279;&#x5F81;&#x7B7E;&#x540D;[ 3]&#xFF0C; &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5E76;&#x4E0D;&#x662F;&#x539F;&#x751F;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x662F;&#x5305;&#x62EC;&#x4E86;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x7531;&#x4E8E; List &#xFF1C; String &#xFF1E;&#x548C; List &#xFF1C; Integer &#xFF1E;&#x64E6;&#x9664;&#x540E;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x6DFB;&#x52A0;&#x4E24;&#x4E2A;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x91CD;&#x8F7D;&#x3002;</p>
<p>&#x64E6;&#x9664;&#x6CD5;&#x6240;&#x8C13;&#x7684;&#x64E6;&#x9664;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5BF9;&#x65B9;&#x6CD5;&#x7684; Code &#x5C5E;&#x6027;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x7801;&#x8FDB;&#x884C;&#x64E6;&#x9664;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x8FD8;&#x662F;&#x4FDD;&#x7559;&#x4E86;&#x6CDB;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x624B;&#x6BB5;&#x53D6;&#x5F97;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#x7684;&#x6839;&#x672C;&#x4F9D;&#x636E;&#x3002;</p>
<p>##3.2&#x3001;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x3001;&#x62C6;&#x7BB1;&#x4E0E;&#x904D;&#x5386;&#x5FAA;&#x73AF;<br>&#x904D;&#x5386;&#x5FAA;&#x73AF;&#x5219;&#x628A;&#x4EE3;&#x7801;&#x8FD8;&#x539F;&#x6210;&#x4E86;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4F55;&#x904D;&#x5386;&#x5FAA;&#x73AF;&#x9700;&#x8981;&#x88AB;&#x904D;&#x5386;&#x7684;&#x7C7B;&#x5B9E;&#x73B0; Iterable &#x63A5;&#x53E3;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5305;&#x88C5;&#x7C7B;&#x7684;&#x201C;==&#x201D;&#x8FD0;&#x7B97;&#x5728;&#x4E0D;&#x9047;&#x5230;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x62C6;&#x7BB1;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC; equals() &#x65B9;&#x6CD5;&#x4E0D;&#x5904;&#x7406;&#x6570;&#x636E;&#x8F6C;&#x578B;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7B14;&#x8005;&#x5EFA;&#x8BAE;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7801;&#x4E2D;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x4E0E;&#x62C6;&#x7BB1;&#x3002;</p>
<p>##3.3&#x3001;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;<br>Java &#x8BED;&#x8A00;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;&#xFF0C;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x6761;&#x4EF6;&#x4E3A;&#x5E38;&#x91CF;&#x7684; if &#x8BED;&#x53E5;&#x3002;</p>
<p>#4&#x3001;&#x5B9E;&#x6218;&#xFF1A;&#x63D2;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;</p>
<p>##4.1&#x3001;&#x5B9E;&#x6218;&#x76EE;&#x6807;</p>
<p>##4.2&#x3001;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;<br>&#x8981;&#x901A;&#x8FC7;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668; API &#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x63D2;&#x4EF6;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8FD9;&#x7EC4; API &#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x5728; JDK   1. 6 &#x65B0;&#x589E;&#x7684; javax. lang. model &#x5305;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86; 16 &#x7C7B; Element&#xFF0C; &#x5305;&#x62EC;&#x4E86; Java &#x4EE3;&#x7801;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#xFF1A;&#x201C;&#x5305;&#xFF08; PACKAGE&#xFF09;&#x3001; &#x679A;&#x4E3E;&#xFF08; ENUM&#xFF09;&#x3001; &#x7C7B;&#xFF08; CLASS&#xFF09;&#x3001; &#x6CE8;&#x89E3;&#xFF08; ANNOTATION<em> TYPE&#xFF09;&#x3001; &#x63A5;&#x53E3;&#xFF08; INTERFACE&#xFF09;&#x3001; &#x679A;&#x4E3E;&#x503C;&#xFF08; ENUM</em> CONSTANT&#xFF09;&#x3001; &#x5B57;&#x6BB5;&#xFF08; FIELD&#xFF09;&#x3001; &#x53C2;&#x6570;&#xFF08; PARAMETER&#xFF09;&#x3001; &#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF08; LOCAL<em> VARIABLE&#xFF09;&#x3001; &#x5F02;&#x5E38;&#xFF08; EXCEPTION</em> PARAMETER&#xFF09;&#x3001; &#x65B9;&#x6CD5;&#xFF08; METHOD&#xFF09;&#x3001; &#x6784;&#x9020;&#x51FD;&#x6570;&#xFF08; CONSTRUCTOR&#xFF09;&#x3001; &#x9759;&#x6001;&#x8BED;&#x53E5;&#x5757;&#xFF08; STATIC<em> INIT&#xFF0C; &#x5373; static{} &#x5757;&#xFF09;&#x3001;&#x5B9E;&#x4F8B;&#x8BED;&#x53E5;&#x5757;&#xFF08; INSTANCE</em> INIT&#xFF0C; &#x5373;{}&#x5757;&#xFF09;&#x3001;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#xFF08; TYPE_ PARAMETER&#xFF0C; &#x65E2;&#x6CDB;&#x578B;&#x5C16;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#x548C;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x5176;&#x4ED6;&#x8BED;&#x6CD5;&#x6811;&#x8282;&#x70B9;&#xFF08; OTHER&#xFF09;&#x201D;&#x3002;</p>
<p>##4.3&#x3001;&#x8FD0;&#x884C;&#x4E0E;&#x6D4B;&#x8BD5;</p>
<p>##4.4&#x3001;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x6848;&#x4F8B;<br>NameCheckProcessor &#x7684;&#x5B9E;&#x6218;&#x4F8B;&#x5B50;&#x53EA;&#x6F14;&#x793A;&#x4E86; JSR- 269 &#x5D4C;&#x5165;&#x5F0F;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668; API &#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529F;&#x80FD;&#xFF0C;&#x57FA;&#x4E8E;&#x8FD9;&#x7EC4; API &#x652F;&#x6301;&#x7684;&#x9879;&#x76EE;&#x8FD8;&#x6709;&#x7528;&#x4E8E;&#x6821;&#x9A8C; Hibernate &#x6807;&#x7B7E;&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x6027;&#x7684; Hibernate   Validator   Annotation Processor[ 1]&#xFF08; &#x672C;&#x8D28;&#x4E0A;&#x4E0E; NameCheckProcessor &#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5DEE;&#x4E0D;&#x591A;&#xFF09;&#x3001;&#x81EA;&#x52A8;&#x4E3A;&#x5B57;&#x6BB5;&#x751F;&#x6210; getter &#x548C; setter &#x65B9;&#x6CD5;&#x7684; Project   Lombok[ 2]&#xFF08; &#x6839;&#x636E;&#x5DF2;&#x6709;&#x5143;&#x7D20;&#x751F;&#x6210;&#x65B0;&#x7684;&#x8BED;&#x6CD5;&#x6811;&#x5143;&#x7D20;&#xFF09;&#x7B49;&#x3002;</p>
<p>#5&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;<br>&#x4E4B;&#x6240;&#x4EE5;&#x628A; Javac &#x8FD9;&#x7C7B;&#x5C06; Java &#x4EE3;&#x7801;&#x8F6C;&#x53D8;&#x4E3A;&#x5B57;&#x8282;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x79F0;&#x505A;&#x201C;&#x524D;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x5B8C;&#x6210;&#x4E86;&#x4ECE;&#x7A0B;&#x5E8F;&#x5230;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x6216;&#x4E2D;&#x95F4;&#x5B57;&#x8282;&#x7801;&#x7684;&#x751F;&#x6210;&#xFF0C;&#x800C;&#x5728;&#x6B64;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x7EC4;&#x5185;&#x7F6E;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x7684;&#x201C;&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x201D;&#x5B8C;&#x6210;&#x4E86;&#x4ECE;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5373;&#x524D;&#x9762;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x7684;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x6216; JIT &#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x53CA;&#x7F16;&#x8BD1;&#x7ED3;&#x679C;&#x7684;&#x4F18;&#x52A3;&#xFF0C;&#x662F;&#x8861;&#x91CF;&#x865A;&#x62DF;&#x673A;&#x6027;&#x80FD;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x6307;&#x6807;&#x3002;</p>
<blockquote>
<p>Javac(Java&#x5728;&#x7F16;&#x8BD1;&#x65F6;)&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;</p>
<pre><code>1&#x3001;&#x89E3;&#x6790;&#x4E0E;&#x586B;&#x5145;&#x7B26;&#x53F7;&#x8868;&#xFF1B;    
2&#x3001;&#x6CE8;&#x89E3;&#x5904;&#x7406;&#x5668;&#xFF1B;    
3&#x3001;&#x8BED;&#x4E49;&#x5206;&#x6790;&#x4E0E;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#xFF1A;    
    3.1&#x3001;&#x6807;&#x6CE8;&#x68C0;&#x67E5;    
    3.2&#x3001;&#x6570;&#x636E;&#x53CA;&#x63A7;&#x5236;&#x6D41;&#x5206;&#x6790;    
    3.3&#x3001;&#x89E3;&#x8BED;&#x6CD5;&#x7CD6;    
        3.3.1&#x3001;&#x6CDB;&#x578B;&#x4E0E;&#x7C7B;&#x578B;&#x64E6;&#x9664;    
        3.3.2&#x3001;&#x81EA;&#x52A8;&#x88C5;&#x7BB1;&#x3001;&#x62C6;&#x7BB1;&#x4E0E;&#x904D;&#x5386;&#x5FAA;&#x73AF;    
        3.3.3&#x3001;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;    
    3.4&#x3001;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;
</code></pre><p>&#x540E;&#x7AEF;&#x7F16;&#x8BD1;&#x5668;&#x628A;&#x5B57;&#x8282;&#x7801;&#x8F6C;&#x6362;&#x6210;&#x672C;&#x5730;&#x673A;&#x5668;&#x7801;</p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/2015/03/17/Spring源码解读笔记/"><span>Spring源码解读笔记</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/2015/03/17/Spring源码解读笔记/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: arthinking<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: </p>
</blockquote>
<p>#Spring-core</p>
<p>##org/springframework/core/io/&#x76F8;&#x5173;&#x5185;&#x5BB9;</p>
<p>###UrlResource.getInputStream()  #166<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">ResourceUtils.useCachesIfNecessary(con);</span><br></pre></td></tr></table></figure></p>
<p>&#x8BBE;&#x7F6E;<code>URLConnection</code>&#x7684;<code>UseCaches</code>&#x4E3A;false&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5728;Windows&#x4E0B;jar&#x5305;&#x88AB;&#x9501;&#x4F4F;&#x3002;</p>
<p>###AbstractFileResolvingResource<br>&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;JBoss vfs&#x534F;&#x8BAE;URL&#x6587;&#x4EF6;&#x7684;&#x83B7;&#x53D6;&#x3002;&#x901A;&#x8FC7;&#x9759;&#x6001;&#x5185;&#x90E8;&#x7C7B; VfsResourceDelegate &#x8FDB;&#x884C;&#x5904;&#x7406;&#x7684;</p>
<p>###ResourceLoader<br>&#x662F;&#x4E00;&#x4E2A;&#x7B56;&#x7565;&#x63A5;&#x53E3;&#xFF0C;&#x5176; getResource(String location)&#x65B9;&#x6CD5;&#x6839;&#x636E;&#x4F20;&#x5165;&#x4E0D;&#x540C;&#x7684;location&#xFF0C;&#x8FD4;&#x56DE;&#x4E0D;&#x540C;&#x7684;Resource&#x3002;&#x5176;&#x5B9E;&#x73B0;&#x7C7B;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x7684;ResourceLoader&#x5B9E;&#x73B0;&#x7C7B;&#xFF0C;ResourceEditor&#x4E5F;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x7C7B;</p>
<p>###DefaultResourceLoader<br>ResourceLoader&#x7684;&#x9ED8;&#x8BA4;&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;ResourceEditor&#x4F7F;&#x7528;&#x4E86;&#x8BE5;&#x7C7B;&#xFF0C;&#x662F;AbstractApplicationContext&#x7684;&#x57FA;&#x7C7B;&#x3002;</p>
<p>##&#x8BF4;&#x8BF4;Spring&#x5BB9;&#x5668;&#x7684;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;<br>XmlBeanFactory&#x901A;&#x8FC7;Resource&#x88C5;&#x8F7D;Spring&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5E76;&#x542F;&#x52A8;IoC&#x5BB9;&#x5668;&#xFF1B;<br>&#x7136;&#x540E;&#x901A;&#x8FC7;BeanFactory#getBean(beanName)&#x65B9;&#x6CD5;&#x4ECE;IoC&#x5BB9;&#x5668;&#x83B7;&#x53D6;Bean&#xFF1B;<br>&#x901A;&#x8FC7;BeanFactory&#x542F;&#x52A8;IoC&#x5BB9;&#x5668;&#x65F6;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Bean&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x52A8;&#x4F5C;&#x53D1;&#x751F;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x65F6;&#xFF1B;<br>&#x5BF9;&#x4E8E;&#x5355;&#x5B9E;&#x4F8B;&#x7684;Bean&#x6765;&#x8BF4;&#xFF0C;BeanFactory&#x4F1A;&#x7F13;&#x5B58;Bean&#x5B9E;&#x4F8B;&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E8C;&#x6B21;&#x4F7F;&#x7528;getBean()&#x83B7;&#x53D6;Bean&#x7684;&#x65F6;&#x5019;&#x5C06;&#x76F4;&#x63A5;&#x4ECE;IoC&#x5BB9;&#x5668;&#x7684;&#x7F13;&#x5B58;&#x4E2D;&#x83B7;&#x53D6;Bean&#x5B9E;&#x4F8B;&#x3002;</p>
<p>##Spring MVC&#x4E00;&#x6B21;&#x6267;&#x884C;&#x7684;&#x539F;&#x7406;</p>
<p>##&#x5217;&#x4E3E;&#x51FA;5&#x79CD;&#x5E38;&#x7528;&#x7684;SQL&#x8BED;&#x53E5;&#x4F18;&#x5316;&#x65B9;&#x5F0F;</p>
<p>##&#x8BF4;&#x8BF4;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x7684;&#x533A;&#x522B;</p>
<p>##&#x733F;&#x9898;&#x5E93;</p>
<p>&#x95EE;&#x9898;<br>&#x63CF;&#x8FF0;<br>&#x56DE;&#x7B54;<br>&#x53C2;&#x8003;&#x7F51;&#x5740;<br>&#x4E3E;&#x62A5;test</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/Java/">Java</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/Spring/">Spring</a>, <a href="/tags/Spring源码/">Spring源码</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/database/mysql/mysql/"><span>MySQL 安装问题</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/database/mysql/mysql/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>&#x6279;&#x91CF;&#x63D2;&#x5165;&#xFF1A;</p>
<blockquote>
<p><a href="http://blog.sina.com.cn/s/blog_662e56ec0100jtg5.html" target="_blank" rel="external">http://blog.sina.com.cn/s/blog_662e56ec0100jtg5.html</a></p>
</blockquote>
<p><a href="http://www.euryugasaki.com/archives/853" target="_blank" rel="external">Mac&#x4E0B;&#x65B0;&#x5B89;&#x88C5;&#x7684;MySQL&#x65E0;&#x6CD5;&#x767B;&#x9646;root&#x7528;&#x6237;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;</a></p>
<p><a href="http://xiaorui.cc/2016/01/20/mac%E4%B8%8B%E5%AE%89%E8%A3%85mysql5-7%E9%81%87%E5%88%B0%E9%BB%98%E8%AE%A4%E5%AF%86%E7%A0%81%E7%9A%84%E5%A4%A7%E5%9D%91/" target="_blank" rel="external">mac&#x4E0B;&#x5B89;&#x88C5;MySQL5.7&#x9047;&#x5230;&#x9ED8;&#x8BA4;&#x5BC6;&#x7801;&#x7684;&#x5927;&#x5751;</a></p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/Database/">Database</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/MySQL/">MySQL</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120401_JVM笔记 - 虚拟机执行子系统（类加载及执行子系统的案例与实战）/"><span>JVM笔记 - 虚拟机执行子系统（类加载及执行子系统的案例与实战）</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120401_JVM笔记 - 虚拟机执行子系统（类加载及执行子系统的案例与实战）/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>#1&#x3001;&#x6982;&#x8FF0;<br>&#x80FD;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x4E0E;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8FD9;&#x4E24;&#x90E8;&#x5206;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>#2&#x3001;&#x6848;&#x4F8B;&#x5206;&#x6790;</p>
<p>##2.1&#x3001;Tomcat&#xFF1A;&#x6B63;&#x7EDF;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x67B6;&#x6784;<br>&#x4E3B;&#x6D41;&#x7684; Java   Web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5982; Tomcat&#x3001; Jetty&#x3001; WebLogic&#x3001; WebSphere &#x6216;&#x5176;&#x4ED6;&#x7B14;&#x8005;&#x6CA1;&#x6709;&#x5217;&#x4E3E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF08;&#x4E00;&#x822C;&#x90FD;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#xFF09;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5065;&#x5168;&#x7684; Web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;    </p>
<blockquote>
<p>&#x90E8;&#x7F72;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x4E24;&#x4E2A; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x4F7F;&#x7528;&#x7684; Java &#x7C7B;&#x5E93;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x76F8;&#x4E92;&#x9694;&#x79BB;&#x3002;</p>
<p>&#x90E8;&#x7F72;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x4E24;&#x4E2A; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x4F7F;&#x7528;&#x7684; Java &#x7C7B;&#x5E93;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x5171;&#x4EAB;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x4FDD;&#x8BC1;&#x81EA;&#x8EAB;&#x7684;&#x5B89;&#x5168;&#x4E0D;&#x53D7;&#x90E8;&#x7F72;&#x7684; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x652F;&#x6301; JSP &#x5E94;&#x7528;&#x7684; Web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x90FD;&#x9700;&#x8981;&#x652F;&#x6301; HotSwap &#x529F;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x90E8;&#x7F72; Web &#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x4E2A; ClassPath &#x5C31;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5404;&#x79CD; Web &#x670D;&#x52A1;&#x5668;&#x90FD;&#x201C;&#x4E0D;&#x7EA6;&#x800C;&#x540C;&#x201D;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x597D;&#x51E0;&#x4E2A; ClassPath &#x8DEF;&#x5F84;&#x4F9B;&#x7528;&#x6237;&#x5B58;&#x653E;&#x7B2C;&#x4E09;&#x65B9;&#x7C7B;&#x5E93;&#x3002;</p>
<p>&#x5728; Tomcat &#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x6709; 3 &#x7EC4;&#x76EE;&#x5F55;&#xFF08;&#x201D;<code>/common/*</code>&#x201C;&#x3001;&#x201D;<code>/server/*</code>&#x201C; &#x548C;&#x201D;<code>/shared/*</code>&#x201C;&#xFF09; &#x53EF;&#x4EE5;&#x5B58;&#x653E; Java &#x7C7B;&#x5E93;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x53EF;&#x4EE5;&#x52A0;&#x4E0A; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x8EAB;&#x7684;&#x76EE;&#x5F55;&#x201D;/ WEB- INF/*&#x201D;&#xFF0C; &#x4E00;&#x5171; 4 &#x7EC4;&#x3002;</p>
<p><code>CommonClassLoader</code>&#x3001; <code>CatalinaClassLoader</code>&#x3001; <code>SharedClassLoader</code> &#x548C; <code>WebappClassLoader</code> &#x5219;&#x662F; Tomcat &#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;</p>
<p>###Tomcat&#x70ED;&#x90E8;&#x7F72;&#x539F;&#x7406;<br>JasperLoader &#x7684;&#x52A0;&#x8F7D;&#x8303;&#x56F4;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E2A; JSP &#x6587;&#x4EF6;&#x6240;&#x7F16;&#x8BD1;&#x51FA;&#x6765;&#x7684;&#x90A3;&#x4E00;&#x4E2A; Class&#xFF0C; &#x5B83;&#x51FA;&#x73B0;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x88AB;&#x4E22;&#x5F03;&#xFF1A;&#x5F53;&#x670D;&#x52A1;&#x5668;&#x68C0;&#x6D4B;&#x5230; JSP &#x6587;&#x4EF6;&#x88AB;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x4F1A;&#x66FF;&#x6362;&#x6389;&#x76EE;&#x524D;&#x7684; JasperLoader &#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x518D;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684; Jsp &#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x6765;&#x5B9E;&#x73B0; JSP &#x6587;&#x4EF6;&#x7684; HotSwap &#x529F;&#x80FD;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; Tomcat &#x7684; 6. x &#x7248;&#x672C;&#xFF0C;&#x53EA;&#x6709;&#x6307;&#x5B9A;&#x4E86; tomcat/conf/ catalina. properties &#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684; server.loader &#x548C; share.loader &#x9879;&#x540E;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x5EFA;&#x7ACB; CatalinaClassLoader &#x548C; SharedClassLoader &#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x7528;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F1A;&#x7528; CommonClassLoader &#x7684;&#x5B9E;&#x4F8B;&#x4EE3;&#x66FF;&#xFF0C;&#x800C;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E24;&#x4E2A; loader &#x9879;&#xFF0C;&#x6240;&#x4EE5; Tomcat 6.x &#x987A;&#x7406;&#x6210;&#x7AE0;&#x5730;&#x628A;/common&#x3001;/server &#x548C;/shared &#x4E09;&#x4E2A;&#x76EE;&#x5F55;&#x9ED8;&#x8BA4;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x8D77;&#x53D8;&#x6210;&#x4E00;&#x4E2A;/ lib &#x76EE;&#x5F55;&#x3002;</p>
<p>##2.2&#x3001;OSGi&#xFF1A;&#x7075;&#x6D3B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x67B6;&#x6784;<br>&#x201C;&#x5B66;&#x4E60; JEE &#x89C4;&#x8303;&#xFF0C;&#x53BB;&#x770B; JBoss &#x6E90;&#x7801;&#xFF1B;&#x5B66;&#x4E60;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x5C31;&#x53BB;&#x770B; OSGi &#x6E90;&#x7801;&#x201D;&#x3002;</p>
<p>OSGi &#x5728; Java &#x7A0B;&#x5E8F;&#x5458;&#x4E2D;&#x6700;&#x8457;&#x540D;&#x7684;&#x5E94;&#x7528;&#x6848;&#x4F8B;&#x5C31;&#x662F;Eclipse IDE&#x3002;</p>
<p>&#x4E00;&#x4E2A; Bundle &#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5B83;&#x6240;&#x4F9D;&#x8D56;&#x7684; Java   Package&#xFF08; &#x901A;&#x8FC7; Import- Package &#x63CF;&#x8FF0;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5B83;&#x5141;&#x8BB8;&#x5BFC;&#x51FA;&#x53D1;&#x5E03;&#x7684; Java   Package&#xFF08; &#x901A;&#x8FC7; Export- Package &#x63CF;&#x8FF0;&#xFF09;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x91CC;&#x53EA;&#x6709;&#x88AB; Export &#x8FC7;&#x7684; Package &#x624D;&#x53EF;&#x80FD;&#x7531;&#x5916;&#x754C;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x57FA;&#x4E8E; OSGi &#x7684;&#x7A0B;&#x5E8F;&#x5F88;&#x53EF;&#x80FD;&#xFF08;&#x53EA;&#x662F;&#x5F88;&#x53EF;&#x80FD;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x4F1A;&#xFF09;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x7EA7;&#x7684;&#x70ED;&#x63D2;&#x62D4;&#x529F;&#x80FD;&#xFF0C;&#x5F53;&#x7A0B;&#x5E8F;&#x5347;&#x7EA7;&#x66F4;&#x65B0;&#x6216;&#x8C03;&#x8BD5;&#x9664;&#x9519;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x53EA;&#x505C;&#x7528;&#x3001;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x7136;&#x540E;&#x542F;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>OSGi &#x7684; Bundle &#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4E4B;&#x95F4;&#x53EA;&#x6709;&#x89C4;&#x5219;&#xFF0C;&#x6CA1;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x59D4;&#x6D3E;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x53EA;&#x6709;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x67D0;&#x4E2A; Package &#x548C; Class &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x6839;&#x636E; Package &#x5BFC;&#x5165;&#x5BFC;&#x51FA;&#x5B9A;&#x4E49;&#x6765;&#x6784;&#x9020; Bundle &#x95F4;&#x7684;&#x59D4;&#x6D3E;&#x548C;&#x4F9D;&#x8D56;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x5B58;&#x5728;&#x4E8E; Bundle &#x7684;&#x7C7B;&#x5E93;&#x4E2D;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x88AB; Export&#xFF0C; &#x90A3;&#x4E48;&#x8FD9;&#x4E2A; Bundle &#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x80FD;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x63D0;&#x4F9B;&#x7ED9;&#x5176;&#x4ED6; Bundle &#x4F7F;&#x7528;</p>
<p>&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x9002;&#x5408;&#x91C7;&#x7528; OSGi &#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C; OSGi &#x5728;&#x63D0;&#x4F9B;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x989D;&#x5916;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x7EBF;&#x7A0B;&#x6B7B;&#x9501;&#x548C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>##2.3&#x3001;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#x6280;&#x672F;&#x4E0E;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x5B9E;&#x73B0;<br>javac &#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x7531; Java &#x8BED;&#x8A00;&#x5199;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x5B58;&#x653E;&#x5728; OpenJDK &#x7684; langtools/src/share/classes/com/ sun/tools/javac &#x76EE;&#x5F55;&#x4E2D;[ 1]&#x3002; &#x8981;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x5B57;&#x8282;&#x7801;&#x751F;&#x6210;&#xFF0C;&#x9605;&#x8BFB; javac &#x7684;&#x6E90;&#x7801;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x9014;&#x5F84;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x5B9E;&#x73B0;&#x4E86;&#x53EF;&#x4EE5;&#x5728;&#x539F;&#x59CB;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x8FD8;&#x672A;&#x77E5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x786E;&#x5B9A;&#x4EE3;&#x7406;&#x7C7B;&#x7684;&#x4EE3;&#x7406;&#x884C;&#x4E3A;&#xFF0C;&#x5F53;&#x4EE3;&#x7406;&#x7C7B;&#x4E0E;&#x539F;&#x59CB;&#x7C7B;&#x8131;&#x79BB;&#x76F4;&#x63A5;&#x8054;&#x7CFB;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x7075;&#x6D3B;&#x5730;&#x91CD;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E4B;&#x4E2D;&#x3002;&#x8C03;&#x7528;&#x4E86; sun.misc.ProxyGenerator.generateProxyClass() &#x65B9;&#x6CD5;&#x6765;&#x5B8C;&#x6210;&#x751F;&#x6210;&#x5B57;&#x8282;&#x7801;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x4EE3;&#x7406;&#x7C7B;&#x7684;&#x5B57;&#x8282;&#x7801; byte[] &#x6570;&#x7EC4;&#x3002;</p>
<p>##2.4&#x3001;Retrotranslator&#xFF1A;&#x8DE8;&#x8D8A;JDK&#x7248;&#x672C;<br>&#x4E00;&#x79CD;&#x540D;&#x4E3A;&#x201C; Java &#x9006;&#x5411;&#x79FB;&#x690D;&#x201D;&#x7684;&#x5DE5;&#x5177;&#xFF08; Java Backporting Tools&#xFF09;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C; Retrotranslator[1] &#x662F;&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x4E2D;&#x8F83;&#x51FA;&#x8272;&#x7684;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x5230;<code>&#x5305;&#x88C5;&#x5BF9;&#x8C61;</code>&#x7684;&#x5730;&#x65B9;&#x81EA;&#x52A8;&#x63D2;&#x5165;&#x4E86;&#x5F88;&#x591A; Integer.valueOf()&#x3001; Float.valueOf() &#x4E4B;&#x7C7B;&#x7684;&#x4EE3;&#x7801;&#xFF1B;<code>&#x53D8;&#x957F;&#x53C2;&#x6570;</code>&#x5728;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x5C31;&#x81EA;&#x52A8;&#x8F6C;&#x5316;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x6765;&#x5B8C;&#x6210;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF1B;<code>&#x6CDB;&#x578B;</code>&#x7684;&#x4FE1;&#x606F;&#x5219;&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x5C31;&#x5DF2;&#x7ECF;&#x64E6;&#x9664;&#x6389;&#x4E86;&#xFF08;&#x4F46;&#x662F;&#x5728;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x8FD8;&#x4FDD;&#x7559;&#x7740;&#xFF09;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x5730;&#x65B9;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x63D2;&#x5165;&#x4E86;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4EE3;&#x7801;[ 2]&#x3002;</p>
<p>&#x4ECE;&#x5B57;&#x8282;&#x7801;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;<code>&#x679A;&#x4E3E;</code>&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7EE7;&#x627F;&#x4E8E; java. lang. Enum&#x3001; &#x81EA;&#x52A8;&#x751F;&#x6210;&#x4E86; values() &#x548C; valueOf() &#x65B9;&#x6CD5;&#x7684;&#x666E;&#x901A; Java &#x7C7B;&#x800C;&#x5DF2;&#x3002;</p>
<p>#3&#x3001;&#x5B9E;&#x6218;&#xFF1A;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x5B9E;&#x73B0;&#x8FDC;&#x7A0B;&#x6267;&#x884C;&#x529F;&#x80FD;</p>
<p>##3.1&#x3001;&#x76EE;&#x6807;</p>
<p>##3.2&#x3001;&#x601D;&#x8DEF;</p>
<p>##3.3&#x3001;&#x5B9E;&#x73B0;<br>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x6307;&#x5B9A;&#x4E3A;&#x52A0;&#x8F7D; HotSwapClassLoader &#x7C7B;&#x7684;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x4F5C;&#x4E3A;&#x7236;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x662F;&#x5B9E;&#x73B0;&#x63D0;&#x4EA4;&#x7684;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x7AEF;&#x5F15;&#x7528;&#x7C7B;&#x5E93;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>##3.4&#x3001;&#x9A8C;&#x8BC1;</p>
<p>#4&#x3001;&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</p>
<blockquote>
<p>&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#xFF1A;JVM&#x9AD8;&#x7EA7;&#x7279;&#x6027;&#x4E0E;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF08;&#x7B2C;2&#x7248;&#xFF09;&#x300B;&#x7B14;&#x8BB0;</p>
</blockquote>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/JVM/">JVM</a>
  </span>


          
        </div>
        
    </footer>
  </div>
</article>



  <article class="post article">

  
  
    <h3 class="article-title"><a href="/Java/2014120303_参数验证问题  AOP or  过滤器/"><span>参数验证问题  AOP or  过滤器</span></a></h3>
  


  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/Java/2014120303_参数验证问题  AOP or  过滤器/" rel="bookmark">
        <time class="entry-date published" datetime="2016-02-02T06:33:13.000Z">
          2016-02-02
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <blockquote>
<p>Author: ChinSyun Pang<br>Weibo: <a href="http://weibo.com/arthinkingplus" target="_blank" rel="external">arthinking_plus</a><br>Posted in: <a href="http://www.itzhai.com" target="_blank" rel="external">http://www.itzhai.com</a></p>
</blockquote>
<p>&#x4F7F;&#x7528;Spring&#x7684;AOP&#xFF0C;&#x4E4B;&#x6069;&#x80FD;&#x591F;&#x64CD;&#x4F5C;Spring&#x4E0A;&#x4E0B;&#x6587;&#x91CC;&#x9762;&#x7684;&#x5BF9;&#x8C61;&#x3002;   </p>
<p>JSP&#x7F16;&#x8BD1;&#x6210;&#x7684;Class&#x6587;&#x4EF6;&#xFF0C;&#x662F;&#x5207;&#x5165;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;JSP&#x7F16;&#x8BD1;&#x4E3A;Servlet&#xFF0C;JSP&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x53C8;servlet&#x5BB9;&#x5668;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Servlet&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;    </p>
<p>##&#x4E0B;&#x9762;&#x4F7F;&#x7528;&#x8FC7;&#x6EE4;&#x5668;&#x8FC7;&#x6EE4;&#x9A8C;&#x8BC1;&#x53C2;&#x6570;&#xFF1A;    </p>
<p>&#x5982;&#x9875;&#x9762;&#x5927;&#x5C0F;&#xFF0C;&#x9875;&#x6570;&#x8FD9;&#x4E9B;&#x901A;&#x7528;&#x7684;&#x53C2;&#x6570;&#x9A8C;&#x8BC1;&#xFF0C;&#x53EF;&#x4EE5;&#x62BD;&#x53D6;&#x51FA;&#x901A;&#x7528;&#x7684;&#x903B;&#x8F91;&#x653E;&#x5165;&#x5230;Filter&#x4E2D;&#x5904;&#x7406;&#x3002;    </p>
<p>&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;Controller&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;AOP&#x8FDB;&#x884C;&#x62E6;&#x622A;&#x9A8C;&#x8BC1;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;JSP&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EA;&#x80FD;&#x4F7F;&#x7528;Filter&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x9A8C;&#x8BC1;&#x4E86;&#x3002;    </p>
<p>##JSP&#x8BF7;&#x6C42;&#x6574;&#x4E2A;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x8D77;HTTP&#x8BF7;&#x6C42;</li>
<li>&#x670D;&#x52A1;&#x5668;&#x7AEF;Web Server&#x63A5;&#x53D7;&#x5230;&#x8BF7;&#x6C42;&#xFF0C;&#x628A;&#x8BF7;&#x6C42;&#x8F6C;&#x4EA4;&#x7ED9;&#x5BB9;&#x5668;</li>
<li>&#x5BB9;&#x5668;&#x83B7;&#x53D6;&#x5230;&#x8BF7;&#x6C42;&#x7684;url</li>
<li>&#x5BB9;&#x5668;&#x6839;&#x636E;web.xml&#x4E2D;&#x914D;&#x7F6E;&#x7684;filter&#xFF0C;&#x5224;&#x65AD;&#x8BF7;&#x6C42;url&#x662F;&#x5426;&#x9700;&#x8981;&#x6267;&#x884C;filter</li>
<li>&#x5BB9;&#x5668;&#x6839;&#x636E;web.xml&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x627E;&#x5230;URL&#x5BF9;&#x5E94;&#x7684;Servlet&#xFF08;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x8BE5;Servlet&#xFF0C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;404&#x9519;&#x8BEF;&#x7801;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8868;&#x793A;&#x8BBF;&#x95EE;&#x7684;&#x8D44;&#x6E90;&#x4E0D;&#x5B58;&#x5728;&#xFF09;</li>
<li>&#x8C03;&#x7528;servlet&#x7684;service&#x65B9;&#x6CD5;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF08;&#x5982;&#x679C;servlet&#x8FD8;&#x672A;&#x88C5;&#x8F7D;&#x5165;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5219;&#x8FDB;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x6574;&#x4E2A;&#x65F6;&#x5019;&#x4F1A;&#x8C03;&#x7528;servlet&#x7684;init()&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x53EA;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#xFF09;&#xFF0C;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53BB;&#x6267;&#x884C;</li>
<li>&#x5982;&#x679C;Servlet&#x5B9E;&#x4F8B;&#x9700;&#x8981;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#x79FB;&#x9664;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5219;&#x8C03;&#x7528;servlet&#x5B9E;&#x4F8B;&#x7684;destroy&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x91CA;&#x653E;&#x5B9E;&#x4F8B;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x6301;&#x4E45;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x4E4B;&#x540E;&#x7B49;&#x5F85;GC&#x56DE;&#x6536;&#x3002;</li>
</ul>
<p>##Spring Controller&#x8BF7;&#x6C42;&#x6574;&#x4E2A;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>

      
    </div>
    <footer class="article-footer">
        <div class="article-meta pull-left">
          
  

  <span class="post-categories">
    <i class="icon-categories"></i>
    <a href="/categories/Java/">Java</a>
  </span>


          
  

  <span class="post-tags">
    <i class="icon-tags"></i>
    <a href="/tags/AOP/">AOP</a>, <a href="/tags/Filter/">Filter</a>
  </span>


        </div>
        
    </footer>
  </div>
</article>




<nav class="pagination">
  
  <a href="/page/7/" class="pagination-prev">Prev</a>
  
  
  <a href="/page/9/" class="pagination-next">Next</a>
  
</nav>
      </main>
    </article>

    <footer id="colophon" class="site-footer" role="contentinfo"><p class="site-info">
  Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
  Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
  </br>
  
  &copy; 2016 arthinking
  
</p>
</footer>
    
  </div>
</div>
</body>
</html>