<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="MySQL,事务,MVCC," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x53D1;&amp;#x8868;&amp;#x4E8E;&amp;#xFF1A;&amp;#x4ECE;&amp;#x4E00;&amp;#x7B14;&amp;#x4EA4;&amp;#x6613;&amp;#x8BF4;&amp;#x8D77;,&amp;#x5982;&amp;#x4F55;&amp;#x5904;&amp;#x7406;&amp;#x597D;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x4E00;&amp;#x81F4;&amp;#x6027;&amp;#x95EE;&amp;#x9898;

&amp;#x4">
<meta property="og:type" content="article">
<meta property="og:title" content="从一笔交易说起,如何处理好数据的一致性问题">
<meta property="og:url" content="http://arthinking.github.io/2016/06/10/从一笔交易说起,如何处理好数据的一致性问题/index.html">
<meta property="og:site_name" content="arthinking">
<meta property="og:description" content="&amp;#x53D1;&amp;#x8868;&amp;#x4E8E;&amp;#xFF1A;&amp;#x4ECE;&amp;#x4E00;&amp;#x7B14;&amp;#x4EA4;&amp;#x6613;&amp;#x8BF4;&amp;#x8D77;,&amp;#x5982;&amp;#x4F55;&amp;#x5904;&amp;#x7406;&amp;#x597D;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x4E00;&amp;#x81F4;&amp;#x6027;&amp;#x95EE;&amp;#x9898;

&amp;#x4">
<meta property="og:updated_time" content="2016-08-02T08:58:24.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="从一笔交易说起,如何处理好数据的一致性问题">
<meta name="twitter:description" content="&amp;#x53D1;&amp;#x8868;&amp;#x4E8E;&amp;#xFF1A;&amp;#x4ECE;&amp;#x4E00;&amp;#x7B14;&amp;#x4EA4;&amp;#x6613;&amp;#x8BF4;&amp;#x8D77;,&amp;#x5982;&amp;#x4F55;&amp;#x5904;&amp;#x7406;&amp;#x597D;&amp;#x6570;&amp;#x636E;&amp;#x7684;&amp;#x4E00;&amp;#x81F4;&amp;#x6027;&amp;#x95EE;&amp;#x9898;

&amp;#x4">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 从一笔交易说起,如何处理好数据的一致性问题 | arthinking </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  <div style="display: none;">
    <script src="http://s6.cnzz.com/stat.php?id=1259452595&web_id=1259452595" type="text/javascript"></script>
  </div>





  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">arthinking</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">ChinSyun Pang's blog</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                从一笔交易说起,如何处理好数据的一致性问题
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-06-10T00:00:00+08:00" content="2016-06-10">
              2016-06-10
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/Java/" itemprop="url" rel="index">
                    <span itemprop="name">Java</span>
                  </a>
                </span>

                
                
                  ， 
                

              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/Java/Database/" itemprop="url" rel="index">
                    <span itemprop="name">Database</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x53D1;&#x8868;&#x4E8E;&#xFF1A;<a href="http://www.itzhai.com/trade-transaction-of-data-consistency.html" target="_blank" rel="external">&#x4ECE;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8BF4;&#x8D77;,&#x5982;&#x4F55;&#x5904;&#x7406;&#x597D;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;</a></p>
</blockquote>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF1F;</h2><p>&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7528;&#x6237;&#x6570;&#x91CF;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x8BBF;&#x95EE;&#x538B;&#x529B;&#x4E5F;&#x4E0D;&#x65AD;&#x589E;&#x5927;&#xFF0C;&#x6570;&#x636E;&#x529F;&#x80FD;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x6A21;&#x5757;&#x62C6;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x96C6;&#x7FA4;&#x90E8;&#x7F72;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x5B8C;&#x6210;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x5206;&#x522B;&#x9700;&#x8981;&#x5728;<code>&#x4EA4;&#x6613;&#x6A21;&#x5757;</code>&#xFF0C;<code>&#x8BA2;&#x5355;&#x6A21;&#x5757;</code>&#xFF0C;<code>&#x7528;&#x6237;&#x6570;&#x636E;&#x6A21;&#x5757;</code>&#x4E2D;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5206;&#x522B;&#x505A;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x66F4;&#x65B0;&#x6216;&#x8005;&#x5165;&#x5E93;&#xFF0C;&#x5F53;&#x4E09;&#x4E2A;&#x6A21;&#x5757;&#x90FD;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x7B97;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x7406;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x600E;&#x4E48;&#x53BB;&#x4FDD;&#x8BC1;&#x80FD;&#x5904;&#x7406;&#x5B8C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x5462;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h3 id="&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x5904;&#x7406;"><a href="#&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x5904;&#x7406;" class="headerlink" title="&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x5904;&#x7406;"></a>&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x5904;&#x7406;</h3><p><a href="http://blog.jobbole.com/89140/" target="_blank" rel="external">&#x5982;&#x4F55;&#x7528;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x907F;&#x514D;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#xFF1F;</a>&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x65B9;&#x6848;&#x4E5F;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x5E38;&#x89C1;&#x7684;&#x573A;&#x666F;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x63A5;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x652F;&#x4ED8;&#xFF0C;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x4ED8;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x4ED8;&#x7684;API&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x90A3;&#x4E48;&#x9AD8;&#x7684;&#x63A7;&#x5236;&#x6743;&#xFF08;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x4ED8;&#x7A76;&#x7ADF;&#x6253;&#x6B3E;&#x6210;&#x529F;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x7ACB;&#x523B;&#x77E5;&#x9053;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EF;&#x4EE5;&#x5728;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x4ED8;&#x90A3;&#x8FB9;&#x52A0;&#x4E0A;&#x5E94;&#x7528;&#x6D88;&#x606F;&#x786E;&#x8BA4;&#x8868;&#x6765;&#x9632;&#x6B62;&#x91CD;&#x590D;&#x6295;&#x9012;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x56E0;&#x4E3A;&#x7B2C;&#x4E09;&#x65B9;&#x5BF9;&#x63A5;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x8DDF;&#x6E20;&#x9053;&#x505A;&#x4E00;&#x4E9B;&#x5B9A;&#x5236;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6539;&#x53D8;&#xFF09;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7B2C;&#x4E09;&#x65B9;API&#x6765;&#x5B9E;&#x73B0;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x3002;&#x5177;&#x4F53;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x9700;&#x8981;&#x4E0E;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x7528;&#x7F16;&#x7A0B;&#x5F0F;&#x4E8B;&#x52A1;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x5F02;&#x5E38;&#x56DE;&#x6EDA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D6;&#x6D88;&#x8BF7;&#x6C42;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x4E86;&#x76F8;&#x5173;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x901A;&#x77E5;&#x5176;&#x56DE;&#x6EDA;&#xFF08;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x6301;&#x8BE5;&#x64CD;&#x4F5C;&#xFF09;&#xFF1B;</li>
<li>&#x5728;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x8868;&#xFF0C;&#x5904;&#x7406;&#x5B8C;&#x4E00;&#x7B14;&#x8BA2;&#x5355;&#xFF0C;&#x5219;&#x6DFB;&#x52A0;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x7528;&#x4E8E;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x7684;&#x6D88;&#x8D39;&#xFF0C;&#x6BCF;&#x6B21;&#x6295;&#x9012;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x5219;&#x8BBE;&#x7F6E;&#x6D88;&#x606F;&#x4E3A;&#x5904;&#x7406;&#x4E2D;&#xFF1B;</li>
<li>&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x53EA;&#x53D1;&#x9001;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#xFF08;&#x5982;&#x679C;&#x7B2C;&#x4E09;&#x65B9;api&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x53BB;&#x91CD;&#x673A;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x9650;&#x5236;&#x53EA;&#x53D1;&#x9001;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6D88;&#x606F;&#x53BB;&#x91CD;&#x7B2C;&#x4E09;&#x65B9;&#x5DF2;&#x7ECF;&#x5E2E;&#x4F60;&#x5B9E;&#x73B0;&#x4E86;&#xFF09;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;&#x5904;&#x7406;&#x524D;&#x8BF7;&#x6C42;&#x7B2C;&#x4E09;&#x65B9;&#x63A5;&#x53E3;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x5047;&#x5982;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#xFF0C;&#x6D88;&#x606F;&#x88AB;&#x963B;&#x585E;&#x4E86;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x6267;&#x884C;&#x72B6;&#x6001;&#x7684;&#x8BF7;&#x6C42;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x7ED3;&#x679C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x8FD8;&#x662F;&#x672A;&#x5904;&#x7406;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x5C1D;&#x8BD5;&#x8BF7;&#x6C42;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x8FDE;&#x7EED;&#x4E24;&#x6B21;&#x8BF7;&#x6C42;&#x90FD;&#x63D0;&#x4EA4;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#xFF1B;&#x66F4;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#x63D0;&#x4EA4;&#x8BF7;&#x6C42;&#x4E4B;&#x524D;&#x5C31;&#x8BBE;&#x7F6E;&#x6D88;&#x606F;&#x72B6;&#x6001;&#x4E3A;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x95F4;&#x9694;&#x4E45;&#x4E00;&#x70B9;&#x7684;&#x65F6;&#x95F4;&#x5B9A;&#x671F;&#x8F6E;&#x8BAD;&#x8BF7;&#x6C42;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x672A;&#x6267;&#x884C;&#xFF0C;&#x5219;&#x4EA7;&#x751F;&#x62A5;&#x8B66;&#x5E76;&#x751F;&#x6210;&#x91CD;&#x53D1;&#x6D88;&#x606F;&#x7684;&#x8868;&#x5355;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x53CC;&#x65B9;&#x786E;&#x8BA4;&#x6CA1;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#x518D;&#x91CD;&#x65B0;&#x8BA9;&#x6D88;&#x606F;&#x6295;&#x9012;&#x8FC7;&#x53BB;&#xFF1B;&#x4E0D;&#x8FC7;&#x5982;&#x679C;&#x662F;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x5185;&#x90E8;&#x7684;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x63A7;&#x5236;API&#x6765;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x72B6;&#x6001;&#x6765;&#x9632;&#x6B62;&#x6D88;&#x606F;&#x91CD;&#x590D;&#x6295;&#x9012;&#x3002;</li>
</ul>
<h2 id="&#x5173;&#x4E8E;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x91CD;&#x590D;&#x8BF7;&#x6C42;&#x7684;&#x95EE;&#x9898;"><a href="#&#x5173;&#x4E8E;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x91CD;&#x590D;&#x8BF7;&#x6C42;&#x7684;&#x95EE;&#x9898;" class="headerlink" title="&#x5173;&#x4E8E;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x91CD;&#x590D;&#x8BF7;&#x6C42;&#x7684;&#x95EE;&#x9898;"></a>&#x5173;&#x4E8E;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x91CD;&#x590D;&#x8BF7;&#x6C42;&#x7684;&#x95EE;&#x9898;</h2><p>&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5E76;&#x53D1;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x91CD;&#x590D;&#x6267;&#x884C;&#xFF0C;&#x52A0;&#x5165;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x3002;&#x9632;&#x6B62;&#x91CD;&#x590D;&#x70B9;&#x51FB;&#x4E24;&#x6B21;&#xFF0C;&#x5BFC;&#x81F4;&#x91CD;&#x590D;&#x6267;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x6837;&#x53C8;&#x5F71;&#x54CD;&#x4E86;&#x524D;&#x7AEF;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x76EE;&#x524D;&#x8BE5;&#x529F;&#x80FD;&#x90FD;&#x662F;&#x8D22;&#x52A1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x4E3B;&#x52A8;&#x89E6;&#x53D1;&#x8BE5;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x5E76;&#x53D1;&#x91CF;&#x5C31;&#x4E0A;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x5219;&#x4F1A;&#x5F15;&#x53D1;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x7684;&#x53EF;&#x9760;&#x65B9;&#x5F0F;&#x6765;&#x53D6;&#x4EE3;&#x8FD9;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#xFF1A;</p>
<ul>
<li><p>&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x884C;&#x9501;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x6839;&#x636E;&#x652F;&#x4ED8;&#x8BA2;&#x5355;&#xFF0C;&#x521B;&#x5EFA;&#x652F;&#x4ED8;&#x6D88;&#x606F;&#xFF0C;&#x6839;&#x636E;&#x652F;&#x4ED8;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x6253;&#x6B3E;&#x8BF7;&#x6C42;&#xFF0C;&#x6253;&#x6B3E;&#x8BF7;&#x6C42;&#x53D1;&#x51FA;&#x53BB;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x7684;&#x884C;&#x9501;update&#x66F4;&#x65B0;&#x652F;&#x4ED8;&#x6D88;&#x606F;&#x4E3A;&#x5DF2;&#x63D0;&#x4EA4;&#x652F;&#x4ED8;&#x8BF7;&#x6C42;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x65B0;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x8868;&#x660E;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x65B0;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x8868;&#x660E;&#x5DF2;&#x7ECF;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5904;&#x7406;&#x6389;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x6839;&#x636E;&#x4E50;&#x89C2;&#x9501;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x83B7;&#x53D6;&#x5230;&#x4E50;&#x89C2;&#x9501;&#x7684;&#x4F18;&#x5148;update&#x66F4;&#x65B0;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x6765;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x7CFB;&#x7EDF;&#x66F4;&#x53EF;&#x9760;&#xFF0C;&#x4E50;&#x89C2;&#x9501;&#x4E5F;&#x5E94;&#x8BE5;&#x662F;&#x8981;&#x4FDD;&#x8BC1;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Redis&#x96C6;&#x7FA4;&#x6216;&#x8005;zk&#x96C6;&#x7FA4;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x5206;&#x5E03;&#x5F0F;&#x9501;&#x670D;&#x52A1;&#x3002;</p>
</li>
</ul>
<h2 id="&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;"><a href="#&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;" class="headerlink" title="&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;"></a>&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x56DB;&#x4E2A;&#x7279;&#x5F81;</h2><h3 id="acid"><a href="#ACID" class="headerlink" title="ACID"></a>ACID</h3><blockquote>
<p>&#x539F;&#x5B50;&#x6027;&#xFF1A;&#x8D2D;&#x4E70;&#x64CD;&#x4F5C;&#x6240;&#x6709;&#x6570;&#x636E;&#x5904;&#x7406;&#x8981;&#x4E48;&#x90FD;&#x5931;&#x8D25;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x6210;&#x529F;&#xFF1B;<br>&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x7834;&#x574F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF1B;<br>&#x9694;&#x79BB;&#x6027;&#xFF1A;&#x4E0D;&#x540C;&#x4E8B;&#x52A1;&#x64CD;&#x4F5C;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x5404;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x5E72;&#x6270;&#xFF1B;<br>&#x6301;&#x4E45;&#x6027;&#xFF1A;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x53D8;&#x66F4;&#x662F;&#x6C38;&#x4E45;&#x7684;&#x3002;</p>
</blockquote>
<h2 id="&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;"><a href="#&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;" class="headerlink" title="&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;"></a>&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;</h2><p><code>Read Uncommitted</code>: &#x5141;&#x8BB8;&#x810F;&#x8BFB;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5B58;&#x5728;&#x5E7B;&#x8BFB;<br><code>Read Committed</code>: &#x6CA1;&#x6709;&#x810F;&#x8BFB;&#x810F;&#x8BFB;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;&#x63D0;&#x4EA4;&#x540E;&#x53EF;&#x8BFB;&#xFF09;&#xFF0C;&#x5B58;&#x5728;&#x5E7B;&#x8BFB;<br><code>Repeatable Read</code>: &#x6CA1;&#x6709;&#x6709;&#x810F;&#x8BFB;&#xFF0C;&#x53EF;&#x91CD;&#x590D;&#x5EA6;&#xFF0C;&#x5B58;&#x5728;&#x5E7B;&#x8BFB;<br><code>Serializable</code>: &#x6CA1;&#x6709;&#x810F;&#x8BFB;&#xFF0C;&#x53EF;&#x91CD;&#x590D;&#x5EA6;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x5E7B;&#x8BFB;</p>
<p><code>Serializable</code>&#x4E32;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x6548;&#x7387;&#x592A;&#x4F4E;&#x3002;</p>
<blockquote>
<p>&#x4E00;&#x822C;&#x4F7F;&#x7528;<code>Repeatable Read</code>&#xFF0C;&#x8FD9;&#x7C7B;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x4E8B;&#x7269;&#x5185;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x810F;&#x8BFB;&#x4E5F;&#x9632;&#x6B62;&#x4E86;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x9020;&#x6210;&#x7684;&#x810F;&#x6570;&#x636E;&#xFF0C;&#x66F4;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x4FDD;&#x8BC1;&#x4E86;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x81F3;&#x4E8E;&#x5E7B;&#x8BFB;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x597D;&#x5177;&#x6709;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x907F;&#x514D;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
</blockquote>
<p>&#x8D2D;&#x4E70;&#x7406;&#x8D22;&#x4EA7;&#x54C1;&#xFF0C;&#x53EF;&#x8D2D;&#x4E70;&#x4F59;&#x989D;&#x5269;&#x4E0B;1000&#x5757;&#xFF0C;A&#x7528;&#x6237;&#x8D2D;&#x4E70;&#x91D1;&#x989D;&#x6263;&#x51CF;&#x6210;&#x529F;&#x4E86;&#xFF0C;B&#x7528;&#x6237;&#x8FDB;&#x6765;&#x53D1;&#x73B0;&#x6CA1;&#x5F97;&#x8D2D;&#x4E70;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x63D0;&#x793A;&#x5DF2;&#x52DF;&#x96C6;&#x7ED3;&#x675F;&#xFF0C;A&#x63A5;&#x4E0B;&#x6765;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x56E0;&#x4E3A;&#x5F02;&#x5E38;&#xFF0C;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53C8;&#x6062;&#x590D;&#x4E86;&#x53EF;&#x8D2D;&#x4E70;&#x4F59;&#x989D;1000&#x5757;&#xFF0C;B&#x7528;&#x6237;&#x6216;&#x8005;C&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x94B1;&#x591F;&#x8FD9;1000&#x5757;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E5F;&#x662F;&#x8FD0;&#x884C;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x5356;&#x51FA;&#x53BB;&#x7684;&#x94B1;&#x4E0D;&#x4F1A;&#x8D85;&#x989D;&#x3002;&#x66FE;&#x7ECF;&#x5C31;&#x9047;&#x5230;&#x8FC7;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8D2D;&#x4E70;&#x6700;&#x540E;&#x4E00;&#x7B14;&#x53EF;&#x8D2D;&#x4E70;&#x4F59;&#x989D;&#x88AB;&#x591A;&#x4E0B;&#x4E86;&#x4E24;&#x6B21;&#x5355;&#xFF0C;&#x5BFC;&#x81F4;&#x52DF;&#x96C6;&#x91D1;&#x989D;&#x591A;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x548C;&#x5177;&#x6709;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x7684;&#x8D44;&#x6E90;&#x6CA1;&#x63A7;&#x5236;&#x597D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x600E;&#x4E48;&#x5F7B;&#x5E95;&#x907F;&#x514D;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x7814;&#x7A76;&#x4E0B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x548C;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;&#x3002;</p>
<h2 id="&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;"><a href="#&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;" class="headerlink" title="&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;"></a>&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;</h2><p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x91CC;&#x9762;&#x8BBE;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x9ED8;&#x8BA4;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#xFF1A;</p>
<figure class="highlight sql"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">select</span> @@global.tx_isolation;</span><br></pre></td></tr></table></figure>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5047;&#x8BBE;&#x67E5;&#x51FA;&#x6765;&#x7684;&#x662F;<code>REPEATABLE_READ</code>,&#x5141;&#x8BB8;&#x91CD;&#x590D;&#x8BFB;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x505A;&#x4E00;&#x7EC4;&#x8BD5;&#x9A8C;&#x3002;</p>
<p><strong>&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x89C2;&#x5BDF;&#x6570;&#x636E;&#x5E93;&#x7684;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;</strong></p>
<p>&#x7EBF;&#x7A0B;1&#x6267;&#x884C;&#x4E8B;&#x52A1;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">update t_audio set like_num=like_num-10 where id=1 and like_num&gt;0;</span><br><span class="line">// &#x4F11;&#x7720;30&#x79D2;</span><br><span class="line">...</span><br></pre></td></tr></table></figure></p>
<p>&#x7EBF;&#x7A0B;2&#x6267;&#x884C;&#x4E8B;&#x52A1;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">update t_audio set like_num=like_num-10 where id=2 and like_num&gt;0;</span><br><span class="line">// &#x4F11;&#x7720;30&#x79D2;</span><br><span class="line">...</span><br></pre></td></tr></table></figure></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7531;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x66F4;&#x65B0;&#x4E24;&#x6761;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x90FD;&#x53EF;&#x4EE5;&#x7ACB;&#x523B;&#x66F4;&#x65B0;&#x6210;&#x529F;&#xFF1B;</p>
<p>&#x800C;&#x5982;&#x679C;&#x628A;&#x7EBF;&#x7A0B;2&#x6267;&#x884C;&#x66F4;&#x65B0;&#x7684;&#x8BB0;&#x5F55;id&#x4E5F;&#x6539;&#x4E3A;1&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x7EBF;&#x7A0B;2&#x4E00;&#x76F4;&#x5361;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x7B49;&#x5730;&#x7EBF;&#x7A0B;1&#x7684;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x8FDB;&#x4E00;&#x6B65;&#x6D4B;&#x8BD5;&#xFF0C;&#x7EBF;&#x7A0B;2&#x4E0D;&#x66F4;&#x65B0;&#xFF0C;&#x53EA;&#x662F;&#x67E5;&#x8BE2;&#x7EBF;&#x7A0B;1&#x4FEE;&#x6539;&#x7684;&#x8BB0;&#x5F55;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">select * from t_audio where id=1;</span><br></pre></td></tr></table></figure>
<p>&#x56E0;&#x4E3A;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;<code>REPEATABLE_READ</code>&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;2&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x7EBF;&#x7A0B;1&#x4E8B;&#x52A1;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#xFF0C;&#x6240;&#x4EE5;&#x770B;&#x5230;&#x7684;&#x662F;&#x4FEE;&#x6539;&#x524D;&#x7684;&#x503C;&#x3002;</p>
<p><strong>&#x7ED3;&#x8BBA;</strong></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x4FEE;&#x6539;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x662F;&#x6709;&#x884C;&#x9501;&#x7684;&#xFF0C;&#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x524D;&#x8BE5;&#x9501;&#x4E0D;&#x4F1A;&#x91CA;&#x653E;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#x624D;&#x91CA;&#x653E;.</p>
<h2 id="&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;"><a href="#&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;" class="headerlink" title="&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;"></a>&#x5173;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;</h2><p>&#x6211;&#x4EEC;&#x6765;&#x5047;&#x8BBE;&#x4E00;&#x4E0B;&#x6709;&#x5982;&#x4E0B;&#x573A;&#x666F;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">transA(){  <span class="comment">// PROPAGATION_REQUIRED</span></span><br><span class="line">    transB();  <span class="comment">// PROPAGATION_REQUIRES_NEW</span></span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x5047;&#x8BBE;&#x8BBE;&#x7F6E;&#x7684;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E3A;<code>Repeatable Read</code>,transA&#x65B9;&#x6CD5;&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;&#x4E3A;<code>PROPAGATION_REQUIRED</code>,transB&#x7684;&#x4F20;&#x64AD;&#x7279;&#x6027;&#x4E3A;<code>PROPAGATION_REQUIRES_NEW</code>,&#x5047;&#x8BBE;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x540C;&#x4E8B;&#x6267;&#x884C;&#x4E86;&#xFF1A;</p>
<figure class="highlight sql"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">update</span> t_audio <span class="keyword">set</span> like_num=like_num<span class="number">-10</span> <span class="keyword">where</span> <span class="keyword">id</span>=<span class="number">1</span></span><br></pre></td></tr></table></figure>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x65B0;&#xFF0C;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x4E00;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x4E24;&#x6B21;&#x6539;&#x52A8;&#x90FD;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x597D;&#x50CF;&#x4E24;&#x6B21;&#x4E8B;&#x52A1;&#x7684;&#x6539;&#x52A8;&#x90FD;&#x6210;&#x529F;&#x4E86;&#x7684;&#x6837;&#x5B50;&#xFF0C;<code>PROPAGATION_REQUIRES_NEW</code>&#x662F;&#x600E;&#x6837;&#x7684;&#x673A;&#x5236;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5206;&#x6790;&#x4E0B;&#x3002;</p>
<h3 id="&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;"><a href="#&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;" class="headerlink" title="&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;"></a>&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;</h3><p>&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;&#x5D4C;&#x5957;&#x4E8B;&#x52A1;&#xFF08;nested transaction&#xFF09;&#xFF0C;&#x5BF9;&#x5E94;&#x7684; spring&#x7684;&#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x7279;&#x6027;&#x5219;&#x662F;&#xFF1A;</p>
<blockquote>
<p>PROPAGATION_NESTED</p>
</blockquote>
<p>&#x5728;<a href="http://www.cnblogs.com/yangy608/archive/2011/06/29/2093478.html" target="_blank" rel="external">&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;</a>&#x91CC;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;&#x8BE5;&#x4F20;&#x64AD;&#x7279;&#x6027;&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<code>savepoint</code>&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#x53C8;&#x5F00;&#x542F;&#x4E86;&#x4E8B;&#x52A1;&#x8FD9;&#x6837;&#x7684;&#x5D4C;&#x5957;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x518D;&#x6B21;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x4F20;&#x64AD;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li><p><code>PROPAGATION_NESTED</code>&#xFF1A;&#x901A;&#x8FC7;savepoint&#x5B9E;&#x73B0;&#x4E86;&#x5B50;&#x4E8B;&#x52A1;&#xFF1B;</p>
</li>
<li><p><code>PROPAGATION_REQUIRES_NEW</code>&#x628A;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x6302;&#x8D77;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x5E76;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x8BF4;&#x5230;&#x4E8B;&#x52A1;&#x6302;&#x8D77;&#xFF0C;&#x5C31;&#x8981;&#x987A;&#x4FBF;&#x63D0;&#x4E00;&#x4E0B;MySQL&#x7684;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x4E86;&#xFF0C;Mysql&#x4F7F;&#x7528;&#x4E86;<a href="http://www.cnblogs.com/duanxz/p/3440414.html" target="_blank" rel="external">&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;</a>(flat model, not nested model)&#x3002;</p>
</li>
</ul>
<h3 id="&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x548C;&#x5D4C;&#x5165;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;"><a href="#&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x548C;&#x5D4C;&#x5165;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;" class="headerlink" title="&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x548C;&#x5D4C;&#x5165;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;"></a>&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x548C;&#x5D4C;&#x5165;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;</h3><p>&#x5728;&#x5D4C;&#x5165;&#x5F0F;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x60F3;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x4E0B;&#x7EE7;&#x7EED;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4F9D;&#x65E7;&#x4F1A;&#x4FDD;&#x6301;&#x6B63;&#x5E38;&#x7684;&#x5F00;&#x542F;&#x72B6;&#x6001;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x4F1A;&#x5D4C;&#x5957;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#xFF1B;&#x800C;&#x5728;&#x5E73;&#x9762;&#x5F0F;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x542F;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x540E;&#xFF0C;&#x7EE7;&#x7EED;&#x5F00;&#x542F;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x5148;&#x63D0;&#x4EA4;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;</p>
<p>MySQL&#x4F7F;&#x7528;&#x4E86;&#x5E73;&#x9762;&#x4E8B;&#x52A1;&#x6A21;&#x578B;&#xFF1A;&#x5D4C;&#x5957;&#x7684;&#x4E8B;&#x52A1;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x5728;&#x8FDE;&#x7EED;&#x5F00;&#x542F;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x4E86;&#x3002;</p>
<p>see <a href="http://hssl.cs.jhu.edu/~randal/416/lectures/06.txnmodels.pdf" target="_blank" rel="external">more</a> and <a href="http://blog.itpub.net/51862/viewspace-180648/" target="_blank" rel="external">here</a></p>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#x660E;MySQL&#x4E0D;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#x5D4C;&#x5957;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E0D;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;</p>
<blockquote>
<p>set autocommit=0 </p>
</blockquote>
<p>&#x8BBE;&#x7F6E;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF1A;</p>
<blockquote>
<p>set tx_isolation=&#x2019;REPEATABLE-READ&#x2019;</p>
</blockquote>
<figure class="highlight"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">START TRANSACTION;</span><br><span class="line">	# &#x5916;&#x90E8;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x8BB0;&#x5F55;</span><br><span class="line">	update gt_audio set like_num=like_num-10 where id=1;</span><br><span class="line">	START TRANSACTION;</span><br><span class="line">		# &#x5185;&#x90E8;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;</span><br><span class="line">		update gt_audio set like_num=like_num-20 where id=1;</span><br><span class="line">  ROLLBACK;  # &#x5185;&#x90E8;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;</span><br><span class="line">	# &#x5916;&#x90E8;&#x4E8B;&#x52A1;&#x67E5;&#x627E;&#x8BB0;&#x5F55;</span><br><span class="line">COMMIT;</span><br></pre></td></tr></table></figure>
<p>like_num&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F;30&#xFF0C;&#x5F00;&#x542F;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x4E2D;&#x67E5;&#x8BE2;&#xFF0C;&#x53D1;&#x73B0;like_num&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x53D8;&#x4E3A;&#x4E86;20&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x6267;&#x884C;&#x7B2C;&#x4E8C;&#x4E2A;START TRANSACTION&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x5185;&#x5BB9;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x4E86;&#xFF0C;&#x7EE7;&#x7EED;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x65E0;&#x8BBA;&#x540E;&#x9762;&#x600E;&#x4E48;&#x56DE;&#x6EDA;&#x6216;&#x8005;&#x63D0;&#x4EA4;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x64A4;&#x9500;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6539;&#x52A8;&#x4E86;&#x3002;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;Spring&#x7684;<code>PROPAGATION_REQUIRES_NEW</code>&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#x7684;sql&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5F00;&#x542F;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6682;&#x65F6;&#x5B58;&#x8D77;&#x6765;&#x4E0D;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;Spring&#x5185;&#x90E8;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;<code>PROPAGATION_REQUIRES_NEW</code>&#x7684;&#x6302;&#x8D77;&#x64CD;&#x4F5C;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x72B6;&#x6001;&#xFF1A;<code>Suspend</code>&#x3002;&#x9664;&#x4E86;<code>PROPAGATION_REQUIRES_NEW</code>&#x8FD9;&#x79CD;&#x4F20;&#x64AD;&#x7279;&#x6027;&#xFF0C;<code>PROPAGATION_NOT_SUPPORTED</code>&#x4E5F;&#x4F1A;&#x8BA9;&#x4E8B;&#x52A1;&#x8FDB;&#x5165;<code>Suspend</code>&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;propagation_nested"><a href="#&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;PROPAGATION-NESTED" class="headerlink" title="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;PROPAGATION_NESTED"></a>&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>PROPAGATION_NESTED</code></h3><p>&#x4F7F;&#x7528;<code>PROPAGATION_NESTED</code>&#x662F;&#x6709;&#x524D;&#x63D0;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x8BE5;&#x5D4C;&#x5957;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x505A;&#x5206;&#x652F;&#x5904;&#x7406;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">transactionA(){</span><br><span class="line">    <span class="keyword">try</span>{</span><br><span class="line">        transactionB();</span><br><span class="line">    } <span class="keyword">catch</span>(SomeException e){</span><br><span class="line">        <span class="comment">// &#x5904;&#x7406;&#x5176;&#x4ED6;&#x6570;&#x636E;</span></span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x56E0;&#x4E3A;&#x5185;&#x90E8;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8FD4;&#x56DE;&#x5230;&#x4E86;&#x5185;&#x90E8;&#x4E8B;&#x52A1;&#x4E4B;&#x524D;&#x7684;savepoint&#xFF0C;&#x6240;&#x4EE5;&#x5916;&#x90E8;&#x4E8B;&#x52A1;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x8FD8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x5426;&#x5219;&#x7528;<code>PROPAGATION_REQUIRED</code>&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;propagation_required_new"><a href="#&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;PROPAGATION-REQUIRED-NEW" class="headerlink" title="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;PROPAGATION_REQUIRED_NEW"></a>&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>PROPAGATION_REQUIRED_NEW</code></h3><p>&#x5982;&#x679C;&#x4E0D;&#x7BA1;&#x5916;&#x90E8;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x6210;&#x529F;&#x4E0E;&#x5426;&#xFF0C;&#x67D0;&#x4E9B;&#x5185;&#x5D4C;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x8981;&#x6267;&#x884C;&#x6210;&#x529F;&#xFF0C;&#x5373;&#x63D0;&#x4EA4;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x4F20;&#x64AD;&#x5C5E;&#x6027;&#x5566;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x65E0;&#x8BBA;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x6210;&#x529F;&#x6216;&#x8005;&#x5931;&#x8D25;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x65E5;&#x5FD7;&#xFF1B;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x5355;&#x72EC;&#x7684;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x522B;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x4FDD;&#x5B58;&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x65E0;&#x9700;&#x5F00;&#x542F;&#x8FD9;&#x79CD;&#x4E8B;&#x52A1;&#x4E86;&#x3002;</p>
<h3 id="propagation_supports&#x7684;&#x4F5C;&#x7528;"><a href="#PROPAGATION-SUPPORTS&#x7684;&#x4F5C;&#x7528;" class="headerlink" title="PROPAGATION_SUPPORTS&#x7684;&#x4F5C;&#x7528;"></a>PROPAGATION_SUPPORTS&#x7684;&#x4F5C;&#x7528;</h3><p>&#x5BF9;&#x4E8E;&#x524D;&#x9762;&#x4F7F;&#x7528;<code>REPEATABLE_READ</code>&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x76F8;&#x4E92;&#x9694;&#x79BB;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x8BA9;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">updateData</span><span class="params">()</span></span>{</span><br><span class="line">    <span class="comment">// &#x66F4;&#x65B0;&#x91D1;&#x989D;&#x76F8;&#x5173;&#x64CD;&#x4F5C;</span></span><br><span class="line">    ...</span><br><span class="line">    <span class="comment">// &#x8BFB;&#x53D6;&#x91D1;&#x989D;&#x7684;&#x65B9;&#x6CD5;</span></span><br><span class="line">    <span class="keyword">long</span> amount = readAmount();</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;<code>readAmount()</code>&#x65B9;&#x6CD5;&#x7684;&#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x5C5E;&#x6027;&#x4E3A;<code>PROPAGATION_SUPPORTS</code>,&#x90A3;&#x4E48;&#x8BE5;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;updateData()&#x65B9;&#x6CD5;&#x7684;&#x4E8B;&#x52A1;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4E0A;&#x9762;&#x6539;&#x52A8;&#x91D1;&#x989D;&#x4E4B;&#x548C;&#xFF0C;readAmount&#x4E5F;&#x53EF;&#x4EE5;&#x7ACB;&#x523B;&#x8BFB;&#x53D6;&#x5230;&#x6539;&#x52A8;&#x540E;&#x7684;&#x503C;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;: &#x5F53;&#x4E3A;&#x65B9;&#x6CD5;&#x5206;&#x914D;&#x4E8B;&#x52A1;&#x5C5E;&#x6027;&#x7684;&#x65F6;&#x5019;,&#x628A;&#x7C7B;&#x4E2D;&#x5BF9;&#x5927;&#x90E8;&#x5206;&#x65B9;&#x6CD5;&#x6700;&#x5177;&#x9650;&#x5236;&#x6027;&#x7684;&#x5C5E;&#x6027;&#x4F5C;&#x4E3A;&#x7C7B;&#x7EA7;&#x522B;&#x7684;&#x9ED8;&#x8BA4;&#x5C5E;&#x6027;, &#x7136;&#x540E;&#x518D;&#x5BF9;&#x6709;&#x7279;&#x6B8A;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5FAE;&#x8C03;.&#x5982;&#x679C;&#x9ED8;&#x8BA4;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BFB;&#x65B9;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x4E3A;<code>PROPAGATION_SUPPORTS</code>&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x4F7F;&#x7528;<code>PROPAGATION_MANDATORY</code>&#x6765;&#x786E;&#x4FDD;&#x9700;&#x8981;&#x4E8B;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x5373;&#x4F7F;&#x5199;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x53C8;&#x8C03;&#x7528;&#x4E86;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x5305;&#x542B;&#x5728;&#x8FD9;&#x4E2A;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#x4E86;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x914D;&#x7F6E;</p>
<blockquote>
<p>&#x5C06;<code>PROPAGATION_MANDATORY</code>&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x5C5E;&#x6027;, &#x800C;&#x5BF9;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;<code>PROPAGATION_SUPPORTS</code>&#x5C5E;&#x6027;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x6240;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x9ED8;&#x8BA4;&#x9700;&#x8981;&#x4E8B;&#x52A1;&#x4E86;&#xFF0C;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x7F16;&#x5199;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5FD8;&#x4E86;&#x8003;&#x8651;&#x4E8B;&#x52A1;&#x800C;&#x4EA7;&#x751F;&#x610F;&#x5411;&#x4E0D;&#x5230;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x4E8B;&#x52A1;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E13;&#x95E8;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5BF9;&#x4E8E;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;<code>Supports</code>&#x4F1A;&#x907F;&#x514D;&#x4E0A;&#x9762;&#x66F4;&#x65B0;&#x91D1;&#x989D;&#x7684;&#x4F8B;&#x5B50;&#x4EA7;&#x751F;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x4E3A;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5BF9;&#x4E8E;&#x975E;&#x5D4C;&#x5957;&#x7684;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6539;&#x52A8;&#x6CA1;&#x63D0;&#x4EA4;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x662F;&#x6539;&#x52A8;&#x524D;&#x7684;&#x503C;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x8981;&#x6539;&#x52A8;&#x540C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E00;&#x5B9A;&#x4F1A;&#x7B49;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x4FEE;&#x6539;,&#x7531;&#x4E8E;&#x662F;&#x53EF;&#x91CD;&#x590D;&#x5EA6;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6539;&#x52A8;&#x540E;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x8FD8;&#x662F;&#x539F;&#x6765;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;update&#x2026; set a=a-1&#x8FD9;&#x6837;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#xFF0C;a&#x5374;&#x5E94;&#x7528;&#x4E86;&#x4E24;&#x6B21;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">START TRANSACTION;  # &#x540C;&#x65F6;&#x5F00;&#x542F;&#x4E8B;&#x52A1;A&#x548C;&#x4E8B;&#x52A1;B</span><br><span class="line">select like_num from gt_audio where id=1;  # &#x4E8B;&#x52A1;A&#x548C;&#x4E8B;&#x52A1;B&#x90FD;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x503C;&#x4E3A;10</span><br><span class="line"># &#x5916;&#x90E8;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x8BB0;&#x5F55;</span><br><span class="line">update gt_audio set like_num=like_num-10 where id=1;  # &#x4E8B;&#x52A1;A&#x5BF9;&#x8BE5;&#x503C;-10</span><br><span class="line">select like_num from gt_audio where id=1;</span><br><span class="line">COMMIT; # &#x4E8B;&#x52A1;A&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;B&#x518D;&#x8BFB;&#x53D6;&#x503C;&#xFF0C;&#x8FD8;&#x662F;10&#xFF0C;&#x4F46;&#x662F;&#x4E8B;&#x52A1;B&#x6267;&#x884C;&#x4E0A;&#x9762;&#x7684;update&#x8BED;&#x53E5;&#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x503C;&#x76F4;&#x63A5;&#x53D8;&#x4E3A;-10&#x4E86;</span><br></pre></td></tr></table></figure>
<p>&#x8003;&#x8651;&#x4EE5;&#x4E0A;sql&#xFF0C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x4E8B;&#x6267;&#x884C;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x67E5;&#x51FA;&#x6765;&#x7684;like_num&#x90FD;&#x662F;10&#xFF0C;<br>&#x4E8B;&#x52A1;1&#x4FEE;&#x6539;&#x5E76;&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;2&#x7EE7;&#x7EED;&#x67E5;&#x51FA;&#x6765;&#x7684;&#x8FD8;&#x662F;10&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x4E8B;&#x52A1;&#x4E8C;&#x6267;&#x884C;&#x66F4;&#x65B0;&#x8BED;&#x53E5;&#x4E4B;&#x540E;&#xFF0C;like_num&#x5374;&#x7A81;&#x7136;&#x76F4;&#x63A5;&#x53D8;&#x4E3A;&#x4E86;-10&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x4E86;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x901A;&#x8FC7;a=a-1&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x662F;&#x4E0D;&#x4F1A;&#x8986;&#x76D6;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x505A;&#x7684;&#x6539;&#x52A8;&#x7684;&#x3002;</p>
<p>&#x7531;&#x4E8E;InnoDB&#x5F15;&#x64CE;&#x5B9E;&#x73B0;&#x4E86;MVCC&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF0C;&#x6240;&#x4EE5;update&#x4E4B;&#x540E;&#x770B;&#x5230;&#x7684;&#x603B;&#x662F;&#x6700;&#x65B0;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<h2 id="mysql&#x7684;innodb&#x5F15;&#x64CE;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;mvcc&#x7684;"><a href="#MySQL&#x7684;innodb&#x5F15;&#x64CE;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;MVCC&#x7684;" class="headerlink" title="MySQL&#x7684;innodb&#x5F15;&#x64CE;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;MVCC&#x7684;?"></a>MySQL&#x7684;innodb&#x5F15;&#x64CE;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;MVCC&#x7684;?</h2><p>innodb&#x4F1A;&#x4E3A;&#x6BCF;&#x4E00;&#x884C;&#x6DFB;&#x52A0;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x8BE5;&#x884C;&#x521B;&#x5EFA;&#x7684;&#x7248;&#x672C;&#x548C;&#x5220;&#x9664;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x586B;&#x5165;&#x7684;&#x662F;&#x4E8B;&#x52A1;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#x968F;&#x7740;&#x4E8B;&#x52A1;&#x7684;&#x521B;&#x5EFA;&#x4E0D;&#x65AD;&#x9012;&#x589E;&#x3002;&#x5728;repeated read&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF08;&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8BF7;&#x770B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF09;&#x4E0B;&#xFF0C;&#x5177;&#x4F53;&#x5404;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ul>
<li>select&#xFF1A;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;innodb&#x4F1A;&#x8FD4;&#x56DE;&#x8BE5;&#x884C;&#x6570;&#x636E;&#xFF1A;&#xFF08;1&#xFF09;&#x8BE5;&#x884C;&#x7684;&#x521B;&#x5EFA;&#x7248;&#x672C;&#x53F7;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#x5F53;&#x524D;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x8BC1;&#x5728;select&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x5DF2;&#x7ECF;&#x6267;&#x884C;&#x843D;&#x5730;&#x3002;&#xFF08;2&#xFF09;&#x8BE5;&#x884C;&#x7684;&#x5220;&#x9664;&#x7248;&#x672C;&#x53F7;&#x5927;&#x4E8E;&#x5F53;&#x524D;&#x7248;&#x672C;&#x6216;&#x8005;&#x4E3A;&#x7A7A;&#x3002;&#x5220;&#x9664;&#x7248;&#x672C;&#x53F7;&#x5927;&#x4E8E;&#x5F53;&#x524D;&#x7248;&#x672C;&#x610F;&#x5473;&#x7740;&#x6709;&#x4E00;&#x4E2A;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x5C06;&#x8BE5;&#x884C;&#x5220;&#x9664;&#x4E86;&#x3002;</li>
<li>insert&#xFF1A;&#x5C06;&#x65B0;&#x63D2;&#x5165;&#x7684;&#x884C;&#x7684;&#x521B;&#x5EFA;&#x7248;&#x672C;&#x53F7;&#x8BBE;&#x7F6E;&#x4E3A;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;</li>
<li>delete&#xFF1A;&#x5C06;&#x8981;&#x5220;&#x9664;&#x7684;&#x884C;&#x7684;&#x5220;&#x9664;&#x7248;&#x672C;&#x53F7;&#x8BBE;&#x7F6E;&#x4E3A;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;</li>
<li>update&#xFF1A;&#x4E0D;&#x6267;&#x884C;&#x539F;&#x5730;update&#xFF0C;&#x800C;&#x662F;&#x8F6C;&#x6362;&#x6210;insert + delete&#x3002;&#x5C06;&#x65E7;&#x884C;&#x7684;&#x5220;&#x9664;&#x7248;&#x672C;&#x53F7;&#x8BBE;&#x7F6E;&#x4E3A;&#x5F53;&#x524D;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x884C;insert&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x521B;&#x5EFA;&#x7248;&#x672C;&#x53F7;&#x4E3A;&#x5F53;&#x524D;&#x7248;&#x672C;&#x53F7;&#x3002;</li>
</ul>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x5199;&#x64CD;&#x4F5C;&#xFF08;insert&#x3001;delete&#x548C;update&#xFF09;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x53F7;&#x9012;&#x589E;&#x3002;</p>
<p><a href="http://www.xaprb.com/blog/2014/12/08/eventual-consistency-simpler-than-mvcc/" target="_blank" rel="external">If Eventual Consistency Seems Hard, Wait Till You Try MVCC</a></p>
<p><a href="http://blog.csdn.net/chosen0ne/article/details/18093187" target="_blank" rel="external">MVCC&#x6D45;&#x6790;</a></p>
<p><a href="http://www.jdon.com/46910" target="_blank" rel="external">&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x5176;&#x5B9E;&#x6BD4;MVCC&#x7B80;&#x5355;</a></p>
<p>&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#x63A8;&#x8350;&#x53EF;&#x91CD;&#x590D;&#x8BFB;<code>REPEATABLE READ</code>&#x8FD9;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x8FD9;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;ACID&#x3002;</p>
<blockquote>
<p>&#x8BB2;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x771F;&#x7684;&#x4E86;&#x89E3;&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x5417;&#xFF1F;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x4E8B;&#x52A1;&#x4F20;&#x64AD;&#x7279;&#x6027;&#xFF1F;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53C8;&#x9700;&#x8981;&#x5982;&#x4F55;&#x8003;&#x8651;&#xFF1F;</p>
</blockquote>
<p>java concurrent&#x5305;&#x4E2D;&#x7684;copyonwrite&#x7CFB;&#x5217;&#x5C31;&#x662F;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x4F18;&#x5316;&#x8BFB;&#x8FDC;&#x5927;&#x4E8E;&#x5199;&#x7684;&#x573A;&#x666F;&#x7684;&#x3002;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;copy&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#xFF0C;&#x5199;&#x5B8C;&#x540E;&#x539F;&#x5B50;&#x66FF;&#x6362;&#x6389;&#x65E7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5199;&#x64CD;&#x4F5C;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x8BFB;&#x64CD;&#x4F5C;&#x3002;</p>
<p><a href="http://www.iteye.com/topic/35907" target="_blank" rel="external">&#x89E3;&#x60D1; spring &#x5D4C;&#x5957;&#x4E8B;&#x52A1; </a><br><a href="http://www.cnblogs.com/yangy608/archive/2011/06/29/2093478.html" target="_blank" rel="external">&#x6D45;&#x8C08;Spring&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;</a><br>&#x300A;Java&#x4E8B;&#x52A1;&#x8BBE;&#x8BA1;&#x7B56;&#x7565;&#x300B;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x810F;&#x8BFB;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5E7B;&#x8BFB;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x810F;&#x8BFB;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5E7B;&#x8BFB;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x810F;&#x8BFB;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5E7B;&#x8BFB;"></a>&#x4EC0;&#x4E48;&#x662F;&#x810F;&#x8BFB;&#xFF0C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x5E7B;&#x8BFB;</h2><p><a href="http://www.cnblogs.com/phoebus0501/archive/2011/02/28/1966709.html" target="_blank" rel="external">http://www.cnblogs.com/phoebus0501/archive/2011/02/28/1966709.html</a></p>
<h2 id="&#x600E;&#x4E48;&#x9632;&#x6B62;&#x5E7B;&#x8BFB;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;"><a href="#&#x600E;&#x4E48;&#x9632;&#x6B62;&#x5E7B;&#x8BFB;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF1F;" class="headerlink" title="&#x600E;&#x4E48;&#x9632;&#x6B62;&#x5E7B;&#x8BFB;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF1F;"></a>&#x600E;&#x4E48;&#x9632;&#x6B62;&#x5E7B;&#x8BFB;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF1F;</h2><p>&#xFF08;update &#x2026; &#x770B;&#x662F;&#x5426;&#x66F4;&#x65B0;&#x5230;&#x4E86;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF09;</p>
<h2 id="&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;"><a href="#&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF1F;" class="headerlink" title="&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF1F;"></a>&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#xFF1F;</h2><p>&#x5728;MySQL&#x4E2D;update&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#xFF0C;&#x76F4;&#x5230;&#x8BE5;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x4E4B;&#x524D;&#xFF0C;&#x90FD;&#x4F1A;&#x9501;&#x4F4F;&#x8BE5;&#x8BB0;&#x5F55;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x80FD;&#x591F;&#x770B;&#x5230;&#x5176;&#x4E2D;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x5C31;&#x5F97;&#x4F7F;&#x7528;read uncommit&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x4F1A;&#x5F15;&#x5165;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x6743;&#x8861;&#xFF0C;&#x5982;&#x679C;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5219;&#x4F7F;&#x7528;<code>REPEATABLE-READ</code>&#x5C31;&#x591F;&#x4E86;&#xFF1B;</p>
<p>&#x5BF9;&#x4E8E;&#x6709;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x8FD9;&#x6837;&#x64CD;&#x4F5C;&#xFF1A;&#x5224;&#x65AD;&#x662F;&#x5426;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#xFF0C;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x5219;&#x4FEE;&#x6539;&#xFF0C;&#x53D1;&#x73B0;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#x53D8;&#x6210;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x8FBE;&#x5230;&#x7684;&#x6539;&#x52A8;&#x6548;&#x679C;&#x4E86;&#xFF1B;</p>
<p><strong>&#x5BF9;&#x4E8E;&#x6709;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x5224;&#x65AD;&#x4FEE;&#x6539;&#xFF08;&#x5355;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x624D;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x641E;&#xFF09;&#x3002;</strong></p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x4E50;&#x89C2;&#x9501;&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#xFF08;&#x7C7B;&#x4F3C;&#x62A2;&#x8D2D;&#x7CFB;&#x7EDF;&#x90A3;&#x79CD;&#x8D44;&#x6E90;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF09;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7684;&#x884C;&#x9501;&#x4E0D;&#x5982;&#x4F7F;&#x7528;Redis&#x7684;&#x4E50;&#x89C2;&#x9501;&#xFF0C;&#x9632;&#x6B62;&#x8BF7;&#x6C42;&#x7D2F;&#x79EF;&#x5728;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x901A;&#x8FC7;redis&#x76F4;&#x63A5;&#x8FC7;&#x6EE4;&#x6389;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x5408;&#x6CD5;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x51CF;&#x8F7B;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8017;&#x3002;</p>
<blockquote>
<p>&#x8BF7;&#x6C42; &#x2013;&gt;  redis&#x4E50;&#x89C2;&#x9501;&#x5904;&#x7406;  &#x2013;&gt;  MySQL</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x8FC7;&#x6EE4;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#x53EA;&#x4F1A;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#xFF0C;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x884C;&#x9501;&#x6765;&#x4FDD;&#x8BC1;&#xFF1A;</p>
<blockquote>
<p>update t_audio set like_num = 1 where id = id and like_num= 0. 1 row affected &#x8BF4;&#x660E;&#x66F4;&#x65B0;&#x6210;&#x529F;.&#x4E0D;&#x7BA1;&#x591A;&#x5C11;&#x5E76;&#x53D1;,&#x6570;&#x636E;&#x5E93;&#x90FD;&#x80FD;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x624D;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x3002;</p>
</blockquote>
<p><a href="http://www.ddhigh.com/2014/12/mysql%E4%BD%BF%E7%94%A8%E8%A1%8C%E9%94%81%E6%9D%A5%E8%A7%A3%E5%86%B3%E5%B9%B6%E5%8F%91%E6%9B%B4%E6%96%B0%E9%97%AE%E9%A2%98/" target="_blank" rel="external">MySQL&#x9AD8;&#x5E76;&#x53D1;&#x4E0B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</a></p>
<p><a href="http://my.oschina.net/u/1166271/blog/199947" target="_blank" rel="external">&#x8131;&#x79BB; Spring &#x5B9E;&#x73B0;&#x590D;&#x6742;&#x5D4C;&#x5957;&#x4E8B;&#x52A1;&#xFF0C;&#x4E4B;&#x4E09;&#xFF08;REQUIRES_NEW - &#x72EC;&#x7ACB;&#x4E8B;&#x52A1;&#xFF09;</a></p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/MySQL/" rel="tag">#MySQL</a>
          
            <a href="/tags/事务/" rel="tag">#事务</a>
          
            <a href="/tags/MVCC/" rel="tag">#MVCC</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/09/user mysql client/" rel="next" title="user mysql client">
                <i class="fa fa-chevron-left"></i> user mysql client
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/06/16/数据库事务使用规范/" rel="prev" title="数据库事务使用规范">
                数据库事务使用规范 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://raw.githubusercontent.com/arthinking/arthinking.github.io/blog/source/_posts/images/arthinking.jpg"
               alt="arthinking" />
          <p class="site-author-name" itemprop="name">arthinking</p>
          <p class="site-description motion-element" itemprop="description">Struggle for HighPay zoom.<br/>主站 http://www.itzhai.com/</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">114</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">32</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">49</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="http://www.itzhai.com" target="_blank" title="itzhai">
                  
                    <i class="fa fa-fw fa-home"></i>
                  
                  itzhai
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/arthinking" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/arthinking" target="_blank" title="Twitter">
                  
                    <i class="fa fa-fw fa-twitter"></i>
                  
                  Twitter
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/arthinkingplus" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        
          <div class="cc-license motion-element" itemprop="license">
            <a href="http://creativecommons.org/licenses/by-nc-sa/4.0" class="cc-opacity" target="_blank">
              <img src="/images/cc-by-nc-sa.svg" alt="Creative Commons" />
            </a>
          </div>
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#什么是分布式事务"><span class="nav-number">1.</span> <span class="nav-text">什么是分布式事务？</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#分布式事务如何处理"><span class="nav-number">1.1.</span> <span class="nav-text">分布式事务如何处理</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于本地系统线程重复请求的问题"><span class="nav-number">2.</span> <span class="nav-text">关于本地系统线程重复请求的问题</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于事务的四个特征"><span class="nav-number">3.</span> <span class="nav-text">关于事务的四个特征</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#acid"><span class="nav-number">3.1.</span> <span class="nav-text">ACID</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#怎么设置事务隔离级别"><span class="nav-number">4.</span> <span class="nav-text">怎么设置事务隔离级别</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#事务的隔离级别"><span class="nav-number">5.</span> <span class="nav-text">事务的隔离级别</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于事务的传播特性"><span class="nav-number">6.</span> <span class="nav-text">关于事务的传播特性</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#事务嵌套是个什么概念"><span class="nav-number">6.1.</span> <span class="nav-text">事务嵌套是个什么概念</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#平面事务模型和嵌入事务模型有什么区别呢"><span class="nav-number">6.2.</span> <span class="nav-text">平面事务模型和嵌入事务模型有什么区别呢？</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#什么时候应该使用propagation_nested"><span class="nav-number">6.3.</span> <span class="nav-text">什么时候应该使用PROPAGATION_NESTED</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#什么时候应该使用propagation_required_new"><span class="nav-number">6.4.</span> <span class="nav-text">什么时候应该使用PROPAGATION_REQUIRED_NEW</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#propagation_supports的作用"><span class="nav-number">6.5.</span> <span class="nav-text">PROPAGATION_SUPPORTS的作用</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#mysql的innodb引擎是如何实现mvcc的"><span class="nav-number">7.</span> <span class="nav-text">MySQL的innodb引擎是如何实现MVCC的?</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#什么是脏读不可重复读幻读"><span class="nav-number">8.</span> <span class="nav-text">什么是脏读，不可重复读，幻读</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#怎么防止幻读带来的问题"><span class="nav-number">9.</span> <span class="nav-text">怎么防止幻读带来的问题？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#通过事务保证一致性就会影响系统的可用性如何解决这类问题"><span class="nav-number">10.</span> <span class="nav-text">通过事务保证一致性，就会影响系统的可用性，如何解决这类问题？</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">arthinking</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  
  

  

  

</body>
</html>
